[
  {
    "text": "The Institute is a series of schools on multiple different planets, moons, and asteroids where Gold children between the ages of 16 and 18 are taught how to survive, lead, and conquer in preparation for becoming future political and military leaders of The Society.",
    "section": "General",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "There are multiple iterations of The Institute throughout the solar system, located on various planets, moons, and other astronomical locations. The planets of the Core have at least one Institute per planet, while the Rim and the Asteroid Belt typically share Institutes between multiple different moons and asteroids. Most Golds attend the Institute on the planet or moon of their birth, though some families will send their children to attend the Institute on a different planet or moon, such as when Romulus au Raa sent his eldest son Aeneas to attend the Institute on Ganymede in 743 PCE instead of the one on their home moon of Io.",
    "section": "Locations",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Unlike other planets and moons in the solar system, Earth has two Institutes. One is located in the Eastern Hemisphere, and the other in the Western.",
    "section": "Earth",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "On Mars, the central building where new students are welcomed into The Institute is built into the walls of the Valles Marineris, just outside the capital city of Agea. The main grounds of The Institute where students actually experience what the school aims to teach them are located eighty kilometers east of Agea within a remote terraformed valley in the upper arm of the Valles Marineris. The Institute of Mars was established in the late second century of the Post-Conquering Era, with its first class being held in 197 PCE. The events of Red Rising focus on the 542nd class at The Institute of Mars, held in 738 PCE from March to September. The list of houses and affiliated people in the 542nd class are as follows: {| class=\"wikitable collapsible\" width=\"800px\" style=\"font-size: 95%; color: gray; margin-right:auto\" |- ! width=\"3%\" |No. ! width=\"10%\" |House ! Insignia ! width=\"20%\" |Proctor ! width=\"15%\" |Primus ! width=\"35%\" | Other students ! width=\"15%\" | Conquered by |- ! 1 |Apollo | |Unnamed male; slain by Darrow for helping The Jackal by cheating |Novas | |Mars |- !2 |Bacchus | |Unnamed |Unknown | | |- !3 |Ceres | |Unnamed female |Unknown |Nyla |Mars |- !4 |Diana | |Unnamed female |Tamara |Tactus |Mars |- !5 | Juno | |Unnamed female |Unknown | Milia; Dax |Jupiter |- !6 |Jupiter | |Unnamed male, aided Darrow before the Lion's Rain |Unknown | |Pluto |- !7 |Mars | |Fitchner au Barca |Darrow | *Highdrafts: Antonia; Cassandra; Cassius; Cipio; Pollux; Roque; Titus au Ladros; Vixus *Middrafts: Lea; Quinn *LowDrafts and Sevro's Howlers: Sevro; Clown; Pebble; Screwface; Thistle; Weed *Killed in The Passage: Arria; Julian; Nexus; Priam au Caan | Won |- !8 |Mercury | |Unnamed male. Killed by Obsidian Valkyries under Sefi the Quiet in Morning Star. |Unknown | | |- !9 |Minerva | |Unnamed |Mustang |Pax, June |Mars |- !10 |Neptune | |Unnamed female |Unknown | | |- !11 |Pluto | |Unnamed |The Jackal |Lilath |Mars |- !12 |Venus | | Unnamed female |Unknown | | |- !13 |Vulcan | |Unnamed |Unknown | |Jupiter |} Sometime after 743 PCE, the Mars Institute was shut down by The Solar Republic, who converted it into a barracks and training ground for the Republic’s Seventh Legion. Upon arriving at the Institute, incoming students are shepherded into an open-air marble square in front of the school's gates that overlooks Agea and the rest of the",
    "section": "Mars",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Valles Marineris, with marble pillars on either side of the square. The building contains a communal dining hall shared by all Houses for the first night of the school year, with twelve tables corresponding to each House that are set for one hundred students each. After the Draft, the names of the students for each house float above the chairs in golden letters, with the seating arranged in the order students are drafted into the House. The projection of each students name is accompanied by a number representing the amount of questions missed on the entrance test displayed to the left of their name, while acts of merit earned before the Passage are tracked with golden bars displayed to the right. The dining hall is constructed from white marble with a classical architectural style and laden with scenery, including a holosky. ]] The climate of the valley where the war game takes place is artificially controlled by the proctors to mimic the normal cycle of Earth's seasons. The Institute campus features a mountain range on the western edge of the grounds, with the castle of House Jupiter located in a series of low mountain passes just south of the northernmost mountains. House Pluto’s castle is located underground in the low mountains farther south in the middle of the range on the eastern side. East of the mountains lies the Argos River, which flows from north to south near the middle of The Institute grounds. A tributary river flows into the Argos from the mountains north of Castle Jupiter. House Juno’s castle is located at the point where the two rivers join, northeast of Castle Pluto. House Vulcan’s castle is located to the southeast of Castle Juno, on the western shore of the Argos river itself, while another castle, presumably for House Venus, lies just to the southeast on the opposite shore. At the northern end of the Argos river lies the Northwoods, which are bordered by the Argo’s western tributary to the west and the Highlands to the east. South of the Northwoods lies the Castle of House Ceres, at the point where the eastern tributary flows into the Argos from the Highlands. The Highlands are home to the castle of House Mars, as well as two tower outposts on the western side of the highlands, named Phobos and Deimos for the planet’s two moons. Between the two towers lies",
    "section": "Mars",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "the point where the westward flowing River Furor and the southward flowing River Metas merge into a single tributary. The Postern Hills run along the northeastern edge of the Institute grounds, separated from the highlands around Castle Mars by a series of plains where the castle of House Minerva resides. South of the Highlands and Castle Minerva lie the Greatwoods, which make up a large portion of the eastern region of The Institute and are separated from the Argos River by open plains. House Diana’s castle lies in the northern part of the Greatwoods, southeast of the Highlands and southwest of House Minerva. The Greatwoods are made up of godTrees which grow as tall as buildings and block sunlight while their roots stretch out like tentacles. House Apollo’s castle sits near the southeastern edge of the Greatwoods. Meanwhile, another castle of an unknown house, presumably House Bacchus,",
    "section": "Mars",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "The Institute on Io is located in the moon's northwestern hemisphere on the edge of the Yellow Sea. ===Other Know Institute Locations=== *Mercury *Venus *Luna *Titan (Presumably for all of Saturn's moons) *Ganymede *The Astrodian Greek Cluster *The Astrodian Trojan Cluster *Europa *Enceledas *Ceres *Callisto * Hildas *Rhea (presumably) Little is known about the environment of the Ionian Institute, but it is infamous for its harsh conditions, with temperatures being described as capable of freezing a student's blood before it can drip from a wound.",
    "section": "Io",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Admittance into The Institute is determined by an entrance exam held several months before the beginning of the school year. The exam consists of both written and physical tests. Students who score significantly higher than the average on the written portion are subject to inquiries from the Board of Quality Control to verify that they did not cheat. Students who pass the exam receive an acceptance letter stamped with the personal seal of the ArchGovernor of the host planet or moon. These invitations are illegal to decline, and are sent to approximately 1,200 incoming students per Institute annually.",
    "section": "Enrollment",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "The written test is made up of hundreds of questions designed to assess the applicant's intelligence. The slangSmarts section is dedicated to gauging the applicant's extrapolation thinking skills.",
    "section": "Written Test",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "The physical tests measure the applicant's endurance and reflexes. Traits measured include: *How long the potential student can hold their breath *How long they can remain conscious without any oxygen in their lungs. *How long they can withstand extreme cold and extreme heat *How long they can withstand an increase in gravity *How much motion they can withstand without vomiting. *The student's heartbeat *The flow of oxygen in their lungs *The density and length of their muscle fibers *The tensile strength of their bones",
    "section": "Physical Test",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Upon arriving at The Institute, the 1,200 students at each campus are sorted into different Houses based on underlying personality traits. Some of the House crests are depicted in the picture to the right. During their time in the Institute, a student’s House is identifiable from the house symbol on each sleeve of their fatigues and either side of their high collars. Each student is also given a ring bearing the house symbol, worn on the middle finger of the right hand, which they are permitted to keep after the completion of the school year. After graduation, the schoolHouses function as networking tools and social clubs for the newly graduated Peerless Scarred to find sponsorships and professional connections. Most Institutes use the gods and goddesses of the Roman pantheon as the names of their schoolHouses. However, some, such as the Institute on Io, use the gods and goddesses of the Greek pantheon. Officially, there are twelve Houses. However, thirteen House names are mentioned in Red Rising.",
    "section": "Houses",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "The head of each house is known as the Proctor, who is responsible for taking care of their students and briefing them about the expectations of The Institute. They serve as guides and mentors to their House, but are not allowed to interfere directly with the students' trials. Proctors are directly hired by the ArchGovernor of the hosting planet or moon specifically for the position.",
    "section": "Proctors",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "A student’s placement in a given house is determined by a process known as the Draft. In the first stage of the Draft, students are interviewed individually by each of the Proctors to determine if the student fits the characteristic traits of their House. Following the interviews with the Proctors, the students are brought in groups of one hundred to a large room with a grid of large boxes along the wall. Each student sits on a floatChair in one of the boxes with a series of numbers and letters corresponding to their statistics displayed in front of them. From there, the students are observed and questioned by panels of influential alumni from each House known as Drafters, who select students one by one from each group until they have chosen one hundred students for their respective House. The Proctors use the results of the individual interviews to advocate in favor of specific students, but the Drafters ultimately have the final say. The first student drafted into a House is referred to as the firstDraft. In 738 PCE, Darrow au Andromedus was the House Mars firstDraft after being passed over by House Mercury. Students that are selected early in the drafting process are known as highDrafts, and are generally in the top one percent of applicants to the Institute. Students that were selected late in the drafting process are known as lowDrafts. They are generally in the bottom one percent of applicants to the Institute and are expected to be killed in the Passage. Students selected after the highDrafts but before the lowDrafts are referred to as midDrafts, and presumably make up the majority of Institute students. Some students, called Premiers, are able to bypass the drafting process entirely by having their House chosen for them by their parents. In the 738 class at The Institute of Mars, Priam au Caan and Adrius au Augustus were Premiers for House Mars and House Pluto, respectively.",
    "section": "The Draft",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "The student in charge of each House is known as the Primus, with appointment determined by a merit system. For each act of merit, ranging from getting high marks on the entrance test to capturing or recapturing a House’s standard, the student gains a merit bar. The first student to gain five merit bars becomes the Primus. The Primus of a House is identified by a badge and a pin depicting a golden hand, with the latter worn around the neck. The Primus that manages to lead their House to victory against all other Houses for their year earns the title of ArchPrimus.",
    "section": "Primus",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "* Nero au Augustus - 489th or 490th class on Mars * Arturius au Vardan - 520th class on Mars * Darrow au Andromedus - 542nd class on Mars",
    "section": "Known ArchPrimuses",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "'s Passage in Sons of Ares, Volume 1]] The Passage is a ritual on the first night at The Institute in which half of the students in each House are killed by the other half. Students are roused from their beds shortly after midnight by Obsidians and beaten before being taken from the Institute’s main building to the actual campus via ship, with a specialized hood over their head designed to prevent students from hearing anything happening around them. Once at the main campus, the student is brought to a room beneath a castle designated for their House, where they are paired with a classmate from their House and informed by their Proctor that only one of them will leave the room alive. The Proctor leaves a House ring with each pair of students before leaving them to fight to the death. The pairings are determined according to each student’s scores on the entrance exam, with high-scoring students being paired with lower scoring ones, and strong students being pitted against the weak. This sometimes backfires, since the strength of the student is judged by the entrance tests alone, which leads to cases where lowDrafts such as Sevro au Barca kill their highDraft opponents. The Passage was developed by the Board of Quality Control as a continuation of their policy of “reinforcing natural selection”, and is intended to ensure that only the Golds who possess the qualities that The Society values will survive The Institute.Additionally, the trauma of taking a life is intended to establish unity among the House through the surviving student’s shared guilt and the desire for reassurance that they are not evil. After the Passage, the surviving students are released from the underground rooms and make their way upstairs to their House’s castle, after which the underground rooms are sealed off. Once all of the surviving students have gathered in the castle, the Proctor arrives to explain the purpose of the Passage, and the following day is spent on giving the students an orientation of the expectations for them to succeed at The Institute.",
    "section": "The Passage",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "After the conclusion of the Passage, education at The Institute consists of a mock war in which the Houses go to war with each other and dominate all others using whatever tools they have at their disposal. The Proctors observe the students’ performances and provide additional resources as bounties for their successes. Each House is given a standard that represents their command of the House, with the objective of the war game being fulfilled by capturing the standards of rival Houses while protecting their own. The standard is six feet long and consists of a five-foot oak pole connected to a one-foot length of metal tipped with the House’s insignia, a coiled serpent, and the star-tipped pyramid of The Society. The type of metal used for the standard varies between Houses. Touching the standard to the forehead of a student from a rival House marks them as a slave to the House that captured them, who they are compelled to obey until either they are freed or the war game ends, or else risk losing out on employment prospects after graduation. When a House is defeated, the Proctor is required to vacate the campus for the remainder of the school year and report to the Drafters to explain what went wrong. A standard school year at The Institute is projected to last for ten months, however individual years can be longer or shorter depending on various factors such as the students' performance. For example, the 542nd class of the Mars Institute completed their education after only seven months, while the war games at the Institute on Io have been known to last for multiple years. The Institute of Mars begins in December of the starting year and continues into the following year. The Proctors monitor the progress of the war games through the use of biometric nanocams attached to the students’ House rings, as well as other cameras hidden around the campus. After a half-day delay for editing purposes, the footage is made available to all Drafters and other Peerless alumni so that they can determine which students they may be interested in offering apprenticeships to. The purpose of the various tests and war games that the students are subjected to is for the best of Gold to rise in Society based on merit alone. However, corruption often results in various aspects of The Institute being rigged to favor students",
    "section": "Curriculum",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "from prominent families. For example, powerful Golds will sometimes rig the math-ups in The Passage to kill off the children of their political rivals, while Martian ArchGovernor Nero au Augustus bribed, threatened, and cajoled all of the Proctors on Mars in 737 PCE into rigging the war games to ensure that his son would become ArchPrimus.",
    "section": "Curriculum",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Students graduate from The Institute once the war game ends with only one House left unconquered. Graduates of The Institute typically fall into one of three ranks: *The highest performing students become Peerless Scarred and are able to ascend in Society, typically by impressing a powerful patron through their performance at The Institute and opening up apprenticeship offers as a result. * Students who performed well enough to ascend in Society, but did not perform high enough to earn a Peerless Scar are simply referred to as Graduates, and have comparatively limited prospects as a result until they earn their Scar. *Students who are enslaved by a rival House but refuse to obey orders are considered Shamed, and are typically sent to distant colonies like Pluto to oversee the first years of terraforming. The ArchGovernor of the hosting planet or moon calls out the students who received the rank of Peerless Scarred one by one, with the winning House going first and the remaining houses following alphabetically by House name, and cuts the scar into each student's right cheek with their razor.",
    "section": "Graduation",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Prior to 743 PCE, Venus only had one Institute. When the Solar Republic took control of Mars, Earth, and Luna after The Fall, multiple new Institutes were established on Venus to accommodate the Gold families loyal to the Society who had fled to Venus and Mercury alongside the planet’s native Gold population. Unlike the Institutes before the Solar War, control of these Institutes was divided between the most prominent Venusian families that made up the leadership of the Society Remnant, Saud and Carthii, rather than being under the exclusive control of the planet’s ArchGovernor.",
    "section": "Venus",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "Knowledge of the specific workings of The Institute is a carefully guarded secret so that the Board of Quality Control can ensure that students who succeed do so based purely on merit rather than on being well connected. As a result, even the children of alumni are kept in the dark about what attending the school entails until they arrive, though parents are allowed to mention the ranks they earned at The Institute without giving away the specifics of how they earned them. This secrecy gives the school an air of mystery among non-attendees, from Gold children to other colors, who remain in the dark about how the school truly operates. Some believe that the students learn in classrooms, while others see it as a culling ground where Golds go to hack at one another till the strongest in mind and body is found. Among Golds who are aware of the specifics of the school, the Institutes on different planets have developed reputations throughout the solar system as a result of various trends and incidents throughout the history of The Society. * The Institute of Mars is famous for its violence and brutality, with notable instances of cannibalism and mutilation occurring in various years. *Venus is infamous for the frequency of incidents where students of the Institute have been raped their classmates.",
    "section": "Reputation",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "* Red Rising chapter 20 incorrectly refers to the campus of the Martian Institute being located in the southernmost part of the Valles Marineris, while the illustration of its location on the book's map and Darrow's narration in Golden Son consistently place it one of the northern offshoots of the canyon system.",
    "section": "Trivia",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  },
  {
    "text": "es:Instituto hu:Intézet Category:Locations Category:School",
    "section": "References",
    "name": "The Institute",
    "type": "locations",
    "series": "Red Rising"
  }
]