[
  {
    "text": "The Conquering is the event that spawned the Society and solidified Luna as the core power in the Solar System. Luna declared its independence from Earth, and the spheres waged war on each other. The forces of Luna won out, and eventually, the Golds of this generation were called the \"Iron Golds\".",
    "section": "General",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "The main powers at the time of The Conquering were the Indian Empire, called \"one of the last great nations to stand against Gold,\" and the American Empire, which is said to have had railguns described as \"the fear of all Luneborn.\" Clues indicate that the general population of Earth was unaware of all that was going on with the Golds, and the last remaining generation on Earth were referred to as the last \"natural born humans.\" We are told in Nero's speech before Darrow enters the Institute that the nations had grown jealous of one another, that the Americans were self loathing and self neutering, and that the other nations were united against them. And that the countries of Earth hoarded their resources; In constant suspicion of one another. Humans on Earth were said to have succumbed to pleasure, using science for \"toys\" instead of exploration. They had developed robots, which were later outlawed by the Society because they \"neutered the work ethic of mankind.\" Pre-Conquering Earth was divided into 20 different factions with nuclear weapons. A Third World War resulted, wrecking the planet and ruining its infrastructure - making it even more vulnerable to attacks from Luna.",
    "section": "Pre-Conquering Earth",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "As stated before; Earth grew greedy, Earth grew lustful for riches, and Earth paid the price. Over the decades and centuries of Luna's expansion and solidification of their power in the Solar System. It was the economics which the society unleashed and maintained, that turned Luna into the port and power in the solar system. Yet they still remained in the dominion of Earth, which was a \"drain on their profits\", as they were heavily taxed and owned by corporations and countries planet side, though they could not enforce their ownership. Unable to fully assert their control and authority over Luna, Luna came to realize that their Masters were nothing but a plague of \"entitled locusts\". Resulting in Luna attacking Earth, declaring war to break the chains that they held so loosely on the moon.",
    "section": "Motivation",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "At this current moment there aren't many details in regards to the battles of the Conquering. However, it is labeled as a massacre of cities and continents alike. Throughout the war there were multiple frontiers in which Earth and the Society fought. Many notable Golds were able to establish themselves and their familial houses within the Society for centuries to come. The invasion of Earth started with a dreaded Iron Rain in 0 PCE.",
    "section": "The Conquering",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "The first Gold to land in the Iron Rain was Seneca au Grimmus, who took the American Eastern seaboard. There is also Scipio au Bellona, who destroyed the Atlantic Fleet. An unnamed Augustan, presumably the founder of House Augustus, decapitated the last ruler of the Indian Empire and stole the rug on which he was beheaded. It still holds his bloodstain 700 years later. While it is not known who did the deed, the Britannic Armada was burned above Earth's north pole sometime during the Conquering by the first Gold families that migrated to Mars. This same fleet was able to destroy Japan's fasted ships amid the asteroid belt.",
    "section": "The Society",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "Alfred Jones was an American general who went mad and lost his Imperium's infamous and dreaded MECH division in The Conquering. Yet there is always one man of Earth that still centuries after The Conquering is remembered by both highColors and low. John Merrywater, the man who nearly turned the tide of the war. He was an American General that lead the final counterattack against the Lunar invaders. Merrywater's counterattack managed to reach Luna itself. However, despite his military genius he ended up being defeated and crashed his flagship, the USS Davy Crockett, into Luna's Atlas Mountains, where it still stands seven hundred years later. Little is known about his final charge but we do know that it almost changed the tide of the war and saved Mankind from centuries of slavery.",
    "section": "Earth Forces",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "The war is said to have ended in a casualty total of roughly one hundred and ten million lives on the side of Earth. With so much blood on the hands of the Golds, they looked to a bloodless genocide to end the threat that Earth held against them once and for all. After harvesting as many survivors as they could for the hierarchy - including many immigrants from Ireland who would become the first Reds to mine for helium-3 in the terraforming of Mars - the Golds dropped solocene into the Earth's troposphere, sterilizing the remainder of Earth's population. It took no less than a century for the last generation of pre-Color humans to die out. Yet this perhaps did not come without repercussions. It has been theorized that the sterilization of those on Earth caused a division between good friends Silenius au Lune and Akari au Raa, resulting in Akari to leave for the moon Io. It is believed by some Golds that with their victory, it put an end to the chaos and anarchy that seeped out of the Earth and its Empires. With its end, all that remained was peace for the first time in humanity's history and thus the Pax Solaris was born. Over the centuries, Earth was acknowledged as Terra, and its populace Terrans. With its conquest, the Golds took it upon themselves to declare land and territories for themselves on the planet. Reorganizing the planets previous control of 20 independent nations to the rule of Governors and ArchGovernor. Terra under Gold rule established two Institutes, one for the Eastern Hemisphere and one for the Western. Furthermore, in an ironic turn of events, Luna became dependent on Terra for food and other luxuries, thus fueling the machine of The Society.",
    "section": "Aftermath",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "Silenius au Lune and Akari au Raa stood together as friends during The Conquering and created the original Pax Solaris. They were referred to as the \"scepter and the sword.\" The two are seen as the founders of The Society, who freed the new Society from ''\"Earth's dominion\". Pierce stated in an AMA that Silenius and Akari were \"best friends turned mortal enemies.\"'' Many believe the schism between the Rim Dominion and The Core began here, likely due to the two disagreeing with the extermination of the natural born humans on Earth. Akari au Raa was ultimately buried in the Dragon Tomb, a giant black obelisk that is revered by the Raa, and which they used in their death-related ceremonies.",
    "section": "Disagreements",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "Society * Silenius au Lune, leader of the Luna Rebels and first Sovereign of The Society. Founder of House Lune. *Akari au Raa, second in command of the Luna Rebels. Founder of House Raa. * Scipio au Bellona, breaker of the Atlantic Fleet. Probable founder of House Bellona * Seneca au Grimmus, the first to touch down in the Iron Rain after Scipio was able to defeat the Atlantic fleet. * Vitalia au Grimmus, sister of Seneca. Both were the founders of House Grimmus Earth * Alfred Jones, unstable American general that lost the mech divisions of the American Empire. * John Merrywater, not so unstable American general that lead the final charge against Luna and almost won. He is remembered by the Society in the phrase \"Merrywater Ad Portas\" which is used as the motto of their military, an eternal reminder of the American that nearly beat them, and that the enemy is always at the gate.",
    "section": "Notable Figures",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  },
  {
    "text": "Category:Wars es:Conquista hu:Hódítás",
    "section": "References",
    "name": "The Conquering",
    "type": "events",
    "series": "Red Rising"
  }
]