[
  {
    "text": "Cassius au Bellona is a Gold of the Martian house Bellona, the son of their leader Tiberius. He's shown to be arrogant and careless, but values the people he keeps close. He is the favorite of his family; his twin brother, Julian, was killed in the Passage, while his older brother, Karnus, is portrayed as the 'monster' that cleans up family business.",
    "section": "General",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius was born to one of the most ancient, powerful and wealthy families on Mars. He had a twin brother, Julian au Bellona. The two were the youngest children of Tiberius and Julia. Cassius is also Tiberius' favorite son. Cassius loved his twin brother Julian very dearly and always looked after him. As a boy, Cassius wounded an eagle with a slingshot. Crying and unable to put it out of its misery, he took it to his older brother Karnus, who dropped a rock on it. Naturally talented and clever, he was good at everything he did, but because of his good looks and Gold origin, he became more arrogant and vain after his time at the Institute.",
    "section": "Background",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius is an arrogant Gold, who at times couldn't care less about his actions. He makes friends with Darrow, but has different sides to him at certain points in the story. He cares for Darrow at the beginning, and they are good friends, but when he finds out that he killed Julian during the Passage, he is filled with wrath and only seeks vengeance for his brother's death. Cassius values honor above all else. Despite his arrogance and bitterness, he cares greatly for those he's close to, including Darrow and Lysander. He has shown this several times throughout the books, a trait that he likely shared with Julian.",
    "section": "Personality",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius is depicted as 'the perfect Gold'. He has golden, thick curly hair, and gold eyes. He is very handsome and has a powerfully built body due to his training. He is 7’1 (2.15m) tall, the same height as Darrow. Darrow first described him as having a \"wide and white\" smile, with \"smooth and lustrous\" skin. In Golden Son, Darrow goes on to describe Cassius as \"so pretty he's ugly.”",
    "section": "Appearance",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius vies for Primus of House Mars against Darrow. Initially they are close friends, almost brothers to one another, along with Roque. Later Cassius learns it was Darrow that killed his twin brother, Julian, in the passage. Cassius betrays Darrow, duels him with ionBlades and leaves him for dead. When Darrow returns to Castle Mars after creating his own faction, Cassius declares a bloodfeud against him. Golden Son Cassius shows how good he is at dueling with the razor, and quickly rises to become an Olympic Knight as a result of the Sovereign's favoritism. He meets Darrow again after two years at the Sovereigns gala. Darrow demands satisfaction for his honour and tips a glass of wine on Cassius’ lap. They enter into a duel. Darrow feigns exhaustion and lets Cassius beat him for the first part of the duel. He later goes on to participate in the massacre at Darrow's Triumph, killing Ares. Morning Star Some time after attempting to stop Darrow in the Arctic, Cassius gets captured by the Howlers in a raid on Sun Industries Headquarters. He spends four months captive in the Morning Star. Later, Cassius was allowed to escape before the ship got to Earth, but he uses this moment of weakness to \"kill\" Sevro and hold Darrow and Mustang hostage. He plans on delivering the two and Sevro's body to the Sovereign, however this was all part of another plan. Cassius helps to kill Aja au Grimmus and the Sovereign, due to the latter's part in the murder of the House Bellona children. After Octavia's death, Cassius protects Lysander from being killed. A few months later, they set off from Luna. Solar Wars In the years since the Battle of Luna, Cassius and Lysander have roamed the asteroid belt protecting cargo ships from pirate attacks. They recruit a pilot, Pytha xe Virgus. Iron Gold While investigating an Ascomanni attack on the Vindabonda, Lysander rescues a Gold girl his age who had paid the captain to deliver her to a particular asteroid. The girl gives them directions for another asteroid where she claims they will find help, and upon arrival their ship is boarded by Krypteia agents from Io under the command of Diomedes au Raa and Pandora. The identity of the girl is revealed as Seraphina au Raa. Alongside Romulus' wayward daughter, Cassius and Lysander are taken back to Io as prisoners. Before Romulus",
    "section": "Red Rising",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "can have the two executed as suspected spies, Dido au Raa initiates a coup against her husband, and offers hospitality to Cassius and Lysander as thanks for saving her daughter. As they take advantage of Dido's hospitality in Sungrave, Cassius and Lysander begin to drift apart, Lysander having become enamored with the percieved order and efficiency of the Rim. At a dinner with the Raa family, Cassius' identity is exposed, and he is forced into three consecutive duels. As Lysander reveals his own identity and offers to give Dido what she wants in exchange for their safety, Cassius collapses from blood loss, and Diomedes' men rush him away for medical treatement. Later that night, Lysander is informed that Cassius had died from his wounds, and that friends of his fallen opponent taken his body into the wastes to desecrate it. Dark Age In reality, Cassius survived, and Diomedes shuttled him to an estate on Europa, where he was placed under house arrest, to be released once the war ended. Cassius escaped, and managed to reach Mars two months later in the still-damaged Archimedes. Upon returning to Republic space, he warned them that the Rim was in talks to ally with the Society Remnant and offered his services. With Virginia incapacitated by Caraval's coup, Kavax sent Cassius to Mercury to evacuate Darrow and the core leaders of the Free Legions. Light Bringer After reuniting with Darrow, Cassius accompanied him to Venus to rescue Sevro, who had been kidnapped by Apollonius au Valii-Rath, only to end up being captured themselves. Sevro, who had already escaped, frees the others and helps them escape Venus. Later, Cassius trains Darrow in swordplay, leading him to adopt the \"Breath of Stone\" technique. After Diomedes tricks Darrow and Lysander into meeting together, Cassius eavesdrops on the meeting and seeks into Lysander's quarters, offering to help him kill his immediate superior, Atlas au Raa, so Lysander can make peace and end the war. Lysander finds himself unwilling to refuse Cassius and the pair stage an ambush against Atlas. While the pair are successful in killing the Fear Knight, he uses his last words to inform Cassius that Lysander is using him to steal Eidmi, a biological weapon, from him. Lysander and Cassius then argue over what do with Eidmi; Lysander wants to use it, but Cassius insists on destroying it. Though Lysander implores Cassius to leave, he refuses",
    "section": "Red Rising",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "and attacks; Lysander shoots his surrogate father dead. Devastated, he frames Cassius as an assassin sent by Darrow to assassinate him and uses this pretext to devastate Io. Pytha, distraught and enraged by Lysander's actions, defects to the Republic with Cassius' body. Sevro and Darrow held a private funeral for their friend.",
    "section": "Red Rising",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius and Darrow have a complicated relationship, with them initially befriending one another. They fought together at the Institute and worked well side by side. However, Cassius learns that Darrow killed Julian, Cassius's twin brother, during the Passage, and thus betrays Darrow and stabs him. Darrow is able to survive and even achieves victory at the Institute. Cassius, defeated, swears revenge against Darrow for the death of his brother. In Golden Son, Cassius attempts to use his new relationship with Virginia au Augustus to hurt Darrow, but he is soon after beaten badly by him and publicly humiliated in a duel. Cassius loses his arm in the duel and loses face before the Sovereign. His entire family is later massacred, and Darrow is blamed for it. Cassius is eventually one of the key reasons for Darrow's downfall and capture in Golden Son, killing Ares and taking Darrow's ring from him. In Morning Star, they are reunited after a year, where Darrow has been badly tortured. Cassius is shocked by how Darrow has been treated, and even shows him some pity by giving him a cloak to warm him. Darrow escapes from captivity, and soon after defeats Cassius and imprisons him instead. Darrow treats Cassius well, however, and slowly they are able to reconcile their old friendship after Roque au Fabii's death and funeral. Cassius learns the truth that the Sovereign was behind the death of his family, and aids Darrow, Mustang, and Sevro in defeating her. Cassius leaves shortly after with Lysander in a self-imposed exile, though not before returning Darrow's ring and parting with him in forgiveness and friendship, even calling him brother.",
    "section": "Darrow",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius meets Virginia at the Institute, knowing her as Mustang and not knowing that she is the daughter of Nero au Augustus, an arch rival to his family. He finds her beautiful and intimidating, and somewhat like his mother, while Mustang finds Cassius to be foolish but handsome. However, they have little to do with one another, as Mustang later helps Cassius's enemy Darrow achieve victory in the Institute. In Golden Son, Cassius and Virginia are in a relationship together in an effort to make peace between their families. They are practically engaged, and Cassius attempts to use his new relationship to hurt Darrow, who has feelings for Virginia. After Cassius's defeat to Darrow and near death, it is Virginia who convinces Darrow to spare his life and tends to his wounds after. However, Virginia ends her relationship with Cassius in order to join Darrow and her father, and becomes Cassius's enemy. She begins a relationship with Darrow and reveals that she had only been with Cassius to ensure the safety and security of her family, and not out of love or deep romantic feelings. In Morning Star, they interact very little, though Virginia again convinces Darrow to spare him. They work together later to defeat the Sovereign, and Cassius leaves in self-exile as Virginia stays with Darrow and their son together to reshape the Society. For some time after Morning Star, Cassius's unreciprocated romantic attraction towards Virginia persists - although it is not known if he still bears these feelings.",
    "section": "Virginia",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"We all deserve the worms, Raa.\" -- Cassius to Seraphina in Iron Gold * “Well, I do believe I am the lightning. And you, my brooding friend, are the thunder.” - Red Rising, Ch. 31: The Fall of Mustang * \"''She's pretty as a peach, but she's all rotten inside. I took a bite once, if you catch my flow. Tasty, then putrid.\" - Red Rising, Ch. 15: The Testing * \"Up for a race, Darrow?\" - Red Rising, Ch. 21: Our Dominion * \"I'm foxy, but I'm not a beast. I just win.\" - Red Rising, Ch. 22: The Tribes * \"They made their beds. Now let them shit in them.\" - Red Rising, Ch. 23: Fracture * \"Then it's to be a merry quest!\" - Red Rising, Ch. 30: House Diana * \"I wish it was easier to hate you\" (to Darrow) - Morning Star, Ch. 50 Thunder and Lightning * \"My goodmen, it's uncivilized to do anything but laugh in the face of death. Why do you think I'm always so jaunty these days?\" - Light Bringer, Ch. 61 * \"I must. I am Cassius Bellona, son of Tiberius, son of Julia, brother of Darrow, Morning Knight of the Solar Republic, and my honor remains.''\" - Light bringer, Ch 84 Hanger 17B",
    "section": "Quotes",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius IG.jpg Cassius-by-simona.jpg Cassius-2-by-pbdoodles.jpg Cassius halarts.jpg Cassius-by-parisa.jpg Cassius-justice-phantom-rin.jpg Cassius atubbs74.PNG Cassius bookmark merwild.PNG Cassius by youthfullyfelt jon.jpg File:Casio vertical.png|“I am Cassius au Bellona, son of Tiberius, son of Julia, Morning Knight, and my honor remains.”",
    "section": "Gallery",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Gaius Cassius Longinus was a Roman patrician who was complicit in the plot to kill Julius Caesar.",
    "section": "Trivia",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Casio au Belona hu:Cassius au Bellona Category:Golds Category:Characters Category:Males Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Iron Gold Characters Category:Dark Age Characters Category:Olympic Knights Category:Light Bringer Characters Category:Deceased",
    "section": "References",
    "name": "Cassius",
    "type": "characters",
    "series": "Red Rising"
  }
]