[
  {
    "text": "Clown is a Gold in Darrow's class at The Institute and one of the original Howlers.",
    "section": "General",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "One of Clown's most distinguishing features is his puffy hair.",
    "section": "Appearance",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Clown was one of the lowDrafts of House Mars in Darrow's class at The Institute. At dinner after the Draft, Cassius au Bellona coins his nickname because of his hair. When House Mars divides into four tribes during the first week, Clown is one of the original members of Darrow's tribe. During the first battle between Darrow's forces and House Minerva, he tries to stop Pax from going for Darrow but is thrown aside like a doll. Before Cassius and Titus duel, Clown and Screwface are the ones to bring out the weapon choices. In the Institute under Sevro's command, and with Thistle, Screwface, Pebble, and Weed, he becomes one of the original six Howlers. Thus helping Darrow stay in power as the other students began to fear the Howlers. During the second battle between Darrow's forces and House Minerva, Clown is one of the Howlers who are hidden in the dead horses. During Darrow's assault on Olympus, the Howlers find Proctor Juno naked in the baths and try to take her down. She manages to break Clown's arm and starts to drown him with her legs, but Sevro stuns her with a stolen scorcher. After Olympus is taken, Darrow and the Howlers return to House Mars where Clown and Pebble are ordered to enslave the besieging Jupiter, Apollo, and Pluto students.",
    "section": "Red Rising",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Clown came to Luna with the rest of the Howlers on Virginia's summons and aided Darrow and House Augustus in fleeing the moon after The Gala Massacre. After Quinn is beaten by Aja au Grimmus during the escape, Clown helps to cut Quinn's hair so that The Jackal can operate on her in an effort to save her life. When Tactus au Valii-Rath betrays them and leaves with Lysander au Lune, he knocks Clown unconscious and steels his gravBoots to make his escape. Clown fell with Darrow's squadron in the Lion's Rain and accompanied him as he tried to hunt the Sovereign. When Darrow wakes up a week after the Lion's Rain, he and Virginia find Clown eating breakfast with the rest of their friends.",
    "section": "Golden Son",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sometime after The Fall, Clown married fellow Howler Pebble. He and his wife are present in the Howler Den when Darrow explains his plan to infiltrate Venus for an unsanctioned mission to assassinate the Ash Lord. Clown accompanies Darrow on the mission and participates in the infiltration of Deepgrave and the Battle of Gorgon Isle. Clown is seriously injured in the battle, but survives and returns to Luna with Sevro after the Ash Lord informs them about the kidnapping of Pax and Electra.",
    "section": "Iron Gold",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In Dark Age, he is captured by the Abomination and his Boneriders along with Sevro and Pebble.",
    "section": "Dark Age",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Pebble",
    "section": "Family",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Clown is close friends with Darrow.",
    "section": "'''Darrow O'Lykos'''",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Clown is close friends with Sevro.",
    "section": "Sevro au Barca",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Howlers.jpg",
    "section": "Gallery",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "hu:Bohóc es:Payaso Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Iron Gold Characters Category:Golds Category:Males Category:Sons of Ares Category:Characters Category:Dark Age Characters Category:Howlers",
    "section": "References",
    "name": "Clown",
    "type": "characters",
    "series": "Red Rising"
  }
]