[
  {
    "text": "'''Dancer O'Faran''' is one of the Sons of Ares who oversaw Darrow's transformation into a Gold after his faked death. He was the leader of one of the cells on Mars and later rose to become one of the highest ranking members of The Rising.",
    "section": "General",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer is fair, kindly, and accommodating, treating Darrow well when he helps rescue him and shows his faith and affection for the young Red many times. He is a shrewd, wise leader of his people and is naturally suspicious. He is less extreme than Harmony, not believing in her vicious methods of war, and abhors the practice of torturing a prisoner for information. Despite being a fair man and a reasonable one, he is not fond of Golds, and is suspicious and withdrawn from them, never fully trusting in them. Dancer is also homosexual.",
    "section": "Personality",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer is described as having rugged features with a body covered in snakebites, as well as having a limp. Darrow also describes him on multiple occasions to be handsome. \"But he’s thick and terribly old, maybe in his forties. White swirls from his temples. A dozen twin scars mark his neck. I’ve seen their sort before. Pitviper bites. The arm on the left side of his body hangs limp. Nerve damage. But his eyes arrest me; they are brighter than most, swirling with patterns of true red, not rust red. He has a fatherly smile......Yet still he’s an impressive man, thicker than Barlow, handsomer than me despite his age and the bite scars on his neck.\"",
    "section": "Appearance",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer was a helldiver who managed to survive his profession despite the danger and the numerous snake bites. In 729 PCE, he was castrated and exiled from Faran because of his sexual orientation. He was found by Ares, who healed him and recruited him as one of the leaders of the Sons of Ares.",
    "section": "Pre-Saga (699-736)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Recruited Darrow into the cause.",
    "section": "Red Rising (737-738 PCE)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "While Sevro is in far orbit, Ares and Dancer contact him. Upon meeting in person, Dancer shows Sevro the carving video of Darrow. Sevro joins the Sons of Ares and remains fiercely loyal to Darrow. Months later, during a botched assassination attempt on the Jackal, Darrow is reunited with Evey, Harmony, and the Sons of Ares. Harmony appears to lead the Sons, explaining that Dancer was killed during a raid on a Sons compound. After seizing control of the Ash Lord's flagship, Sevro shares a secret message from Ares and Dancer. Ares reveals that Harmony had actually betrayed the Sons in favor of more radical terrorist methods. Dancer is very much alive and tells Darrow that his family is safe. Darrow is relieved that Sevro knows the truth about the carving, the Sons of Ares, yet still accepts Darrow. At a secret warehouse on Mars, Darrow and Sevro meet the Sons of Ares including Dancer. There, Fitchner reveals himself as Ares. The Sons plan for Darrow to continue his rise through the Society in order to eventually become Sovereign.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro rescues Darrow from solitary confinement by the Jackal. He wakes in Tinos, the City of Ares, and reunites with his family as well as Dancer. Sevro and Dancer brief him on the events during the past 12 months of his imprisonment. Dancer reveals that is was Harmony that betrayed him to the Jackal.",
    "section": "Morning Star (743 PCE)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer is now a senator in the Solar Republic. Believing Darrow to be a warmongering tyrant like the Golds before, he brings forth Julia au Bellona, who offered peace talks. Following this he is described as leading the cause to have Sovereign Virginia au Augustus impeached.",
    "section": "Iron Gold (753 PCE)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was in the thick of the fighting to free Mars during the tunnel wars, or The Rat War. He suffers from nightmares and most likely PTSD but refuses to take Yellow synthetics. Only when Mars and her moons were declared free did he found the Vox Populi, the \"Voice of the People,\" a socialist lowColor party to counter what he saw as undue Gold influence over the Republic.",
    "section": "The Solar War (743-753 PCE)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "When Dancer goes to meet with Deanna O'Lykos for a friendly visit, he is confronted by Virginia and Sevro. They show him memories taken from the Duke of Hands of his sexual relationship with the assassin. At first he is furious at them, thinking they're there to blackmail him for his vote to go with Virginia, but they had thought he was aiding the Syndicate in Pax and Electra's kidnapping. Turns out he didn't realize he was sleeping with the Duke of Hands and had only known him as Faustus. It is then theorized that Dancer was to take the fall for the one who actually is aiding the Queen of the Syndicate, and concluded that it was Publius cu Caraval. Dancer had kept his relationship a secret as Reds are the ones that do not condone homosexuality, for which he was beaten and castrated with fire, by his own clan, and that it was Fitchner au Barca that saved his life, which is why he stood by him. He tells them he will put in his votes for Virginia. But during the Forum, as he's making his speech and is about to call his vote for Mustang, he coughs up blood, collapses, and dies from poison. This begins the Day of Red Doves.",
    "section": "Dark Age (753-754 PCE)",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "It is revealed in Dark Age that Dancer had an on-off intimate relationship with The Duke of Hands, though he was unaware of the Duke's transgressions, including his involvement in the kidnapping of Pax and Electra.",
    "section": "The Duke of Hands",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer and Darrow have something of a father-son relationship, with Darrow preferring Dancer's company to that of Harmony or even Mickey and Matteo. Dancer treated Darrow respectfully and showed concern and affection for him over the course of his carving. He would gift Darrow with keepsakes from Eo, so as to remember his mission and heritage, as well as Eo's love and dream. Dancer's knifeRing is sent to Darrow during the Institute. Darrow was deeply aggrieved in Golden Son when he thought he was dead, and was delighted to learn that he was alive and in hiding. In Morning Star, Darrow and Dancer work alongside one another for The Rising. Darrow tells Dancer that he considers him to be family and loves him.",
    "section": "Darrow",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer reveals that his clan had castrated him, leaving him for dead, when Ares had found him bleeding to death in a tunnel. Fitchner saved him and healed him, teaching him and showing him his worth. It was ten years later when he found out Ares was Fitchner, a Gold. Though angered at first, he realized that Fitchner judged him only by his actions, not by his caste, and thus had learned to do the same and stood by him. Dancer considers Fitchner his hero.",
    "section": "Fitchner au Barca",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Quicksilver-fitchner-dancer-mbenskydesigns 071820.jpg Dancer-gorydamnreaper.jpg Dancer dustinturk.PNG Dancer and Ares Justin Wong.jpg Dancer sketchstranger.jpg",
    "section": "Gallery",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*\"Today my Sovereign is the Lionheart, and tomorrow she will have my votes. We will rescue the Free Legions.\" - Dark Age, Chapter 29 *''\"It is my duty as a free man to read so I'm not blind, being led around by my nose.\" - Iron Gold, Chapter 2 *\"A nation cannot be destroyed from without till it is destroyed from within.\" - Red Rising, Chapter 10 * \"In the densest places of man, humanity most easily breaks down\" - Red Rising, Ch. 10: The Carver *\"We want you to make our boy here into a Gold.\" - Red Rising, Ch. 10: The Carver *\"So don't be spitting anger and hate. You're not fighting against them, no matter what Harmony says. You're fighting for Eo's dream, for your family that is still alive, your people.\" - ''Red Rising, Ch. 13 Bad Things",
    "section": "Quotes",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*Chapter 8 of Red Rising incorrectly claims Dancer is of the mine Tyros, while in Chapter 13 he is incorrectly said to be of Oikos. *The Dramatic Personae in Dark Age incorrectly lists Dancer as the husband of Darrow's mother, Deanna. es:Dancer hu:Táncos Category:Reds Category:Characters Category:Males Category:Red Rising Characters Category:Morning Star Characters Category:Golden Son Characters Category:Iron Gold Characters Category:Sons of Ares Category:Dark Age Characters Category:Deceased",
    "section": "Trivia",
    "name": "Dancer",
    "type": "characters",
    "series": "Red Rising"
  }
]