[
  {
    "text": "Dio of Lykos is a lowRed from the Martian mining colony of Lykos. She is the younger sister of Eo, the wife of Loran, and later the second wife of Kieran, making her the sister-in-law of Darrow O'Lykos.",
    "section": "General",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Based on Darrow's account, she is stunningly beautiful and almost the exact lookalike of Eo.",
    "section": "Appearance",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dio is married to Loran. When Eo is condemned to death for singing the Reaping Song, Dio is chosen to hear her final words. Eo tells her sister that she is pregnant, asking her to remove the cot inside Darrow's home for fear of him finding out. When she returns to stand with the Lambda lowReds, she lies to Darrow, telling him that Eo's last words were that she loved him.",
    "section": "Red Rising",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Deanna informs Darrow that Dio's husband Loran, and Narol O'Lykos are presumed dead in a mine collapse, widowing Dio. Kieran and Dio marry sometime after. When Darrow next sees Dio, she is pregnant with their first child.",
    "section": "Golden Son",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After Darrow is captured at his Triumph, several Martian mines are raided, including Lykos. Sons of Ares' forces evacuate the mine. Dio escapes with the lowReds to Tinos. When Darrow is reunited with his family after being rescued from Attica, he initially mistakes Dio for Eo when he sees her again.",
    "section": "Morning Star",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*Dio means God in Italian.",
    "section": "Trivia",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Dio hu:Lykosi Dio Category:Red Rising Characters Category:Females Category:Reds Category:Characters Category:Morning Star Characters Category:Golden Son Characters Category:Iron Gold Characters",
    "section": "References",
    "name": "Dio",
    "type": "characters",
    "series": "Red Rising"
  }
]