[
  {
    "text": "Eo was a Red of Mars from the mining town of Lykos. She was the wife of Darrow, and sister of Dio.",
    "section": "General",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Eo was described as having thick hair the color of rust by Darrow and a round face. She had a slender build that was implied to be because of hunger.",
    "section": "Appearance",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "She was idealistic and inspiring to most. For most of the books we see her through Darrow's rose colored lenses and she is portrayed as a one dimensional, perfectly pure, do no wrong girl with an amazing capacity for kindness. Later on, we see Darrow realizing that this wasn't Eo's reality. Eo was so much more than that. She was a young girl who could be spiteful and petty despite her kindness.",
    "section": "Personality",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Eo appears in the epilogue of Sons of Ares, Volume III picking haemanthus blossoms in the tunnels of Lykos before the December 725 laureltide with a group of girls from Lambda clan. After pricking her finger on one of the stems, Eo notices graffiti of Ares' spiked helmet painted on the wall, hidden away by vines. Eo reaches out to touch the painting before the other girls tell her that it's time for them to go if they want to make it in time. Eo gives the graffiti one last glance as she runs back toward her friends.",
    "section": "Sons of Ares",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After turning fourteen, Eo took shorter rations in order to put off getting married as was the custom for lowRed girls, and continued to do so until Darrow turned sixteen in 736 PCE and became eligible to marry.",
    "section": "Pre-Saga",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At some point within the first six months of their marriage, Eo becomes pregnant with her and Darrow's child, and keeps it a secret from everyone in order to surprise him. Six months after their wedding, Eo treated Darrow's injury after he returned from work, and accompanied him to the laureltide feast with the rest of their families and clan. When given the opportunity to say her last words, Eo secretly told Dio of her pregnancy and pleaded her not to tell Darrow. Following her death, The Society's broadcast of the execution was censored, however Sons of Ares hackers hijacked the broadcast and played the true footage over every HC on Mars, while anarchist hacker groups spread it across the holoNet, where it was shared over a billion times over the next several years. Since her name was unknown to those outside of Lykos, the general public called her Persephone, after the Greek goddess of spring. Unwilling to continue living without her, Darrow buried Eo in the bubbleGarden, an illegal act which resulted in his own hanging. However, his death is faked by his uncle Narol in order to get him to the Sons of Ares, who recruit him to infiltrate The Institute. Darrow's grief over the loss of Eo serves as his main drive for the next several years as he infiltrates the Gold ruling class and works to bring down The Society.",
    "section": "Red Rising",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The Sons of Ares' viral propaganda video of Eo's death continued to spread between 738 and 741 PCE, with her hanging being immortalized in graffiti and other media across the solar system. When Darrow confronted Harmony on Luna over her bombing of a tavern in Lost City, she showed him the recording of Eo's final words to Dio that revealed her secret pregnancy, in order to manipulate Darrow into carrying out a suicide bombing at the closing gala of the Golds' decennial Summit.",
    "section": "Golden Son",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The footage of Eo's hanging was used as the starting point of Darrow's speech in The Hollows that kicked off The Battle of Phobos.",
    "section": "Morning Star",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The two were deeply in love with each other even from the time that they were childhood friends. They lived as neighbors in the mines. When Eo became of age to wed at 14, she waited for Darrow to age to 16 declining every man seeking her hand. Darrow continues to love Eo long after her death, though also comes to accept that she was not perfect and that he needs to move on. At the end of Morning Star, Darrow vows to one day tell his son about Eo's dream, and how it inspired him to live for more.",
    "section": "Darrow",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dio is Eo's younger sister whom she loved very much. At her hanging, she calls Dio over and exchanges her last words to her.",
    "section": "Dio",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow's mother. In Golden Son she reveals that she didn't much like Eo, due what Deanna thought to be manipulative tendencies.",
    "section": "Deanna",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Eo Kendall Jenner.jpg Eo Hang.jpg File:Eo.png|Portrait of Eo Eo made.by.jenna.PNG Eo-by-kendra.jpg Eo-gorydamn-reaper.png Eo-050616.jpg Eo-dead-red-by-igor-kieryluk.jpg Eo-niru723.jpg",
    "section": "Gallery",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*\"Live for more.\" - Red Rising, Ch. 6: The Martyr *\"Break the chains!\" *\"Emptiness is life without freedom. Emptiness is living chained by fear, fear of loss, of death.\"",
    "section": "Quotes",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*Pierce Brown confirmed that Eo was named after Eos, the Titan goddess of the dawn in Greek Mythology. *Pierce Brown has stated that if Eo were alive during the events of Iron Gold, she would have sided with Dancer and the Vox Populi.",
    "section": "Trivia",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Eo hu:Lykosi Eo Category:Females Category:Reds Category:Characters Category:Red Rising Characters Category:Deceased",
    "section": "References",
    "name": "Eo",
    "type": "characters",
    "series": "Red Rising"
  }
]