[
  {
    "text": "''\"We're not your enemies, Darrow. You have to know that.\" - Evey, Golden Son''Evey is a Pink dancer at Mickey's club in the Yorkton Bazaar on Mars. She serves as Darrow's nurse while he recovers from the carving to transform him into a Gold.",
    "section": "General",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Evey was considered by Darrow to be naive at times, but well-intentioned and sad. In Golden Son, she has greatly changed, now a passionate fighter for Harmony's Sons of Ares and abusive towards her former master Mickey. Darrow saw her as inconsiderate during this time. In Morning Star it is revealed that Evey regrets her past actions and hopes to make it up through honest and brave service for The Rising.",
    "section": "Personality",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Exceedingly beautiful, she looked no older than Eo. She has emerald eyes and Mickey grafted white eagle wings onto her back.",
    "section": "Appearance",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Like all Pinks, Evey grew up with the Cupid's Kiss, a device that causes constant pain except for when engaged in sexual activities with a master. She ended up being bought by Mickey, where he carved a pair of functionless wings onto her shoulder blades, and made her to dance in his nightclub.",
    "section": "Pre-Saga",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow first sees Evey when he is brought to Mickey and carved. She helps him through the process, bathing him and supporting him as he walks around the room to regain his strength. Once the carving is complete and Darrow leaves Mickey, he arranges for her to be freed, saving her from a life of slavery.",
    "section": "Red Rising",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After having no contact with the Sons of Ares for years, Darrow spies a wingless Evey in a lowColor bar while he is making a deal with The Jackal. The Jackal notices Darrow looking at her, and offers her up to him. Pretending to accept, Darrow joins her in an upstairs room, in which he finds several armed Red terrorists, there for the purpose of killing The Jackal by blowing up the establishment. Darrow rushes to save The Jackal from the explosion, but some two hundred lowColors are killed. Evey is overjoyed to be reunited with Darrow, showing much gratitude for how he freed her from Mickey, but Darrow is disgusted by her wanton slaughter of lowColors in the attack.",
    "section": "Golden Son",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Eager to repair the damage she caused under the directions of Harmony's radical Sons of Ares faction, she teams up with the real Sons of Ares as a spy, under the direction of Theodora.",
    "section": "Morning Star",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Evey hu:Evey Category:Pinks Category:Characters Category:Females Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters",
    "section": "Gallery",
    "name": "Evey",
    "type": "characters",
    "series": "Red Rising"
  }
]