[
  {
    "text": "Fitchner au Barca was a Gold on Mars, Sevro's father and a Peerless Scarred. He was the Proctor of House Mars at The Institute during Darrow's schooling, and was later appointed by The Sovereign as the Rage Knight, one of the Olympic Knights. In addition, he served as the underground leader of The Sons of Ares and liaison between the high- and lowColor factions. He was murdered and decapitated by Cassius au Bellona shortly before Darrow's Triumph at the end of Golden Son.",
    "section": "General",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Fitchner is gruff and coarse, possessing quick wit, a filthy mouth, and a crude sense of humour that contrasts strongly with his Gold peers. While he seems to be a lazy vagrant to most, Fitchner possesses a shrewd, cunning mind and was considered by many to be a master strategist and a visionary. He masterminds the Sons of Ares and successfully infiltrates the Society and aids Darrow in his own ascension. Additionally, he considers himself to be brilliant at math and calculations. Despite appearing to be crude and craven, Fitchner is brave and is capable of loving people very deeply. Despite his rage towards the Society, he never relished the prospect of killing innocents. For all his brilliance and talent, Fitchner was not overly vain, preferring to keep himself as he was, and never resorting to beautifying himself like most other Golds.",
    "section": "Personality",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Possessing flaxen brown hair, a hatchet face, and a paunch belly, Fitchner was not considered to be very attractive. Other Golds likened him to a Bronze due to his hair colour and common, shabby appearance.",
    "section": "Appearance",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "As a baby, Fitchner was considered an aberration of Golds, by the Board of Quality Control, and was left to undergo The Exposure due to his small size. After managing to survive the elements for three days, the Board permitted his parents to take him home. Growing up, he was bullied incessantly and struggled to belong, but he was able to survive, making his first kill at The Passage. During his time at The Institute, where he was part of House Mars, he was befriended by the Primus of House Jupiter, Arturius au Vardan. They helped each other and both succeeded as Peerless Scarred. Arturius had said he would take Fitchner, possibly as a lancer, in his House, but the matriarch was adamant against it, threatening disinheritance if Arturius insisted. Arturius relented and Fitchner left to serve under Regulus ag Sun on Triton. Though he felt he had no care for any of the others there, no matter their color, he saved ten people during an earthquake, including a lowRed named Bryn. He and Bryn fell in love and married, despite it being illegal. He was able to bring her and her sister, Ryanna, with him to Mars. On Mars, he worked under Quicksilver, who knew about Fitchner and Bryn's marriage, but kept their secret so that Fitchner could assassinate and eliminate whoever was in the way. Because of Bryn's physical incompatibility to bear a child for Fitchner, he found a Carver willing to do surgery on her. It was then that Sevro was born. Arturius reappeared in Fitchner's life as a Prefect for the Board of Quality Control. Somehow, the secret of Sevro's parentage was discovered and Arturius questioned Bryn who the father was. Fitchner, Ryanna, and a few others attempted to rescue Bryn and Sevro. But, Bryn escaped on her own. Surrounded, with Fitchner a few levels below her, she dropped Sevro down to save him while accepting her fate. Arturius caught up with Fitchner and cut off his hand. As a final, small mercy for his Institute brother, he allowed Fitchner to choose between his wife and his son. Fitchner chose Sevro, leaving Bryn to imprisonment and death.",
    "section": "Sons of Ares: Volume One",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Ten months after Bryn's death, Fitchner visits the Agea Bazaar with Ryanna to purchase intel on the House Vardan estate from The Syndicate.",
    "section": "Sons of Ares: Volume Two - Wrath",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow meets Fitchner as one of the Proctors evaluating the initiates of the institute. He tests Darrow by telling him not to hit back and hitting him. Darrow kicks Fitchner, causing him to laugh. Fitchner insists on choosing Darrow for House Mars, even though Proctor Mercury is desperate to have him. Fitchner is present when Darrow and Julian are put in the same cell in The Passage. He leaves a house ring on the ground, telling the two of them that only one of them can leave the room alive. Fitchner goes on to explain the nature of the institute to his house.",
    "section": "Red Rising",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At some point in 740 PCE, he dueled Proctor Jupiter and Apollonius au Valii-Rath for the post of Rage Knight and won. He confronted House Augustus and their allies as they fled the bloodbath Darrow had initiated at the Summit gala, ordering them to return to their villa while he took Darrow to speak with the Sovereign.",
    "section": "Golden Son",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Fitchner did not appear to have a good relationship with his parents, and did not interact with them following his departure from Mars after The Institute. His father was proud of his paunch and refused metabolizers, which may have inspired Fitchner's usage of them as an adult. Fitchner's mother often told him that her passion was snuffed out after he was born, and believed that he stunted their family tree before it began. Fitchner in turn saw his parents as \"an inquisitive fool and a simpering schemer.\"",
    "section": "Parents",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro au Barca was Fitchner's only son, although their relationship wasn't a close one. The two would repeatedly taunt and insult the other, and argue frequently. Nonetheless, Fitchner was concerned for his son's life in the Institute, and was later greatly relieved when Darrow revealed him to be alive in Golden Son following Nero au Augustus's rebellion. Sevro, in turn, misses his father at times, wishing that he could see him get married.",
    "section": "Sevro au Barca",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "During the Passage, Fitchner would offer Darrow sarcastic advice, as well as reveal certain weaknesses and flaws of his fellow Proctors. In the guise of Ares, however, Fitchner displayed great affection for Darrow, referring to him as \"my son\", and placing great faith in Darrow's ability to overthrow the Society. When Darrow trapped himself aboard Octavia au Lune's shuttle at the tail end of his Iron Rain, Fitchner willingly blew his own cover and betrayed Octavia and the other Knights on board in order to save Darrow.",
    "section": "'''Darrow O'Lykos'''",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Quicksilver-fitchner-dancer-mbenskydesigns 071820.jpg Fitchner-pallasillustration.png Fitchner-by-angela-tubbs.jpg Fitchner mightythepen.jpg Ares phantomrim.jpg Fitchner wheredaydreamersgo.png",
    "section": "Gallery",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"A man can never miss chlamydia\" - Golden Son, Ch. 11: Red * \"it is the hottest fire that forms the sternest steel.\" - Red Rising, Ch. 12: Change * \"Hello, you little shiteaters.\" - Red Rising, Ch. 20: The House Mars * \"Did anyone else hear a squat ugly little Goblin go... well, whatever sound Goblins make?\" - Red Rising, Ch. 21: Our Dominion * ''\"I am your Proctor. Not your mommy. You're in school, remember? So if your legs are open, well, make a chastity belt to protect the softspot.\" - Red Rising, Ch. 21: Our Dominion * \"Good luck, Darrow, but take care of Sevro. The little shit will follow you anywhere, no matter what I say.\" - ''Red Rising, Ch. 39: The Proctor's Bounty",
    "section": "Quotes",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Fitchner dislikes Red booze, but considers Martian variants worse than Tritonian ones.",
    "section": "Trivia",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Fitchner au Barca hu:Fitchner au Barca Category:Characters Category:Males Category:Golds Category:Red Rising Characters Category:Deceased Category:Golden Son Characters Category:Sons of Ares Category:Pre-series characters Category:Olympic Knights",
    "section": "References",
    "name": "Fitchner",
    "type": "characters",
    "series": "Red Rising"
  }
]