[
  {
    "text": "Harmony was a lowRed of Mars, a former member of the Sons of Ares, ex-leader of the Red Legion, and leader of the Red Hand.",
    "section": "General",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "One half of Harmony's face was covered in a large steam burn. Darrow described the other half as more beautiful even than Eo, with soft, milk-pale skin and prominent but delicate features. She had a cold and cruel demeanor. Her bottom teeth were uneven and nails poorly maintained.",
    "section": "Appearance",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Harmony was born on Mars in the early 700s PCE in a helium-3 mine owned by House Julii. She was one of the few women allowed to work in the mines rather than the webbery, where she gained her infamous steam burn on half of her face. She eventually married sometime before 725 PCE, and gave birth to two children. Eventually, her husband and children fell ill due to radiation from a leak in the mine that the mine's owner, Agrippina au Julii, declined to immediately repair for tax purposes. When the Gamma lowReds in the mine hoarded the medicines Agrippina provided, Harmony's husband and children slowly rotted from lung cancer caused by the radiation. Their deaths left Harmony enraged at the Gamma clan for refusing to share medicine, and at the Golds who ruled them for letting the situation happen in the first place, Harmony sought revenge against the Society that wronged her. She eventually joined the Sons of Ares at some point before August 725 PCE, with Ares putting her first gun in her hand by giving her a mark IV scorcher with a full ion clip.",
    "section": "Pre-Saga",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In the early Sons of Ares, Harmony operated under the callsign Harmonia. In August 725, she and the Sons attacked and boarded a corvette of House Augustus carrying an Augustan Logos from a visit to Eagle Rest. They successfully captured the Logos but were forced to flee when the Lion of Mars arrived with Augustan reinforcements. After the Sons took shelter in a neaby underground base, ArchGovernor Nero detonated explosives in the Logo's body, destorying the base and leaving Harmony as one of only seven Sons to survive the mission. After Ryanna of Cryssos began recruiting lowReds from Nagassos in September through Roran and Corthus, Harmony was tasked with overseeing the recruits' efforts to drill a series of hidden tunnels for the Sons to use as both a training ground and as an access point to the Omicron Bastion. Under orders from Ares, Harmony talked to Corthus about the luxuries found on the surface of the planet, and assigned him to carry out acts of sabotage around Nagasos mine. When Corthus and Roran were arrested as suspects, Harmony left to prepare to evacuate the Sons recruits after the subsequent uprising. After the uprising was crushed by the House Augustus Lionguard, Harmony and Ballista met the survivors at the exit of the escape tunnel she dug and helped evacuate the Sons' army to Tinos. When Dancer O'Faran became the leader of the Sons' lowColor division sometime between 729 and 737 PCE, Harmony took up the role of his second in command.",
    "section": "Sons of Ares: Volume 3",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In March 737 PCE, Harmony and Ralph were sent to collect a helldiver named Darrow after his uncle Narol faked his death in Lykos following his attempt to bury his wife Eo. They delivered him to Dancer, where Harmony provoked Darrow with callous remarks about Eo's execution for singing the Reaping Song. She accompanied Darrow and Dancer to Mickey's shop in Yorkton, where she and Dancer convinced the carver to make Darrow into a Gold. During the course of the carving process, she spends much of the first few weeks away from the shop finding donors, and upon her return, exercised Darrow to help him get used to moving with his new proportions. While Darrow was being carved, Harmony found a Red named Arlus in Thebos mine, and pulled him from the mines to be carved into a Gold as a second infiltrator for The Sons of Ares.",
    "section": "Red Rising",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "A year after Darrow's departure for The Institute, Harmony broke away from the Sons of Ares with her own splinter faction when Dancer proved to be too unwilling to meet her desire for violence against Golds. After bugging the villa where several Senators were vacationing on Mars's Gorgon Sea failed to produce any actionable intel, Harmony walked in and killed all of the Senators and their guests before breaking away from the Sons. She and her supporters then raided Mickey's carve shop in Yotkon and took him as their prisoner, using his funds to buy transport to Luna and equip an army to fight back against Gold. Over the course of the Martian Civil War, Harmony eventually made her way back to Mars with Mickey and Evey. Shortly after the Lion's Rain in March 742, Harmony discovered that Ares was a Gold. A few days later, she and her associates were captured by The Jackal. Feeling that Dancer and Darrow had sold out the Rebellion, and betrayed that her hero was another Gold, Harmony informed Adrius of Darrow and Fitchner's true identities, using Darrow's present during her subsequent rescue from Attica to prove her claims.",
    "section": "Golden Son",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Following her rescue from Attica, Harmony was brought back to the main Sons of Ares base. She left shortly after, departing an hour before Adrius's kill squads arrived for Fitcner. Following the annihilation of the Red Lion's stronghold in the port city of Ismenia, Harmony went underground, and stayed off the radar for the remainder of the Rising.",
    "section": "Morning Star",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At some point between 743 and 753 PCE, Harmony founded a new organization known as the Red Hand, likely out of the remnants of the Red Legion, and led the group in a campaign of massacring any Golds and Gamma Reds that they could find.",
    "section": "The Solar War",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In September 753 PCE, Harmony led the Red Hand in an attack on Assimilation Camp 121 on the continent of Cimmeria, and was one of the first to open fire when the residents identifies the Gammas in their midst. As the violence broke out, she personally killed Tiran of Lagalos with her plasma weapon. After the attack was driven back by Republic forces under the command of Kavax au Telemanus, Harmony and her terrorists withdrew.",
    "section": "Iron Gold",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "When the Obsidian Alltribe started relentlessly hunting and executing her Red Hand agents to secure their territory in Cimmeria, Harmony began ordering her men to conscript girls from the fishing village near their base in northern Cimmeria to serve as wives and breed the next generation of Red Hand soldiers. After the fall of the Pandora at the end of January 754, Harmony and the Red Hand spent the next two weeks pursuing Victra au Barca, Volga Fjorgan, and Lyria of Lagalos through the Cimmerian wilderness. When they caught up to their quarry, Harmony unceremoniously killed Victra's newborn son Ulysses as revenge for the role that Victra's mother played in the death of Harmony's own children. With the Gold and Obsidian captured, Harmony returned to the Red Hand's headquarters in a nearby abandoned mine. The following day, Harmony greeted the next cadre of Childwives when Picker presented them to her, and presided over the ensuing forced weddings. She killed at least one of the childwives as she made her way through the mine, and returned to the Can when Lyria pretended to offer the locations of Victra's other daughters. While inspecting one of the dead girls to try and figure out how Lyria got the acid past the Red Hand's security, she realizes that it's in the teeth just as Lyria breaks the lock on Victra's cell. As Victra kills the men with her, Harmony flees from the room. When her escape shuttle is blocked by Victra closing the hangar doors, Harmony sends her men at the girls and takes a group of forty down into the tunnels to link up with her main force. Once the tide turned against her and the Red Hands' capture Obsidians begin to fight back, Harmony abandoned her soldiers and attempted to save herself. As she fled, she gave the Red Hand's torchShip the order to lay into the mine with every weapon it had if she failed to give the proper signal in time. She then attempted to lead Victra into a trap that would drop her into a nest of adult pitvipers clustered around an underground hot spring, but Victra caught up and disarmed her before she could enact her plan. Harmony attempted to bargain her way out of the situation, but Lyria figured out what her endgame was, and sent the flare down into the nest to illuminate the serpents. Harmony",
    "section": "Dark Age",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "was then thrown into the pit, where the pitvipers immediately began burrowing into her body to implant their eggs. Harmony screamed in agony as Victra and Lyria walked away. It's unknown how long it took Harmony to die, but Lyria speculated that since the venom of adult pitvipers only paralyzes their prey, Harmony's death likely took days to die.",
    "section": "Dark Age",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "File:Harmony A.jpg|Harmony monitoring tunnel construction in Sons of Ares, Volume 3: Forbidden Song File:Harmony E.jpg|Harmony wanting to meet Ares in Sons of Ares, Volume 3 File:Harmony B.jpg|Harmony talking to Ryanna in Sons of Ares, Volume 3 Harmony violetfeverdreams.jpg Harmony mightythepen.PNG Harmony-061516.jpg Harmony-violetfeverdreams.jpg Harmony-justin-wong-art.jpg Harmony-tarot-phantomrin.jpg Harmony-gorydamnreaper.jpg",
    "section": "Gallery",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Harmony hu:Harmónia Category:Females Category:Characters Category:Reds Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Deceased Category:Dark Age Characters",
    "section": "References",
    "name": "Harmony",
    "type": "characters",
    "series": "Red Rising"
  }
]