[
  {
    "text": "Julian au Bellona was a Martian Gold of the house Bellona and twin brother of Cassius. He died at the hands of Darrow during The Passage at The Institute.",
    "section": "General",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julian was physically smaller in stature than his twin, and just as much if more handsome. He was described as a \"slender boy with an open gaze and pretty smile.\"",
    "section": "Appearance",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julian was said to be the kindest among the Bellona. He cared little about appearances and always had a smile on his face. He was gentle and very emotionally sensitive.",
    "section": "Personality",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julian and his twin Cassius were the youngest children of Tiberius au Bellona and Julia au Bellona. Like his brothers, he was trained by his father in the Silent Art of Kravat. He was a prodigy at it, even though he insisted that Cassius was a better fighter than him. As a child he used to pee in bed and tried to hide the sheets by taking them to the laundress himself.",
    "section": "Pre-Saga",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julian was very excited at receiving his letter of admission to The Institute. None of his brothers were okay with it; they didn't think Julian was the type of person for the Institute. At the Institute, he was the first student with whom Darrow had a conversation. It was Julian who introduced Darrow to his twin brother, Cassius, for whom Julian had only brotherly affection and not a hint of jealousy. Later in the dining room, we learn that he belonged to the midDrafts, and was content with it. Julian had been selected into House Mars, and when the time for The Passage arrived, he was faced against Darrow. During their Passage, Julian was somewhat insistent that Darrow ought to simply allow himself to be killed. When the fight started, he tried to hit Darrow in the frivolous and complex Kravat form that he excelled at. However, in addition to being hesitant, he was slower and weaker than Darrow, who responded with a direct hit to Julian's nose. Even as Darrow watched the light leave his friend's eyes, he saw only confusion and shock at the circumstances under which a social inferior would have the audacity to take the life of a son of Bellona.",
    "section": "Red Rising",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tiberius was the father of Julian and Imperator of The Society. Just as he did with his other children, he personally taught Julian the art of Kravat.",
    "section": "Tiberius au Bellona",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julia was Julian's mother. He was her favorite son; and once knowledge of his death reached her, she refused to eat a single thing until Julian's death was avenged. Every day she repeated the same words to her family: ''\"It is clear that I am unloved. If I were loved. there would be a heart here to sate my hunger for vengeance. If I were loved, my boy's murderer would no longer draw breath. If I were loved, my family would honor their brother. But I am not. He is not. They do not. What have I done to deserve such a hateful family?\"''",
    "section": "Julia au Bellona",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Karnus was Julian's older brother, and did not regret his death, thinking him to be genetic waste. Despite saying that he deserved neither the Bellona name nor his mother's favor, he was determined to avenge Julian, if only to bring honor back to House Bellona.",
    "section": "Karnus au Bellona",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius was Julian's twin and favorite brother. Julian looked up to Cassius and was always seeking his approval. When Julian died, Cassius was totally devastated.",
    "section": "Cassius au Bellona",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julian was the first student that Darrow had a conversation with. They got along well and Darrow considered him the first Gold he couldn't call a monster. Darrow was who Julian had to face in The Passage, and died at his hand.",
    "section": "Darrow O'Lykos",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro and Julian, in the short time they were together, did not establish a friendly relationship. The first time they met, Sevro insulted his mother, so Julian responded by challenging him to a duel. Sevro accepted to do it after the Passage, which never came to pass.",
    "section": "Sevro au Barca",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Cassius and julian pallas.jpg Darrow julian ride wheredaydreamersgo.PNG Julian passage wheredaydreamersgo.PNG Julian jemstone.jpg Julian callmeleah.jpg",
    "section": "Gallery",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Julian au Belona hu:Julian au Bellona Category:Males Category:Golds Category:Characters Category:Deceased Category:Red Rising Characters",
    "section": "References",
    "name": "Julian",
    "type": "characters",
    "series": "Red Rising"
  }
]