[
  {
    "text": "Karnus au Bellona is a Gold of the Martian House Bellona and the eldest son of Tiberius and Julia.",
    "section": "General",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Karnus is forceful, sadistic, and adheres to the Gold social culture that holds strength, achievement, and martial prowess above all else. He looked down on his siblings, especially Julian, whom he found unworthy of the family name and of their mother's love. When Cassius brought a bird he had wounded with a slingshot to him, he dropped a rock on it.",
    "section": "Personality",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Mentioned to resemble an Obsidian in all but colour. He towers over typical Golds, with shoulders twice as broad as Darrow's.",
    "section": "Appearance",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Extremely strong, breaking the back of a Luneborn over his knee.fellow Bellona re Additionally, he is a skilled commander of troops, even besting Darrow in battle, a feat few can claim.",
    "section": "Abilities",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Karnus is present at Eagle Rest when his parents' mines are visited by a Logos of House Augustus on August 8th, 725 PCE to inform them of an increase in helium-3 production quotas. When his parents protest the ArchGovernor's demands, Karnus inserts himself into the conversation. The Logos retells the story of Nero's rise to power and his subsequent murder of Karnus's aunt Iona. Karnus attempts to strike at the Logos, but is held back by his mother. When the Augustus lancers accompanying the Logos remind Karnus of the fate of House Cylus, Karnus declares that he will find each of the lancers after his graduation from the Institute in two years and make them tell him the story again, and that he will bring grapes.",
    "section": "Sons of Ares",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Karnus attended the Institute in 727 PCE alongside Daxo au Telemanus and became the Primus of House Jupiter. At some point before leaving to enroll in The Academy, Karnus was a longtime drinking companion of Tharsus and Apollonius au Valii-Rath. Cassius often attempted to tag along on their visits to various Pearl Clubs, but never paid for anything himself. As a result, Karnus confided in Apollonius that he despised Cassius' freeloading.",
    "section": "Pre-Saga",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Julia au Bellona prompted him to enter the Academy to butt heads with Darrow as revenge for Julian's death. After achieving victory with the aid of additional ships provided by Octavia au Lune, he roughs up Darrow in a garden at the Academy's central hub with seven fellow Bellona relatives. He acts as his mother's primary agent of revenge against Darrow, despite having little affection for Julian. He later battles Darrow aboard the Sovereign's ship during the Lion's Rain, where he is able to wound him, but is stabbed through the chest and decapitated by Darrow immediately after.",
    "section": "Golden Son",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Karnus-by-mightythepen-082320.jpg File:KarnusAuBellona.jpg|Karnus au Bellona",
    "section": "Gallery",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*'''No one wrongs the Bellona and lives.' - Golden Son, Ch. 11: Red *'I will die. You will die. We will all die and the universe will carry on without care. All that we have is that shout into the wind—how we live. How we go. And how we stand before we fall.' - Golden Son, Ch. 11: Red *'Rise so high, in mud you lie''' - Golden Son, Ch. 03: Blood and Piss",
    "section": "Quotes",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Karnus au Belona hu:Karnus au Bellona Category:Characters Category:Golds Category:Males Category:Red Rising Characters Category:Golden Son Characters Category:Deceased",
    "section": "References",
    "name": "Karnus",
    "type": "characters",
    "series": "Red Rising"
  }
]