[
  {
    "text": "Lilath is a Gold of House Faran. She was a member of House Pluto during the 542nd Class of The Institute of Mars, quickly becoming the favored underling of her house's Primus, The Jackal. After graduating, she became a lancer of House Falthe and aligned with House Bellona and the Sovereign against House Augustus.",
    "section": "General",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lilath is a cold and callous individual. She was shown to be rather emotionless when speaking with Darrow. She finds acts of cruelty and violence to be quite humorous, laughing when she slaughtered House Thorne and helped Adrius betray his family.",
    "section": "Personality",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lilath has moonfaced cheeks that became scarred and pock-marked from her time in the Institute. She dyed her golden hair dark black and wove bones into her braids. She lost several fingers whilst in the Institute; it is unknown if she had them replaced afterwards.",
    "section": "Appearance",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Red Rising=Lilath first appeared when she came to deliver the HoloCam of Darrow killing Julian to his brother Cassius. She is later seen leading a scouting patrol around the Greatwoods. Towards the end of the Institute, she assists a wounded Adrius by delivering him a thermal cloak and MedBot. She is then hiding in the mountains with him when Mustang arrives with her army. |-|Golden Son=She, along with two other members of House Falthe, systematically slaughtered House Thorne during the chaos caused by Darrow at the Summit. Later, she helped Adrius in attacking the Triumph. She attempted to slit the throat of Lorn au Arcos with a pulseDagger, only managing to cut four fingers off before Adrius finished him off. |-|Morning Star=She aided the Jackal in his attack on Luna by detonating nuclear warheads across Hyperion City from a ship in orbit, helping him in his plans to blackmail Octavia au Lune. Her ship was destroyed by the Ash Lord's fleet to stop the Jackal's plan, leading to her apparent death when her ship crashed into the Hysperia Gardens. |-|The Solar War=TBD |-|Iron Gold=TBD |-|Dark Age=Lilath had survived the events of Morning Star, and eventually made her way to Earth. There, following a set of contingency orders given to her by the Jackal prior to his death, she enlisted the aid of Zanzibar, Octavia au Lune's master Carver, to create a clone of The Jackal, to whom she gave birth. Following the birth of the clone, she ascended to become the new Queen of The Syndicate.",
    "section": "Involvement",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lilath's entry to the Institute was sponsored by House Falthe as a gens client, and took the name of Falthe. Due to her failure at the Institute, she was abandoned, leaving her to use her original name of Faran. In an attempt to gain back their good graces, she slaughtered House Thorne during the Gala Massacre, but soon after joined Adrius in totality.",
    "section": "House Falthe",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lilath worships Adrius, going beyond love in her devotion to him, and has killed numerous people to aid him in his goals. She is his most loyal Bonerider and carried out his plans without hesitation, even giving birth to his clone as part of his contingency plan against his death. The Jackal, however, did not reciprocate this love and actually resented Lilath to a degree, though it is not clear if this is just part of his general disdain for the Boneriders or a special dislike of Lilath in particular.",
    "section": "Adrius au Augustus",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The clone of Adrius au Augustus also views her with distaste, seeing her to be a fool and growing angry when he finds out that she hid some of the recordings the Jackal left him. The clone also knows of her Jocasta complex but appears unconcerned with it, instead allowing Lilath her fantasies until she runs out of usefulness. The relationship between the two is extremely dysfunctional, due to the one-sided nature of Lilath's love for Adrius and her desperation to be the only thing he needs. It is implied that the Abomination seeks to one day dispose of Lilath but holds back because she is still useful, displaying his lack of care for her.",
    "section": "The Abomination",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lilath mightythepen.PNG| File:JPG Lilath final1.jpg Lilath-au-faran-red-velvet.jpg Lilath-by-pallasillustration.jpg Lilath Teeth.jpg Lilath-by-paxaureaper.jpg Lilath stephaniecolomboart.PNG|alt= File:JPG Lilath final1.jpg Lilath mbenskydesigns.PNG",
    "section": "Gallery",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* TBD",
    "section": "Trivia",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Lilath hu:Lilath au Faran Category:Golds Category:Females Category:Characters Category:Morning Star Characters Category:Golden Son Characters Category:Red Rising Characters Category:Dark Age Characters",
    "section": "References",
    "name": "Lilath",
    "type": "characters",
    "series": "Red Rising"
  }
]