[
  {
    "text": "Lorn au Arcos is a Gold of the Martian family Arcos and probably the most notorious warrior in The Society. During his more than 100 years of life, he experienced many battles and was awarded by the previous Sovereign the title of Rage Knight. His skills are unmatched and even with his old age, he is still feared as the most dangerous fighter in the system. After seeing all his sons die in a variety of battles, he retired with his personal fleet to the remote moon of Europa with the rest of his house.",
    "section": "General",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lorn appeared as a grizzled man with grey hair and a beard. He was not exceptionally tall for a Gold (being shorter than Darrow) but was broad and tough-looking. He was known for his thick hands marred with scars and wrinkles on which he wore the signet ring of an Olympic Knight.",
    "section": "Appearance",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Though he was seen to be more liberal than other Golds, Darrow still thinks he is stalwart and subject to the thinking of olden times. This is demonstrated in his behavior towards Tactus, emulating typical Gold brutality by killing him after he had surrendered. However, he began to express regret, showing that he is capable of changing. He was also wise and judicious, removing himself from Gold society as he correctly saw its decay into decadence and bloodshed. Lorn is also something of a philosopher. He is quoted multiple times by Golds and applied his philosophy to the Willow Way, turning himself and his students into monstrous warriors. His persona is emulated by Darrow (his final student) who is saddened that he could not be more like his teacher. Nevertheless, his effect on Darrow is so profound that his student remembers his teachings even after his demise.",
    "section": "Personality",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was a highly renowned fighter and tactician, using his own fighting style known as the Willow Way. Showcasing Lorn's ability to observe his enemies, it uses principles taken from his years of combat for maximum effectiveness. Utilizing aggressive tactics different from typical Gold fighting styles, it has the practitioner rapidly attack limbs and move in a circle to confuse opponents. It is so revered among warriors in the Society that many would pay exorbitant fees for a single lesson. Adrius au Augustus, with his immense wealth, is even unsure if he can afford lessons for Darrow under Lorn. He is also an excellent teacher, having trained deadly warriors such as Aja and Darrow.",
    "section": "Abilities",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Born to House Arcos, Lorn's family had some martial background as he described his father as a tough man who lived in an era where eight Iron Rains fell. Lorn made for himself through his martial prowess, eventually ascending to the post of Rage Knight. He also gained the nickname of \"Stoneside\" due to one occasion where he ate a rock on a bet with a Gray. As time passed, Lorn eventually had a large family where many of his sons were claimed by war and eventually left the position of Rage Knight to retire to Europa with his remaining kin. Despite this, he is still referred to as the Rage Knight and has garnered fame as a warrior-philosopher as he is quoted by many Golds.",
    "section": "Background",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lorn was born in 641 PCE to Nefeli au Arcos and Spiridon au Lepidus. His father raised him away from luxury and modernity. At some point between 671 and 676, Lorn applied for the position of Rage Knight, and was ultimately appointed to the position by Sovereign Ovidius au Lune. In 696, Lorn attended Nero's wedding to Iona au Bellona as a representative of the Sovereign. After the ceremony, he and one of his fellow Olympic Knights were ordered to massacre House Cylus and install Nero as the new ArchGovernor of Mars. When the Rim attempted to declare independence from The Core after Ovidius was usurped by his daughter Octavia in 701, Lorn fought in the First Moon Lord Rebellion to enforce Octavia's rule. During the campaign, he earned a reputation for eating anything, and one day a Gray bet him that he couldn't eat stones. Lorn refused to back down from a challenge, earning him the nickname \"Stoneside.\" In 711 PCE, Lorn took Aja au Grimmus as a student in the Willow Way. Several years before 738 PCE, Lorn bought back the Arcos estate in Neo Positano after engaging in a bidding war against a collective of disreputable Silvers.",
    "section": "Pre-Saga",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In early 738 PCE, Lorn began the process of retiring from his position as the Rage Knight. In March of that year, Lorn served as one of the Drafters of House Mars for the 542nd Class of the Institute of Mars. During the first round of the Draft, he saw himself in Darrow au Andromedus and successfully campaigned to draft him into House Mars as their firstDraft. Over the course of The Institute's war game, he recognized that Darrow was carrying a weight even if he couldn't understand, and appreciated the honor Darrow showed to his friends and enemies, both of which endeared Darrow to Lorn. At the conclusion of the school year, Lorn traveled to Olympus with the rest of the Drafters, students' families, and other important officials to congratulate the newly graduated Peerless and collected their respective family members. Lorn planned to offer Darrow a position in House Arcos, but his offer was declined in favor of a lancer position under Nero.",
    "section": "Red Rising",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In January 739 PCE, Lorn was in the midst of renovating the garden of his estate in Neo Positano when he was visited by Darrow, seeking to be trained in the Willow Way. Lorn was reluctant to teach him due to Darrow's decision to serve Nero reminding Lorn of his own worst traits, and tested Darrow by having him help with digging in the garden of Talon's Aerie to see if he would feel any differently over the course of the day. Lorn shared his misgivings with Darrow over lunch, and Darrow chose to continue working in an effort to prove himself. The next day, Lorn traveled to Elysium for a business meeting. He returned the following evening to find that Darrow had completed the improvements to the garden. After discussing why Darrow sought him out to be his teacher, Lorn finally agreed to train Darrow in the Willow Way.",
    "section": "The Book of Lorn",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Shortly before Darrow left for the Academy in November 740 PCE, Lorn officially retired from his position as Rage Knight and moved his family to their estates on Europa. Before his departure, he invited Darrow to withdraw from his position as Nero's lancer and come with him to finish his training. Once Aja and the surviving Praetorians were driven off, Lorn and Darrow raced to the bunker to stop Tactus from killing the children. After Darrow talked Tactus down and the children were able to evacuate, Lorn killed Tactus in retaliation for the threat to his loved ones. With his family having been threatened by Octavia, Lorn evacuated his household from Europa and added his ships to Darrow's fleet. When Virginia au Augustus arrived with news of Pliny au Velocitor's betrayal, Lorn offered to let her rest before continuing discussions of the war effort, and offered his insight and opinions during Darrow's war council, expressing suspicion of Victra because of her mother's alignment with House Bellona. Lorn accompanied Darrow, Virginia, and the Howlers when they took back the Augustus fleet from Pliny, and used his reputation to carve Darrow a path to Pliny by threatening to kill everyone in the room if any of Pliny's allies got within two meters of him. In the following weeks, Lorn reached out to many of his old friends and discovered that all of them have sided with Bellona. When they asked about Darrow, Lorn told them stories that were only slightly exaggerated. By the time they arrived in orbit over Mars, Lorn came to regret killing Tactus, recognizing the way that those who follow Darrow would do anything for him because he believed in them. During the Lion's Rain, Lorn led troops to attack Agea from the south while Darrow and the Howlers infiltrated the city from the north. Following the invasion of Mars, Lorn took Victra under his wing with the approval of her mother Agrippina. Lorn attended the Triumph held to honor the Augustan victory in the Lion's Rain. He was originally scheduled to present the ceremonial Triumph Mask to Darrow, but in his eagerness to leave and seek peace, he allowed Roque au Fabii to present the mask instead. While the celebrations proceed, he listened frrom afar with his grandchildren, offering an only slightly mocking call of \"Hail, Reaper!\" at the conclusion of Nero's speech as the other Golds in",
    "section": "Golden Son",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "the garden raise their glasses in a toast to Darrow. When Darrow was poisoned and the Triumph Massacre began, Nero called Lorn to arms, and Lorn shouted for the Howlers to protect Darrow as he pushed back his grandchildren. Before Lorn could stand, he was attacked by Lilath au Faran disguised as a Pink waitress. Lorn lost four fingers in the process and struggled against her, grabbing a shard of broken glass from the ground. As he reached to stab Lilath's leg with it, Adrius au Augustus stabbed him in the gut. As Lorn breathed his last, he looked to Darrow and his grandchildren and tried to make one final stand. As he passed, Adrius retrieved his blade, and Lilath sawed off Lorn's head.",
    "section": "Golden Son",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "During Darrow's time in the Institute, Lorn sends Dancer's knifeRing to Darrow as a bounty. The two would grow to become friends, and Lorn would become Darrow's mentor after the Institute.",
    "section": "'''Darrow O'Lykos'''",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Aja au Grimmus: Aja was Lorn's last student before Darrow, and he came to see her as a daughter. They had a falling out some years before 738 PCE for reasons that neither would explain to others, but which Lorn referred to as \"a matter of dishonor,\" and which his servants indicate hurt him deeply.",
    "section": "Enemies",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lorn-mbenskydesigns-073120.jpg Lorn-by-phantom-rin.jpg Lorn-by-angela-tubbs.jpg Kaitexas lorn.PNG Lorn mightythepen.jpg Lorn atubbs74.PNG File:Lorn.png ==Quotes== *'''If you're a fox, play the hare. If you're a hare, play the fox.' - Golden Son, Part II: Break *'When falls the Iron Rain, be brave. Be brave.' - Golden Son, Part III: Conquer *'I want to fade in peace.' - Golden Son, Ch. 28: The Stormsons *'Wise men read books about history, strong men write them.' - Golden Son, Part III: Conquer *'A boy throws stones. A fool steals kisses. A man gives his heart.' *'Never fight a river, and never fight Aja.' -Morning Star *'A man believes he can fly, but is afraid to jump. A poor friend pushes him off the ledge. A good friend jumps with. - Morning Star *A man is never too young to kill, never too wise, never too strong, but he can damn well be too rich.'''[ GS, Pt I Ch 6 ] misattributed to Nero au Augustus *'''A fool pulls the leaves. A brute chops the trunk. A sage digs the roots. *The bill comes at the end.''' - Morning Star *\"If you must only wound the man, you better kill his pride.\" - quoted by Karnus in Golden Son, Ch. 3: Blood and Piss *''\"In a young man's game, always bet on the oldest fucker you see.\"'' - quoted by Fitchner in the Sons of Ares, Volume 1 audio drama",
    "section": "Gallery",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "*Lorn is part of the word forlorn, lovelorn, etc. and as such indicates being lonely and deserted",
    "section": "Trivia",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Lorn au Arcos hu:Lorn au Arcos Category:Characters Category:Golds Category:Red Rising Characters Category:Golden Son Characters Category:Deceased Category:Males Category:Olympic Knights Category:Book of Lorn characters",
    "section": "References",
    "name": "Lorn",
    "type": "characters",
    "series": "Red Rising"
  }
]