[
  {
    "text": "Kieran is a lowRed of Mars from the mining colony of Lykos. He is the older brother of Darrow and firstborn child of Dale and Deanna.",
    "section": "General",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Kieran considered more sensitive than his younger brother, and is said to have \"bawled like a little girl\" when their father died. As part of Darrow's mining crew, he's also very cautious, unlike Darrow.",
    "section": "Personality",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In 717 PCE, Kieran is born to Dale and Deanna in the mining colony of Lykos, on Mars. 9 years later in 726 PCE, Dale is executed for performing the Reaping Dance in protest for more food rations. Later, Kieran fell ill with Deanna unable to afford the medicine. Darrow ended up trading a watch given to him by their father for the medicine, and Kieran made a full recovery. In 733, Kieran joins the Lambda clan Drillteam and marries Kora, who gives birth to twins, one of them being Rhonna.",
    "section": "717-736 PCE",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "During this time, Kora dies in childbirth, leaving Kieran as a widower. In 740 PCE, Kieran becomes the Lambda headTalk after Narol and Loran fake their deaths and leave Lykos. A few years after Kora's death, Kieran marries Dio. Sometime before March 742, Kieran gets Dio pregnant with their first child together. After Darrow' Triumph, Sevro au Barca and the Howlers infiltrate Lykos and take Kieran and his family to Tinos to keep Darrow's family from being captured by The Society. In Tinos, Kieran learns under Sons of Ares Oranges to become an Engineer, while Dio gives birth to their daughter.",
    "section": "737-743 PCE",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Kieran spent much of the Solar War working for Darrow, alongside his eldest daughter from his first marriage, Rhonna O'Lykos. In 748 PCE, he becomes the head of the Howlers' engineering department.",
    "section": "743-753 PCE",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Kieran travels to Mars on the orders of Virginia to help Niobe au Telemanus negotiate a treaty between the Republic and the Obsidian AllTribe. Following the Day of Red Doves, he becomes ArchGovernor of Mars after the Vox Populi assassinate Rollo O'Sicyon.",
    "section": "Dark Age",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Kora is Kieran's first wife, who died sometime between Red Rising and Golden Son. * Dio, Eo's sister, is his second wife. They married sometime between Red Rising and Golden Son, as Deanna tells this to Darrow when he returns to see her near the end of Golden Son.",
    "section": "Significant Others",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Darrow is Kieran's younger brother by three years. There never seemed to be any animosity between the two, and he was working as the head of the Howler's engineering department in Iron Gold.",
    "section": "Blood Relatives",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Kieran had two daughters and at least one son with his first wife Kora. His first son and daughter are twins, who are both 3 years old at the beginning of Red Rising and 9 years old at the beginning of Morning Star. Their second daughter was 3 or 4 years old at the end of Golden Son. but it is unclear whether that number includes the baby, as there were a total of seven children present when Darrow reunited with his family, and their sister Leanna is only known to have two daughters. ** Rhonna, introduced in Iron Gold, is stated to be his eldest daughter at 20 years-old, and is part of Darrow's army, along with her father. He shows great concern for her, asking that Darrow keep her from any actual danger, despite Rhonna wishing to prove herself capable as a lancer and of equal importance as Alexandar au Arcos.",
    "section": "Children",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* In a signing, Pierce had confessed he forgot Kieran and Dio had children. * There is some confusion over the names of Kieran’s children. In early editions of Red Rising, the twins are named Reagan and Iro. In Golden Son, Kieran’s youngest daughter with Kora mentions an older brother named Dunlow. In the Iron Gold tetralogy, Rhonna is consistently established as Kieran’s oldest daughter, and later editions of Red Rising omit the names of Kieran’s twins - though Reagan and Iro's names are still included in Morning Star. Since Iron Gold indicates that Rhonna was one of the twins, it is possible that Pierce simply forgot the names of the twins when writing Iron Gold. In Morning Star, Darrow says that Kieran has four children, but there are seven present at their family’s quarters in Tinos near the beginning of the novel, two of which are presumably Leanna’s. As a result, it is unclear whether Dunlow and Rhonna are separate characters from Reagan and Iro.",
    "section": "Trivia",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Kieran hu:Lykosi Kieran Category:Red Rising Characters Category:Reds Category:Characters Category:Morning Star Characters Category:Iron Gold Characters Category:Males Category:Dark Age Characters",
    "section": "References",
    "name": "Lyria",
    "type": "characters",
    "series": "Red Rising"
  }
]