[
  {
    "text": "Matteo, a Pink, is one of the people who helped with Darrow's transformation into a Gold. He was in charge of teaching Darrow the culture and manners of the Golds, as well as changing his outward appearance to match Darrow's semblance of being a Gold.",
    "section": "General",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Matteo is described to be a \"tall wisp of a Pink with long limbs and a lean, beautiful face.\" His gentle features include an angular nose, rose-quartz eyes, dark honey skin, and dusky hair with gentle curls and a blue sheen. He has impeccable manners and is really graceful. He has a penchant for wearing gloves and sniffing at even the smallest bit of dirt.",
    "section": "Description",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Matteo was born sometime between 700 and 704 PCE. In his early life, he was a Rose of the Gardens before eventually ending up in the employ of Son Industries' Martian offices by 725 PCE.",
    "section": "Pre-Saga",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At some point between 722 and 725 PCE, Matteo designed the Ares armor that Fitchner employed after the Nagasos Uprising. While working for the Sons of Ares, he entered a romantic relationship with Regulus ag Sun, who he later married in 733 PCE.",
    "section": "Sons of Ares",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Matteo oversaw Darrow's training in Gold behavior and culture for the three months leading up to the day of The Institute's entrance exam. Their lessons covered everything from manners, dining etiquette, and equestrian-ship. He remained at the penthouse base in Yorkton until Darrow left for The Institute, after which he returned to his husband's home.",
    "section": "Red Rising",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Matteo is married to Regulus ag Sun, one of the Sons of Ares.",
    "section": "Regulus ag Sun",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Matteo-by-athena.png Matteo mbenskydesigns.jpg Matteo boardgame.PNG File:Matteo-para-art.jpg",
    "section": "Gallery",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"Bald as a toddler, you frenetic little baby\" - Red Rising Ch. 13: Bad Things * \"These are the consequences when the rulers of planets are your enemies. Planets, boy.\" - Red Rising, Ch. 14: Andromedus",
    "section": "Quotes",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* The audio drama adaptation of Sons of Ares: Volume 3 incorrectly refers to Matteo as a Hetaera, rather than a Rose.",
    "section": "Trivia",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Matteo hu:Matteo Category:Pinks Category:Males Category:Red Rising Characters Category:Morning Star Characters Category:Characters Category:Light Bringer Characters",
    "section": "References",
    "name": "Matteo",
    "type": "characters",
    "series": "Red Rising"
  }
]