[
  {
    "text": "Mickey is a Violet Carver who was responsible for Darrow O'Lykos's transformation into a Gold, and Evey's wings. He is a known member of the Sons of Ares. Pierce confirmed that most Violets have 5 fingers per hand, and Mickey added extra to himself.",
    "section": "General",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At the beginning of Morning Star, Adrius au Augustus mentions that Mickey lost his license after he modified a Gold child. From then on, he focused on aerial and aquatic pleasure mods for the black market. Until being solicited by Sons of Ares, he had a workshop in the Bazaar, a lowColor district in Yorkton. He grew up in the Grove, a place of circus culture where there were spectacles every night, celebrations of color, sound and dance. There they were forced to take candies that would take them on journeys to hell, pilgrimages to heaven. There was no escape to the trips of his childhood and he'd drool on the grass as the festivals raged on around him. His mind always separate from his body, and no peace to end the madness. Now he carves what he saw in his fever dreams.",
    "section": "Background",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "A scalpel of a man with a crooked smile and black hair that hangs like a puddle of oil down one side of his head. A facial tattoo of an amethyst sigil of the Violet winds around his left eye, Other violet symbols stain his hands. He has twelve unnaturally fast, thin, and long fingers. He has a particularly ornate and seductive way of speaking.",
    "section": "Appearance",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Dancer O'Faran brings Darrow to the Bazaar, a dense, dark district which has places even Obsidians shouldn't go. Dancer leads Darrow and Harmony to a doorway with a shimmering electronic dragon. Modjob and other guards deny knowing Mickey's existence until Dancer flashes the Sons of Ares sigil on his scorcher and they're let into a dark interior with smoke, throbbing lights, and pulsing music. Inside glass pillars, naked carved women dance as men watch or bid while drinking and smoking. They're led to a back table where Mickey is playing with an electronic puzzle cube. Mickey teases Dancer for being a cripple and asks Harmony to join his family of carved wonders. However, the Sons of Ares representatives respond with disdain and get straight to business, sliding Mickey a box. Mickey peeks and sees two golden wings, the Sigils of a Gold. This causes Mickey to gasp in horror which makes his followers curious which causes Mickey to scream at his entourage to get out which causes them to scurry away. Dancer finally reveals to Mickey the plan that they want Mickey to turn Darrow into a Gold. Mickey is in shock and disbelief at Dancer's words, eyeing Darrow's wiry stature. Dancer and Harmony try to bait Mickey's vanity but Mickey doesn't bite and points out all the side effects and issues with this idea, especially pointing out the mental dexterity difference between a Red and a Gold. Darrow points out that Mickey might know him after Eo's death went viral. Mickey agrees but that doesn't stop him from teasing Darrow further and when Dancer says he wants a Peerless, not a Bronze or Pixie, Mickey is further staggered. Mickey tells Darrow that the Sons' plan is suicide, at which Darrow grabs Mickey's cube and solves it using the skills he learned mining. Mickey is speechless, and agrees to work on Darrow. Mickey then gets to work on Darrow which is full of gruesome descriptions and a lot of pain for Darrow. Mickey is all laughs and smiles during it though and has his carved girls change Darrow's diapers and do other assistance. During Darrow's operations and surgeries, Mickey explains the violent history of Golds and the Forced Darwinianism. Mickey begins growing close to Darrow, stroking his hair and feeding him, as one would grow close to a pet. Mickey reveals that Darrow's heart is so strong because the pitviper",
    "section": "Involvement",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "poison in it forces it to be. Mickey has his servant Evey lead Darrow's physical therapy, and coos about how the two would make pretty children. Mickey also gives Darrow a zither and he and Evey listen as Darrow plays it. Harmony begins exercising Darrow which appalls Mickey who screams in protest to Dancer that they're over pushing Darrow but Dancer sides with Harmony. Mickey grows distant from Darrow as Darrow's muscles build and the monstrous extent of his shape is uncovered. Finally, on the day it's time for Darrow to leave the club, Mickey sits down with Darrow to say goodbye. Darrow asks if Mickey's carved wings allows his girls to fly, Mickey answers no and says he tried but physics won't allow it. Darrow points out that Mickey is now afraid of him, which Mickey mockingly denies. At this, Darrow tells Red is rising whether Mickey will like it or not. Mickey expresses contemptuous doubt but Darrow interrupts, threatening Mickey to take care of Evey or he'll come back for him.",
    "section": "Involvement",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Mickey mightythepen.PNG Operation magellivillenueve.PNG Mickey-050116.jpg PhantomRin Tarot Mickey.jpg Mickey and evey justinwong.jpg Mickey-by-angela-tubbs.jpg Mickey in da club wheredaydreamersgo.png Mickey sallydrawer.PNG Mickey and darrow wheredaydreamersgo.png Mickey stephaniecolomboart.PNG Mickey violetfeverdreams.jpg",
    "section": "Gallery",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "7. Mickey (Red Rising Trilogy) 8. The Carving (Red Rising Trilogy)",
    "section": "Videos",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* At one point, Mickey notes that he believes he saw Darrow in one of his fever dreams at the Grove.",
    "section": "Trivia",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"Horns⁠—you would look fierce in horns.\" - Red Rising, Ch. 10: The Carver * \"Conversation should be considered an art form, or like a grand dinner. Each course in its own time.\" - Red Rising, Ch. 10: The Carver * \"Leave, ''you simpering sycophantic miscreants! I'm talking to you ... you freaks! Get out!\" - Red Rising Ch. 10: The Carver * \"Someone has to dot God's i's.\" ''- Red Rising, Ch. 12: Change",
    "section": "Quotes",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Mickey hu:Mickey Category:Males Category:Violets Category:Characters Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Iron Gold Characters",
    "section": "References",
    "name": "Mickey",
    "type": "characters",
    "series": "Red Rising"
  }
]