[
  {
    "text": "Milia au Trachus is Gold who is part of Darrow's army at the Institute. Originally from House Juno, she was enslaved by House Mars, but turned Oathbreaker. She eventually becomes one of his lieutenants and advisors.",
    "section": "General",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Her father is Gaius au Trachus, Justiciar of the southern Martian hemisphere.",
    "section": "Background",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Her appearance is described as tall and willowy, pale, with a long horseface, sunken cheeks, and a slight hunch to her shoulders. She looks like a hawk, face all angles and cruelty. Her voice is of a similar breed.",
    "section": "Description",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow and Mustang first meet Milia by trapping her and fellow House Juno Oathbreaker, Dax, in the Northwoods. They're persuaded to join Darrow's growing army of Oathbreakers whom are freed by Mustang with the safe-kept House Minerva standard. Milia admires Darrow and tells him the Oathbreakers follow him because they like having a purpose again, especially given a purpose by someone they fear. She also snorts at Mustang and Darrow's growing closeness. Milia gives the signal that the coast is clear when Darrow and Mustang want to free some of Mars's slaves. She also comes in second, behind Mustang, when Darrow's army is doing a balance competition on wood to prepare for the assault on House Ceres. She also tells Tactus to slag himself when he wants to pair with her for the frigid assault. She instead chooses to pair with Dax. She is instrumental in taking House Ceres since her, Darrow, and Mustang are the ones to sprint up an angled tree trunk lifted by Pax and others to get over House Ceres's walls. She gets taken down by one of House Ceres's dogs but bites it and punches it in the balls until it whimpers off. She then shoots arrows at the enemy to give Mustang and Darrow cover to open the gates for the rest of Darrow's forces. Milia is the one who catches Tactus trying to rape Nyla. Mustang barely stops Milia from cutting Tactus a thousand different ways. Later, Tactus prompts Darrow to spill the truth about the interfering Proctors to Milia and the rest of his closest allies. Milia is then given command of her own division in Darrow's army. Milia also defends Darrow from Proctor Apollo. During the battle against House Apollo, Milia gets blasted by the pulseSpear given to Novas by the Proctors. During the siege of House Jupiter, Milia's division gets into a friendly competition with Pax and Nyla's divisions to see who can take the castle the fastest. She's began to look like a nightmare by wearing trophies like Tactus and Thistle. After the castle is taken, Darrow orders Milia to watch the Jupiter students and to take their scalps if they cause any trouble. After the starved Jupitereans are given food, Darrow tells Milia to bring up the \"wine\" which are actually just barrels of grape juice that were taken from House Bacchus. During the battle on Olympus, Darrow",
    "section": "Red Rising",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "and Milia run into each other. Milia grins, and alerts Darrow that his forces have found Olympus' armory as well as the location of the captive Mustang. After the battle is over, Milia along with Mustang and Nyla return to Darrow with the captured Jackal.",
    "section": "Red Rising",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Milia sides with House Augustus during The Martian Civil War, and participates in the Lion's Rain.",
    "section": "Golden Son",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After the Ash Lord nukes New Thebes, Milia joins the Rising.",
    "section": "Solar War",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Milia accompanies Darrow when he infiltrates Deepgrave, and follows him to Venus to assassinate the Ash Lord, where she is killed during the Battle of Gorgon Isle.",
    "section": "Iron Gold",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"Promises are like chains, both meant for breaking.\" - Red Rising, Ch. 40: Paradigm es:Milia au Tragus hu:Milia au Trachus Category:Golds Category:Red Rising Characters Category:Females Category:Iron Gold Characters Category:Deceased Category:Characters",
    "section": "Quotes",
    "name": "Milia",
    "type": "characters",
    "series": "Red Rising"
  }
]