[
  {
    "text": "Virginia au Augustus, better known as Mustang to her peers, is the Sovereign of the Solar Republic and wife to Darrow O'Lykos. She is a Gold and standing Primus of House Augustus, the twin sister of Adrius au Augustus, and the only daughter of Nero au Augustus.",
    "section": "General",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "She was considered the stronger of the two twins born to Augustus; however, since Adrius survived, she was not in line to be the heir, as Nero wanted a male heir. She admired her elder brother Claudius, and used to play with her twin by solving his mazes. Nero cared for his only daughter and used to go horseback riding on the Augustus estate with her and make angels in the flower fields. After Nero's second wife and mother of all of his children died, her father couldn't look her in the eyes for 3 years. After Claudius au Augustus was killed by Karnus au Bellona, Nero separated the twins and Virginia was raised by Kavax and Niobe au Telemanus. She became good friends with their children, especially Pax, who eventually became her housemate at the Institute.",
    "section": "Background",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "When Darrow first met Virginia, before the Institute, he noticed her hair, which was very long and \"more golden than the setting sun\". Later she's said to have a clasically beautiful heart-shaped face and full lips. Her eyes, like most golds, are golden. While at the Institute she wears her hair in braids.",
    "section": "Appearance",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Virginia is known best for her genius level intellect. She is seen as something of a visionary at her age among the Golds, and has great political skill. She has keen social instincts and is able to befriend, charm, and work with others well, winning friends and allies easily. She is also highly empathetic and compassionate, though she is talented at hiding these traits so as not to show weakness. Virginia is very loyal to her family, even when they don't demonstrate the same in return. Despite her father and her brother's occasional scorn for her, Virginia does her best to ensure the strength and safety of her family, and works with them as far as her morals allow her. Politically, Virginia has always been a Reformer by Gold standards. During her tenure under Octavia au Lune, she wrote about fairer treatment of lowColors, though she still demonstrated a degree of prejudice against them. Virginia initially doubted whether The Rising could be effective. However, her time with Darrow, his family, and other members of The Rising helped her to understand their grievances and purpose, and she eventually chose to fight with them to overthrow The Society. After the Society is overthrown, Virginia forms the Senate and becomes the new Sovereign. She forms The Solar Republic, bringing back democracy for the first time in almost 800 years.",
    "section": "Personality",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow encounters Virginia while horseback riding in Ishtar, where she mocks him for his poor performance. He later overhears her humming The Reaping Song in the locker rooms after the physical portion of The Institute's entrance exam. Virginia enters the Institute as a Premier entry alongside her brother, and is assigned to House Minerva without a draft. Virginia becomes Primus of her house and battles against Darrow and House Mars. Though she initially seems to hold the upper-hand over him, Darrow's clever strategies and out of the box thinking take Virginia off guard, and Darrow is able to utterly destroy her house with the aid of House Diana. However, he allows her to escape after fearing what some members of his house might do to her. Virginia pays Darrow back for this, rescuing him after he is betrayed by Cassius au Bellona and badly wounded. She nurses him back to health and their time together causes Darrow to be reminded of Eo when he's with her. Virginia and Darrow form an alliance and work together to defeat the other houses and even attack Olympus, where the Proctors reside. Virginia encourages Darrow to change the system and change what it means to succeed in the Institute. Virginia does not reveal to Darrow that she is the sister of the Jackal, Adrius au Augustus, one of Darrow's chief rivals. She offers to hunt her brother down for him, and much to Darrow's surprise, she comes through for him and successfully captures her brother. Darrow and House Mars thus win at the Institute.",
    "section": "Red Rising",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Shortly after leaving The Institute in 738 PCE, Virginia begins a relationship with Darrow. A month after he formally becomes a lancer to her father, she leaves for a tour of the Griffin sanctuaries of the Martian antarctic the night before Darrow travels to Neo Positano to convince Lorn au Arcos to train him in the Willow Way.",
    "section": "The Book of Lorn",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow's decision to serve her father and go to the Academy pushes him and Virignia apart after two years year. Knowing her family is in danger, she pledges her allegiance to Octavia au Lune with her only precondition being that her family is kept safe. Octavia accepts and takes her on as a lancer. During her year as a lancer of House Lune, Virginia starts a relationship with Cassius, not out of love, but instead as a further step to ensure the safety of her family. She and Darrow meet again at the Summit Gala in December 741, and both end up arguing, each declaring that they cannot recognize the other. She watches Darrow easily defeat and humiliate Cassius in a duel. When Darrow is about to strike Cassius down, Virginia stops him and asks him not to lose himself. Darrow complies, and Virginia and him share a moment, back together on the same page. She ends her relationship with Cassius shortly after this. She joins Darrow and her father in the Civil War amongst the Golds, but cannot understand Darrow's reasons or ambitions. Nonetheless, they grow closer together. After an argument over Darrow's hypocricy, their relationship is left on the rocks, and she grows cold to him. They share a moment in prepartion of the Lion's Rain, before Virginia pulls away. After Darrow's escape from Agea with the help of Fitchner, Virginia decides to appoint herself as Darrow's chief politico. A moment of vulnerability from Darrow leads to them giving in to their feelings for each other and becoming intimate for the first time since Darrow left for the Academy. However, Virginia feels betrayed when she learns that Darrow is actually a Red, and is suspicious of him and of the Rising. Darrow tells her of his mission and his plan to upend the Society and grant better rights and freedom to the lowColors, but Virginia loses her trust in him. She abandons Darrow after this, and learns shortly thereafter of her brother's treachery and the plan to trap Darrow. She is able to successfully flee, but Darrow is captured by her brother.",
    "section": "Golden Son",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "A year later, Virginia is still an outlaw from the Society, and has the support of several Gold families, such as the Telemanuses and the Moon Lords. She is reunited with a recently escaped Darrow in a fight, and the two part in surprise and shock. She later intercepts Darrow and reveals that she had taken command of the remnants of his forces, but kept his commanders intact, including those of the lowColors, which surprises Darrow. Virginia tells Darrow that his words convinced her, and she is willing to give his methods and his cause a chance, if Darrow is able to prove himself to be more than a warrior and avenger. They work well together and battle the Sovereign and her forces together in a series of conflicts. Virginia and Darrow become close again, with Virginia comforting Darrow in his moments of doubt and sorrow. Virginia regains her trust in Darrow and befriends his family, confiding in his mother a secret she has kept from him. Darrow is able to successfully defeat the Sovereign and Adrius with the help of several others including Virginia, and The Rising is successful. Virginia is made the new Sovereign, a position and responsibility she does not want, but accepts for the sake of peace. She disbands the Senate and the Board of Quality Control, and begins a new relationship with Darrow, him as the leader of the Rising and the voice of all the lowColors, and her as the Sovereign of the Golds. She reveals to Darrow that they have a son together, born from their union in Golden Son and whom Virginia gave birth to during Darrow's year in captivity. She named him Pax, after their friend from the Institute. on the Day of Red Doves.]]",
    "section": "Morning Star",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Virginia continues to reign as Soverign of the Solar Republic.",
    "section": "The Solar War",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* '''Darrow O'Lykos''' Virginia meets Darrow in the Institute, and is initially pitted against him, as she leads House Minerva and he leads House Mars. Darrow defeats her in battle, but allows her to escape when he fears what some of his side might do to her. Virginia repays him by nursing him back to health when he is wounded. Together, they succeed in the Institute and defeat the other houses. Between the Institute and Darrow's departure for the Academy, they were in a relationship. However, Darrow's decision at the end to join her father and study at the Academy forces them apart. They later meet when Virginia is now with Cassius, though she is mostly with him for political means and to ensure the safety of her family as opposed to genuine romantic affection. She and Darrow later reconcile and work together, rekindling their relationship. However, her discovery of his true heritage as a Red, and learning of her brother's betrayal of Darrow forces them apart yet again. In Morning Star, Darrow discovers that she saved Orion and her fleet in time, but couldn't save Darrow at the Triumph. She later allied herself with the Moon Lords and managed to save their heirs from Luna, where Octavia had been holding them as hostages. She lost at Deimos to Roque au Fabii and Sevro au Barca refused to answer her. They reunite once again, and this time work together to bring down the Sovereign. Despite their differences, Virginia comes to accept Darrow's agenda as leader of The Rising and advises him loyally. At the end of the novel, they are fully reconciled and Virginia reveals to Darrow that they have a son together whom she named Pax. * Cassius au Bellona Virginia meets Cassius at the Institute, where he is unaware of her identity as the daughter of his family's arch-rival. Virginia does not seem to think Cassius very bright, but does find him to be handsome. In Golden Son, it is revealed that after Darrow left for the Academy, Virginia began a relationship with Cassius and was even engaged to be married to him. However, Virginia later reveals to Darrow that her relationship with Cassius was primarily to ensure the safety of her family, and not one of love. She asks Darrow to spare his life when he humiliates and defeats Cassius in a duel. Shortly after this however,",
    "section": "Love Interests",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Virginia ends her relationship with Cassius and begins one with Darrow. In Morning Star, Virginia has little to do with Cassius, and makes it clear that their relationship is well behind them, to his disappointment. She does however, ask Cassius to stay and help with the new government she and Darrow intend to set up. Cassius declines and instead leaves in a self-imposed exile.",
    "section": "Love Interests",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Nero au Augustus Virginia's father Nero is a cold man who often seems dismissive of his daughter and disregards her will and beliefs. Virginia for her part disagrees with many of her father's views and the two do not get along very well. However, Nero does respect Virginia's intelligence, and sees her as being exactly like her mother, understanding her better than he lets on. Virginia in return does what she can to protect and ensure the safety of her father and their family, regardless of their tumultuous relationship. During her childhood, he was somewhat supportive and gave her more attention than he gave Adrius. After her mother died, he couldn't look at her in the eyes for 3 years. * Adrius au Augustus Adrius is Virginia's twin brother, he was deemed to be weaker than Virginia and their older brother Claudius from birth. However, after the death of Claudius (which he had a hand in), he was considered the heir of the family ahead of Virginia despite her being the better sibling. Her relationship with her brother is complex, as outlined by their youth where Adrius would attempt to outwit and prove himself smarter than his sister. He would have her complete mazes that were devised as a means of testing his superiority. Adrius would feign affection when Virginia solved them, and would then lash out in violence towards himself later and in private, something his sister witnessed. Thereafter, Virginia attempted to protect his feelings by pretending to not be able to solve the mazes, but Adrius would see through her facade, an ability that he continuously shows throughout the series. Their competitive nature and Adrius's hand in the death of Claudius drove them apart, and neither has much outward affection for the other. Virginia believes that Adrius is the only person who is smarter than she is. Virginia helps Darrow defeat Adrius in the Institute, and delivers him to Darrow naked and tied up. Thereafter he bears a fierce grudge over this and murders their father Nero and drives Virginia away after Darrow's defeat in Golden Son. Their relationship comes to a head in Morning Star, where Adrius is finally defeated and is ordered to be executed. On the day of his execution, Adrius is hanged on Luna with an even lower gravity than Mars so as to slow the timing of his death. He hung there",
    "section": "Family",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "for some time before Virginia, newly made Sovereign, went to hold and pull him down by his legs to give him a faster death, indicating that despite everything, she did love her brother. * Claudius au Augustus Claudius was Virginia's elder brother. The two were close, and she looked up to him and admired him. Virginia believes that Claudius's death changed her family for the worse, and she later bears a grudge against Adrius for his part in his death.",
    "section": "Family",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Pax au Telemanus Pax and Virginia were close friends since childhood, in part due to House Augustus and House Telemanus being close, and due to Pax acting as Virginia's protector. The two have a mutual respect for one another, with Pax heeding Virginia's command and advice, and shadowing her almost at all times. In addition, it can be noted that Pax gained an immediate respect for Darrow after Mustang informed him that he was a friend. At the end of Morning Star, it is revealed that Virginia named her and Darrow's son Pax in honor of her fallen friend. * Daxo au Telemanus Daxo and Virginia were also close, with the former at one point saving the latter from drowning. Virginia appreciates Daxo's intellect, and notably is the first to notice his modeling of himself after Milton's depiction of Lucifer in Paradise Lost. She also guessed that the gigavok in Daxo's personal skyhook (which looks similar to an engorged pair of testicles) were a metaphor for Daxo's virility and his fear that if he had children, they would eat one another. In Dark Age, Daxo fights a mob of Vox Populi on the Day of Red Doves in order to protect Virginia, sacrificing himself so that she would survive. * Kavax au Telemanus Due to her father being rather distant, Virginia grew to see Kavax as a father figure. Like the rest of House Telemanus, the two share a deep mutual respect, with Kavax well aware of her intellect and affinity for strategy. * Thraxa au Telemanus Because of how they grew up together on the Telemanus estate, Thraxa became like a sister to Virginia. * Sevro au Barca Virginia sees Sevro as a close friend, and is impressed by the tightly-knit relationship he has with Darrow and the rest of the Howlers. In some ways, Virginia also fears Sevro, due to his brutality and his fierce loyalty to Darrow. * Victra au Barca Although originally distrustful of Victra due to her House Julii heritage, she later comes to trust Victra as much as any of Darrow's liutenants, due in part to the relationship between Sevro and Victra.",
    "section": "Friends",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Mustang-by-tiara.jpg Mustang NanFe.png Mustang-0.jpg Virginia-by-tyler-grayson-ellis.jpg Virginia-by-parisa.jpg Virginia-lesya.jpg Mustang-by-igor-kieryluk.jpg Mustang tough pallasillustration.PNG Virginia sam burley dark age.jpg",
    "section": "Gallery",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Pierce Brown got her name and some personality traits from the Train song \"Meet Virginia.\" * She participated in the Suvudu Cagematch in 2015, where her power is \"Withering Scorn.\" * Accoring to a Reddit AMA (done for the release of Morning Star) Pierce Brown stated that between the Institute and the Academy, Darrow and Virginia consummated their relationship. * Her mother committed suicide from depression after losing a baby girl in the womb. Virginia never understood why she did it. * According to Darrow, both he and Virginia like the way children are raised in the Rim. * She's one foot smaller than Darrow. * Kavax used to read her stories by the fire about heroes who protect the weak. * As Sovereign, she is known as Virginia the Lionheart. * In Iron Gold, she wears her father's lionhead ring and Darrow's House Mars ring.",
    "section": "Trivia",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"I am the mustang that nuzzles the hand. People know they can work with me.\" - Red Rising, Ch. 34: The Northwoods * \"No. Don’t speak. It’s not your turn just because I pause.\" * “Oooo. I am Reaper. God of wolves. King of strategy.” * \"All my life, I’ve tamed myself to not frighten others. Sometimes it is fun to let the lion out.\" - Dark Age, Ch. 26 * \"This horse rides for only one man\" - Dark Age, Ch. 26 * \"The key is having a long memory for the sweet, and a short one for the bitter.\" - Dark Age, Ch. 35: Endure",
    "section": "Quotes",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Virginia au Augusto hu:Virginia au Augustus Category:Characters Category:Golds Category:Females Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Iron Gold Characters Category:Dark Age Characters Category:Light Bringer Characters",
    "section": "References",
    "name": "Mustang",
    "type": "characters",
    "series": "Red Rising"
  }
]