[
  {
    "text": "Narol was a Red from the Martian mining colony of Lykos, and the paternal uncle of Kieran, Leanna, and Darrow O'Lykos,",
    "section": "General",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Narol had wrinkled skin and calloused hands, thick hair with gray streaks and a scar on his upper lip. In Lykos he wore a tattered red shirt and was seldom seen without a flask of alcohol. By the time of The Rising he was bald, had two more facial scars, and was sunburnt on his neck and forearms from time spent on Mars' surface. As an active member of the Sons of Ares, he carried a railgun and wore a black military jacket with a slingblade sewn above an inverted Society logo.",
    "section": "Appearance",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was a drunkard, and as HeadTalk, was considered rather cowardly, constantly stopping operations to check if there was gas and breaking many drill bits in the process. According to Darrow, his excessive caution arose from the fear for his and others' lives after Dale's death.",
    "section": "Personality",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Narol was born on Mars in 702 PCE in the heilum-3 mine of Lykos. He started working in the mines at age thirteen, as was traditional of lowReds in the mining colonies, and eventually became the HeadTalk of the Lambda clan's day shift team. He married in 718 or 719 PCE, and had two children, his son Loran, and his daughter Lana. At some point between 722 and 726, Narol joined the Sons of Ares as an informant, telling them of exceptional Reds in Lykos for them to extract the best of their color from the mines as part of Ares' plan to have a Red carved into a Gold to infiltrate The Institute. In 726 PCE, his older brother Dale attempted to lead a nonviolent protest against the mine administration of The Society. Narol attempted to talk him out of it, telling him that words and dance meant as much as dust. When words failed, Narol tried to stop his brother with force, only to be knocked unconscious in the ensuing fight. When Darrow came of age, Narol taught him the traditional dances of their people in secret, and continued to support Dale's widow Deanna. At some point between 733 and 736 PCE, Darrow was bitten by a pitviper and Narol attempted to suck out the poison.",
    "section": "Pre-Saga",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In March 737, After Darrow and Eo are arrested the following morning for trespassing in the bubbleGarden, Naro was one of the miners assigned to carry out their public whipping three days later. After Eo is hanged for singing the Reaping Song during her whipping, Narol finally informed the Sons of Ares about Darrow, knowing that Darrow would follow her to certain death otherwise. When Deanna told him about Darrow sneaking out to go bury Eo, Narol intercepted his nephew and drugged him by offering him a final drink secretly spiked with Haemanthus oil. At Darrow's hanging, Narol shoved Kieran out of the way and pulled his feet in order to fake Darrow's death.",
    "section": "Red Rising",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In 739 PCE, Narol and Loran faked their deaths in a mining accident by falling down a mine shaft in order to join the Sons of Ares full time. While those back in Lykos believed them to be dead, Deanna had her suspicions since their bodies were never recovered.",
    "section": "Golden Son",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "As an active member of the Sons of Ares, Narol formed a unit comprised of ex-Helldivers and assorted useful lowColors that he nicknamed The Pitvipers. His unit became known as a motely collection of hardasses specializing in sabotage and thievery, and were considered the \"B squad\" to the Howlers. Narol and the rest of his family grieved for Darrow after The Society staged a false execution with a body double in June 742. When the Sons of Ares discovered in March of the following year that Darrow was still alive, Narol led a drillteam consisting of Lykos Reds from the Lambda and Omicron clans to punch up into Attica for the rescue team to escape through. When they arrived back in Tinos, Narol read to Darrow while his nephew was unconscious in Tinos. When Darrow regained consciousness, Narol and the entire family spent the night together at their family home in Tinos before briefing Darrow on the state of the war the following day. They share a drink together in the commissary along with Deanna, Kavax, and Daxo as she tells them stories from her interactions with Darrow at The Institute. While the Red Armada departed for Ilium on July 10th, Narol and the Pitvipers leave Mars to sabotage one of The Jackal's deep space communications relays. Narol was captured sometime before August 4th, and attempted to bite off his own tongue to avoid giving up secrets during interrogation. On August 4th, he was executed by The Jackal as a message to Darrow and the recording was broadcast across the solar system.",
    "section": "Morning Star",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Despite his capture, Narol's Pitvipers were able to successfully complete their mission to take down the communication relays, blinding The Society forces to the Red Armada's movements after the Battle of Ilium. Interference and jamming in the asteroid belt prevented the Red Armada from receiving the broadcast of Narol's execution until a week after the battle., but once it was received, news of Narol's death instigated a brief riot aboard the ships of the Red Armada, led by Obsidians under the command of Sefi the Quiet. Narol teaching his nephew to dance helped contribute to Darrow's development of the Breath of Stone razor fighting form in 755 PCE.",
    "section": "Legacy",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Narol is an alternative name to buspirone, a drug used to treat generalised anxiety disorder.",
    "section": "Trivia",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"Death chewed on me a bit. Then spat my bloody ass back out.\" - Morning Star, Chapter 8 * \"Old enough to screw, old enough to crew.\" - Red Rising, Ch. 1: Helldiver * \"in which he hides his hands⁠—a trait of the frightened\" - Red Rising, Ch. 7: Other Things * \"Time to drop your balls\" - Red Rising, Ch. 43: The Last Test",
    "section": "Quotes",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Narol hu:Lykosi Narol Category:Reds Category:Characters Category:Males Category:Red Rising Characters Category:Deceased Category:Morning Star Characters",
    "section": "Notes & References",
    "name": "Narol",
    "type": "characters",
    "series": "Red Rising"
  }
]