[
  {
    "text": "Nero au Augustus is the Primus of House Augustus, ArchGovernor of Mars and the 13th generation of the gens Augustii. He is the father of three children, Claudius, Adrius (the Jackal), and Virginia (Mustang). He is a cold, calculating man who cares primarily for his own success and the preservation of his house.",
    "section": "General",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "When he was young, he was simply called Nero. Many years ago, his father, the Primus at the time, decided to kill off House Bellona by attempting to poison them at a feast. The attempt failed. However, ArchGovernor Cylus sided with the Bellonas, and House Augustus was decimated. This started his deep hatred for the Bellonas. The ArchGovernor spared the very young Nero on the orders of then Sovereign Ovidius au Lune as to not let one of the great Houses of Mars perish - it is said that Aegea was burning so much that there wasn't any water left and Cylus had to feed the parched child grapes himself so he wouldn't die of dehydration. Nero won his year at the Institute. Years later, when he was in his twenties, he was able to avenge his family name when he deluded Iona au Bellona into marrying him and killed her on their wedding night. Thus, the two families have been at odds ever since. He gained the ArchGovernorship by allying himself with the Ovidius's daughter, Octavia au Lune. Octavia persuaded her father to let Nero have his revenge on Cylus and give him the seat of the most powerful person on Mars. The Sovereign sent Lorn au Arcos himself to help Nero establish his reign as ArchGovernor. Later, after Octavia decapitated her father, Nero backed her conquering of the Morning Throne. He presides directly over the Fifth Fleet of the Society.",
    "section": "Background",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "A very stoic man, he was said to be a mite cold by Lorn au Arcos. Darrow perceived him to think himself above morality and concepts of good and evil: putting concerns for humanity's survival above all else. However, he is not entirely without emotion, as demonstrated by his reactions to his two heirs' deaths. As with most Golds, he is deeply calculatingly and manipulative. Supposedly doesn't like to eat anything he didn't kill with his own razor. Every time he returned to Mars from another moon or planet, he performed the Iron Circle over Mars to show who owned it.",
    "section": "Personality",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Nero is described as \"tall and imperious,\" with rough hands and bony fingers. His Peerless Scar runs along his right cheekbone. Like all Golds, he has golden hair and eyes. He was not an Adonis, and instead of being carved from marble, Darrow notes him to be chiseled harshly from granite. He has a straight nose, deep cheeks, tough skin, and contemptuous eyes made from the embers of a dying sun. “His face is older, severe, and pure with power. His hair shines, combed back against his head. Neither a smile nor a frown mark his thin lips, and the only line I see is that of a scar, which runs along his right cheekbone.” ''– Darrow O'Lykos about Nero, Red Rising''",
    "section": "Appearance",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "When Nero was seven, his family went to war against House Bellona, but all of his relatives were slain by House Cylus, with only Nero himself spared on the orders of Sovereign Ovidius au Lune. He was taken in as a ward of ArchGovernor Cylus and raised in his court, At the age of twenty-seven, he married Iona au Bellona and murdered her on their wedding night before sending her head in a box to her family. He then conspired with Ovidius's daughter Octavia to have her father exterminate House Cylus and install Nero as the new ArchGovernor or Mars. In exchange, he backed Octavia when she overthrew her father five years later and usurped the Morning Throne. After becoming the new ArchGovernor, Nero sought to expand his household's depleted ranks by bringing multiple vassals together under his banner, taking the approach of House Augustus being not one family, but many under one.",
    "section": "Pre-Saga",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Nero is first seen present at Eo's execution. Later on, during Darrow's time in the Institute, it is revealed that he bribed the Proctors of the Houses so that his son Adrius would win. Upon seeing his son's failure and Darrow's striving, he decided to make Darrow his lancer.",
    "section": "Red Rising",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After Darrow fails to defeat Karnus au Bellona at the Academy, Nero terminates Darrow's contract as a Lancer. At the Summit, Darrow regains his favor by promising Cassius' death in their impending honor duel. After escaping Luna and learning that the Sovereign planned to have his entire household assassinated during the gala, he agrees with Darrow's plan to raid the shipyards of Ganymede and personally leads the strike force while Darrow goes to meet Lorn on Europa. His politico Pliny sold him out to the Sovereign to raise his own station, and after a fierce battle, Nero was captured. He was taken to Mars to be executed by the Bellona, but Adrius' lurchers rescued him during Darrow's Iron Rain. At the Triumph held to honor their victory, Nero informs Darrow of his intentions to adopt the lancer as his heir. At the Triumph banquet, Adrius' boneriders massacre the guests as Praetorians arrive under the command of Cassius au Bellona and Aja au Grimmus. With his allies slaughtered, Nero spits on Adrius' attempts to seek his father's approval and declares that Adrius is not his son. In response, The Jackal shoots his father in the head.",
    "section": "Golden Son",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Though Nero is long dead by this point, Kalindora au San reveals that during the events of Red Rising, Nero and Revus au Raa collaborated with Anastasia au Lune and her husband Brutus au Arcos in an attempted coup against Anastasia's mother, Octavia au Lune. Octavia became aware of their conspiracy and in 739 PCE had Anastasia and Brutus killed before systematically plotting the elimination of her daughter's co-conspirators, leading to her plans to kill him at the Summit gala in Golden Son and install House Bellona as the new ruling family of Mars. Cicero au Votum tells Lysander au Lune, in Dark Age, a story he already heard - Nero au Augustus visited House Votum on their estate on Mercury in 738 PCE. Scorpio au Votum, the Primus, took him hunting. Nero personally followed and killed a white gazelle with the determination of a lion. When he arrived back at the estate carrying his quarry, Nero told the Votum \"Beasts must stop for water. I carry mine.\" Not wanting to be the small man on his own planet, Scorpio served Nero lion at dinner the following night. Despite Kavax's nervousness, Nero ate the lion without complaint and left. A month later, he sent his new lancer Darrow au Andromedus as a courier, Darrow's presence serving as a silent boast to the ferocity of Nero's personal killers. On Nero's orders, Darrow delivered an ornate box to House Votum containing a bundle of grapes and the note 'Work in progress.' The implicit threat haunted Scorpio with nightmares and anxiety for a week.",
    "section": "Dark Age",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Iona was the daughter of Julius au Bellona. She was used as a tool for Nero's revenge against House Bellona. While Iona was seen to be in love with Nero, the man didn't reciprocate her feelings, as just after the wedding, when House Bellona retired to their estate, Nero sent a package of her head to her family, her mouth stuffed with grapes.",
    "section": "Iona au Bellona",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Virginia au Augustus is Nero's only daughter. He taught her how to ride horses, told her to read poems and not just military histories, and went on rides with her to the forest. After his second wife died, all that changed - Nero couldn't look at Virginia for three years after her mother's death as she reminded him of her. After Claudius died as well, Nero was left a shadow of his former self, so Virginia took it upon herself to protect what remained of her family. Nero's relationship with his daughter is questionable at best - he doesn't want a daughter as his heir, he underestimates, and occasionally, even insults her. Virginia, however, stopped caring about his opinions, unlike her twin brother, Adrius. Despite the occasional animosity, Nero isn't oblivious to his daughter's abilities or personality. He remarks often how similar she is to her mother (Nero's second wife, the only woman he actually, truly loved) and knows her well enough to tell what can please or displease her. He also looks out for her to make sure she will be safe.",
    "section": "Virginia au Augustus",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "To Nero, Adrius isn't even considered the spare to his heir. Adrius has a weak constitution by Gold standards, without being a Bronze and Nero always hated that. No matter how intelligent, capable and resourceful Adrius proved to be, it was never enough for Nero. He neglected Adrius, instead choosing to spend time with his other children, Claudius and Virginia. Adrius remained in the house creating mazes and puzzles while his siblings went horseback-riding, fishing and exploring and learning with their father. Adrius always sought Nero's approval in a never-ending pattern, never managing to get it. He then proceeded to eliminate whoever stood in his way for his father's love. He allied with Karnus au Bellona to kill Claudius. Nero only found out before his death at Adrius's hand. He was devastated by his heir's demise and sought to take revenge on the Bellonas by getting Julian au Bellona killed in the Passage. Adrius went on to poison Leto, his father's ward, who died immediately after that, decapitated by Karnus au Bellona at the summit gala on Luna, in Golden Son. The breaking point for Adrius was when Nero wanted Darrow to be his heir, as he couldn't accept that his father would rather have a Red (although at that moment only Adrius knew this) as his son, rather than his own flesh and blood. Before he died, Nero wished he would have suffocated Adrius in his crib. Adrius claims he managed to forgive his father, eventually.",
    "section": "Adrius au Augustus",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Unbeknownst to him, Nero killed Darrow's wife, Eo, and unwittingly started an uprising that never was before among the Reds and other lowColors. After Darrow, carved and educated to be the perfect Peerless Scarred, conquers the Institute and defeats Nero's son, Adrius, Nero offers him an apprenticeship and a place in his household as a Lancer, in exchange for his silence (he doesn't mind Virginia's relationship with Darrow in the least as purity of blood is a foolish notion for him). Darrow accepts just so he can destroy the Society from the inside. He swears in front all the Drafters and students his fealty to Nero. Nero is a very proud and power-hungry individual, so it was not surprising that he flaunted Darrow as his most effective killer. It never occurred to him that, while he was using Darrow to show off his power, Darrow was using his power and influence for his own cause. When Darrow was disgraced at the Academy, Pliny capitalized on that to disgrace him in front of Nero. It worked, until Darrow changed the paradigm at the summit gala where he was supposed to be sold to the highest bidder. Darrow went straight for Nero's enemies, wanting to humiliate and kill House Bellona's most precious son - Cassius. Nero couldn't resist the temptation of gaining more power, not only over the Bellonas, but also over the Sovereign, as Cassius was in her favour as Morning Knight. He gave Darrow an old Mars blessing in front of the entire crowd. As Darrow made a spectacular and very satisfying show and Octavia put herself in a dangerous position, Nero welcomed Darrow back into his graces. Through out Golden Son, Nero gains more and more respect and love regarding Darrow, who basically started a civil war in his name to make him Sovereign and unseat Octavia au Lune. Darrow uses Nero's name and resources to gather forces against Octavia, yet most of the allies join the cause because of Darrow's power - The Reaper reminds every Gold of their ancestors, the Iron Golds. His love for Darrow peaks after the Lion's Rain, at the Triumph on Aegea, Nero adopts Darrow as his son and, knowing about Virginia's relationship with him, hopes that when the times come, he will marry into the family too (mostly to please Virginia, as Nero wants to get rid of her Reformist allies after",
    "section": "Darrow au Andromedus",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "they have run their use). Darrow and Nero's relationship can be compared to that of Achilles and Agamemnon.",
    "section": "Darrow au Andromedus",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Leto was Nero's lancer, brought by Pliny, who knew that the ArchGovernor will see in Leto similarities that will remind him of his dead son, Claudius, thus securing a place for Leto in Nero's heart. Pliny's plan succeeded and Leto became Nero's favorite. Nero grew so fond of him that he would've made Leto heir to House Augustus if his death wouldn't have occurred. Nero was seen to be torn by his death. Darrow described Nero's expression in the moment of Leto's death as being the one of a man losing his son, as it was what Leto meant to him.",
    "section": "Leto",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "It is implied that Nero loved his son, Claudius, and his death stirred a stronger hatred for House Bellona, as he was killed by Karnus au Bellona. He thought of his son to be a honorable man, a powerful warrior with the dignity and the strength needed to rule. Nero is seen in a desperate attempt to find another heir, most likely his thoughts being unconsciously directed to Claudius and his quest to find a man to remind him of his lost son.",
    "section": "Claudius au Augustus",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Nero-virginia-wheredaydreamersgo art-081220.jpg Nero-071416.jpg Nero-au-augustus-justinwongart.jpg Adrius-nero-virginia-053016.jpg Nero-au-augustus-gorydamn-reaper.jpg Nero-au-augustus-tarot-phantomrin.jpg Nero marcelosiquiera.jpg Nero augustus and friends wheredaydreamersgo.png Kaitexas nero.PNG Nero mightythepen.jpg",
    "section": "Gallery",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"This school is not life. Here you are king. In life, there are no kings. There are many would be kings. But we Peerless lay them low.\" - Red Rising, Ch. 44: The Beginning * \"Steel is power. Money is power. But of all the things in all the worlds, words are power.\" - Red Rising, Ch. 44: The Beginning * \"Darrow, Lancer of House Augustus. Rise, there are duties for you to fill. Rise, there are honors for you to take. Rise for glory, for power, for conquest and dominion over lesser men. Rise, my son. Rise.\" - Red Rising, Ch. 44: The Beginning",
    "section": "Quotes",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Nero was a real emperor of the Romans. * Nero was a cognomen of the gens Claudia, an important patrician house whose Claudii were described as thus: {| align=\"center\" style=\"border:solid 2px #122338; padding:0.5em;\" | width=\"20px\" valign=\"top\" style=\"color:#C72A1D; font-size:30pt; font-family:serif; font-weight:bold; text-align:left; padding:10px 10px;\" | “ | valign=\"top\" style=\"padding:4px 10px;\" | That house during the course of centuries produced several very eminent, few great men; hardly a single noble-minded one. In all ages it distinguished itself alike by a spirit of haughty defiance, by disdain for the laws, and iron hardness of heart. | width=\"20px\" valign=\"top\" style=\"color:#C72A1D; font-size:30pt; font-family:serif; font-weight:bold; text-align:left; padding:10px 10px;\" | ” |- | | colspan=\"2\" valign=\"top\" | — Barthold Georg Niebuh |} * Nero means \"strong and sturdy\".",
    "section": "Trivia",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Nerón au Augusto hu:Nero au Augustus Category:Golds Category:Males Category:Red Rising Characters Category:Golden Son Characters Category:Deceased",
    "section": "References",
    "name": "Nero",
    "type": "characters",
    "series": "Red Rising"
  }
]