[
  {
    "text": "Pax au Telemanus was a very large and well-built Gold who attended The Institute with Darrow and was drafted into House Minerva. He was the son of Kavax au Telemanus and brother of Daxo au Telemanus.",
    "section": "General",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Pax is around 7'4\" tall and built like an Obsidian. He is described as short-haired, with small eyes and has a chin like a heel with a dent in it. He is also partially of Pacific Islander descent, from his mother.",
    "section": "Appearance",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "A surprising energetic talker with a penchant for complimenting everything in his stories. He is known for yelling out his name as a war cry during a battle.",
    "section": "Personality",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "One time Pax was mistaken as an Obsidian and nearly shipped off to the Agoge, where they train in combat. In his early life, at his family's summer manor in New Zealand, Earth, Pax would sneak off the Nagoge and join the Obsidians in their training, sparring and fighting with them to test his strength. While there, he fell in love with an Obsidian woman named Helga. His parents bred him to lead Obsidian landing parties into hull breaches.",
    "section": "Childhood",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Darrow and Cassius first set sight on Pax and marvel at his size when they're trapped in a lake by Mustang and Minerva students. Pax and Mustang are then alerted by smoke of House Mars' location and ride off to take it. Sevro rescues Darrow and Cassius from the lake and sneaks them into House Minerva, Darrow notices a tally in the warroom that Pax has taken the most slaves for his House at a score of eight and sent nine students to the medBots. Later, Darrow returns to a taken House Mars and learns from Mustang that Pax laid Titus low in a one on one. This is when Darrow's troops surprise attack Mustang's troops. During this battle, Pax goes straight for Darrow and tackles Darrow's horse. Pax manages to grab hold of Darrow and uses a hug of death move but Darrow's rage allows Darrow to use his knee and mash Pax's grapes multiple time. They both then collapse and faint. Darrow releases Pax and the other Minerva slaves back to Mustang in return for Titus. After allying with House Diana and hiding his troops in dead horses, Darrow's forces march to confront House Minerva again. This is where Darrow challenges Pax to a duel. Pax comes out thumping a war axe on a shield depicting Medusa's head, while Darrow has a stunpike and slingBlade, both fighters in full armor. They both land blows on each other but eventually Darrow is able to blind Pax's visor with mud. Pax's hands are occupied with axe and shield so Darrow is able to get more hits in and Pax crumples. That's when Darrow gives the howl signal to his hidden forces and House Minerva falls. After Darrow and Mustang go into hiding, they learn from their recruited Oathbreakers that Pax has become a legend, like by picking up and throwing a horse and rider into the Argos as Mars's slaves fought Jupiter's. Darrow and his Oathbreakers are successful in freeing a group of Minerva students who had become slaves of Mars, including Pax who takes twelve people to wrestle him down until Mustang is finally able to use her standard to free him. Everyone in Darrow's army gets a wolf cloak except for Pax because they haven't made a wolf big enough for him. Pax is paired with Tactus for the frosty hidden assault on House Ceres where Mustang sees",
    "section": "Red Rising",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "them snuggle together in a wolf pelt during the night. Darrow gains respect and loyalty from Pax after beating him in man-to-man combat. He was instrumental in taking House Ceres, along with Tactus au Rath who both help lift a tree trunk at an angle to help Darrow's forces climb over House Ceres's walls. Once the gates are open he storms in shirtless, massive, muscled, and screaming \"PAX AU TELEMANUS!\" while the Ceres students scream in terror. He makes boys and girls fly through the air as he hits them with another boy as his club. He also spikes his hair to form horns with tree sap. It takes five minutes to take House Ceres. When Tactus is caught sexually assaulting Nyla, Milia and Pax take hold of Tactus, however the recently freed Diana students put on their war gear and are mad enough to threaten to fight Pax to take Tactus back. During Tactus's whipping, Pax holds back the angry Diana students. Then, to everyone's surprise, at Darrow's insistence Pax is forced to whip Darrow twenty-five times as a show of unified punishment when Tactus was whipped. Pax tries to go light but Darrow's back still ends up looking like chewed goatmeat, which traumatizes Pax and he cries afterwards. When the House Apollo emissary, Novas, rides up to meet Darrow, Mustang forces Pax to his knees and they start a snowball fight to make Darrow's forces seem vulnerable. The trick works and at night Apollo's forces try to raid Darrow's camp but Pax and others use axes to soften the bordering frozen river which the Apollo kids fall into and get taken out of the game by medBots. Pax would also raise the Ceres banner high to bait any bands of Apollo cavalrymen searching for glory, which worked. Darrow would then release these bands to spread fear and rumors of the Reaper. Later, Pax tells Darrow about his childhood and his love for Helga. Pax also finally gets a cloak when Darrow survives the bloodback and returns with its pelt. After Tactus prompts Darrow to spill the truth about the Proctors to Pax and the rest of his closest allies, Pax is then given command of his own unit in Darrow's army. Pax becomes the ring leader of spreading the legend of the Reaper, especially around the campfire. Pax also defends Darrow from Proctor Apollo. Pax leads the charge",
    "section": "Red Rising",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "against House Apollo with his war axe, and boosts Darrow into Novas' bodyguards. During the battle, Pax is knocked down by the pulseSpear given to Novas by the Proctors. When the battle's over, one Apollo girl gets on a horse and tries to escape with the standard. Pax hurls a spear at her and it would've hit if a Proctor hadn't pushed the spear aside. Yet the girl is captured, Apollo is defeated, and Pax starts the booming chant of the Reaper which indicates in the story that the Proctors are now the enemy. During the march in the blizzard towards House Jupiter, Pax stands next to Darrow and Mustang to block them from the wind. During the siege of House Jupiter, Pax's division gets into a friendly competition with Milia and Nyla's divisions to see who can take the castle the fastest. Pax cuts notches along his huge axe for each slave he has taken. After House Jupiter is taken and food is given out, Pax begins booming about Helga again and no one can keep a straight face. Darrow knows the Proctors expected House Jupiter to be taken. Therefore, Darrow has Pax play along to a showing of power in front of the Jupitereans by bringing out \"wine\" and ordering Pax to go patrol out in the rain. However the wine is grapejuice and Pax searches for hidden Pluto troops in the castle, which he finds fifty of in the well. Pax returns and takes turn with Sevro mocking the now revealed Jackal. While the Jackal saws off his own hand which is stabbed to a table, Darrow orders Pax to hold down the knife that's stabbed in the Jackal's hand. However, once bone is reached, out of disgust, Pax hands the Jackal an ionBlade to make it easier to saw. That's when the Proctors unleash a small sonic detonator into the room. The Jackal lashes upward with the blade into Pax's throat. The detonator knocks everyone down in the room. The Jackal gets up and lunges at Darrow but Pax staggers to his feet, blood dripping from his ears and throat, and launches himself forward, not onto the Jackal, but onto Darrow. Pax's final show of loyalty to Darrow happens when the Jackal tries to kill Darrow, but Pax prevents it from happening by using his body as a shield against the Jackal's blade. He was stabbed",
    "section": "Red Rising",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "eleven times by the Jackal.",
    "section": "Red Rising",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro and Pax step on each other toes by trying to be closest to Darrow. While Pax would tuck Darrow into bed, Sevro would tell Darrow to pick his own ass. After the Jackal is unmasked, Sevro asks Pax if he's taken bigger shits than the Jackal. Pax responds that he has, and more colorful ones too.",
    "section": "Sevro au Barca",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Pax-au-telemanus-by-justin-wong.jpg Pax and Daxo.jpg PaxDeath.jpg Pax au telemanus comic.jpg Kaitexas pax.PNG Pax cleodyart.jpg Pax-au-telemanus-gorydamnreaper.jpg Pax mightythepen.jpg Pax smile thegorydamnreaper.jpg Pax superpaulywantacracker2.jpg Pax and tactus before ceres siege chibimiau.jpg Pax kleeklutch.jpg Pax.jpg",
    "section": "Gallery",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"Freeeeeedom!\" - Red Rising, Ch. 35: Oathbreakers * \"It was dandy fine carnage, I tell you. Dandy fine. Helga would have loved it.\" - Red Rising, Ch. 40: Paradigm",
    "section": "Quotes",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Pax was originally planned to have a much larger role in the books; he would have been best friends with Ragnar, married Evey, and had the first publicly intercolor child. *Pierce did not know who Adrius should kill in Chapter 41 of Red Rising, so he wrote down the names of all the characters that would appear in the chapter on paper (aside from Darrow or Virginia), put them in a hat and drew one out. Pax was drawn first and subsequently killed off. Pierce still keeps the hat in his possession, and uses it again in later books. *Pax's name may have come from the Latin word for peace.",
    "section": "Trivia",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Pax au Telemanushu:Pax au Telemanus Category:Males Category:Golds Category:Red Rising Characters Category:Characters Category:Deceased",
    "section": "References",
    "name": "Pax",
    "type": "characters",
    "series": "Red Rising"
  }
]