[
  {
    "text": "Pebble is a Gold of Mars and one of the original Howlers. Named by Cassius for her small size before the Passage at The Institute. She was one of the lowDrafts (dregs) of House Mars.",
    "section": "General",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Pebble is drafted into House Mars when she arrived at The Institute in December 737 PCE. As a lowDraft, she is chosen because she is expected to be easy to kill in The Passage. After the Passage, she is considered one of the dregs of her schoolHouse. When House Mars divides into four tribes within the first few days of the game, Pebble is one of the original members of Darrow and Cassius' tribe. Whenever a goat or sheep was slaughtered, Pebble would leave food at the walls of Castle Mars and watch like a child as wolves would come in fours or threes to eat what she had put out. In the Institute under Sevro's command, and with Thistle, Screwface, Clown, and Weed, she becomes one of the original six Howlers. Thus helping Darrow stay in power as the other students began to fear the Howlers. Pebble, along with Mustang and Thistle, are the ones who chase down the last Apollo girl who tries to escape with the Apollo standard. After Olympus is taken, Darrow and the Howlers return to House Mars, where Clown and Pebble are ordered to enslave the besieging Jupiter, Apollo, and Pluto students.",
    "section": "Red Rising",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After graduating from The Institute, Pebble and the Howlers are reassigned to Pluto thanks to the machinations of Pliny au Velocitor, but are eventually summoned to Luna by Virginia in late 741 PCE so that they can be on standby to protect Darrow and House Augustus during the January 742 Summit. After the Gala Massacre, Virginia gives them Lysander au Lune before sending them to rescue Darrow and the rest of the House Augustus retinue.",
    "section": "Golden Son",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "During the Solar War, Pebble married Clown and had two children with him. She and her husband accompany Darrow on his mission to assassinate the Ash Lord, but return to Luna with Sevro after they receive word of Pax and Electra's kidnapping.",
    "section": "Iron Gold",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After the Day of Red Doves, Pebble is captured by the Abomination and Lilath.",
    "section": "Dark Age",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Howlers.jpg Morgondagar comic2.png Howler cafeteria sevro sleep pebble look on keeklutch.jpg",
    "section": "Gallery",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Guijarro hu:Kavics Category:Golds Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Iron Gold Characters Category:Dark Age Characters Category:Characters Category:Howlers",
    "section": "References",
    "name": "Pebble",
    "type": "characters",
    "series": "Red Rising"
  }
]