[
  {
    "text": "Priam au Caan was a Gold introduced during Darrow's time at The Institute. As the son of Priscilla au Caan, owner of both Martian moons and banner-woman of House Bellona, he qualified as a Premier at The Institute, allowing him to bypass the Draft directly into House Mars. This privilege did not save him from The Passage, where he was killed by Sevro au Barca, who stomped on his trachea until it collapsed.",
    "section": "General",
    "name": "Priam",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was an extremely skilled duelist, and gained the title of First Sword in his class prior to his acceptance at The Institute. He had a dozen tutors, and studied judiciously. Due to his status as a Premier, he was a highDraft at The Institute. He was also of House Caan, a prestigious House in the Society with roots in the Conquering.",
    "section": "Background",
    "name": "Priam",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He has refined mannerisms, speaking exclusively in highLingo and was speculated to have never sworn. He was arrogant and naïve due to his pampered upbringing, and ambitiously pursued leadership. The structure with which his academic and military pursuits were presented to him poorly prepared him for a fight so dogged as The Passage. Uncharacteristic of other Golds, he revealed a degree of respect for the lowDrafts: He expressed doubts that the tests could truly assess intelligence at all, and said that even if they could, the most gifted individuals would still need to rely upon the less gifted to succeed. Darrow thought him to be a decent person.",
    "section": "Personality",
    "name": "Priam",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was said to have the perfect appearance: beautiful, strong, and fast, with a build of Darrow's height but of slightly greater breadth.",
    "section": "Appearance",
    "name": "Priam",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* In Ancient Greece, Priam was the king of Troy, father of Hector, Cassandra, and Paris. es:Príamo au Caan hu:Priamus au Caan Category:Characters Category:Males Category:Red Rising Characters Category:Deceased",
    "section": "TriviaCategory:Golds",
    "name": "Priam",
    "type": "characters",
    "series": "Red Rising"
  }
]