[
  {
    "text": "Proctor Jupiter was an unnamed Gold man who was the Proctor of House Jupiter at The Institute of Mars between 737 and 738 PCE.",
    "section": "General",
    "name": "Proctor Jupiter",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Proctor Jupiter is described as a sinful, hedonistic beast of a man with an arrogant streak a kilometer long.",
    "section": "Personality",
    "name": "Proctor Jupiter",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Proctor Jupiter was a large Peerless Scarred, around 7’6 (2.3 metres) tall with hair like a lion.",
    "section": "Appearance",
    "name": "Proctor Jupiter",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Along with Proctor Apollo, Proctor Jupiter was one of the ringleaders of the Proctors attempt to rig the Institute in favour of Adrius au Augustus. He dueled Darrow during his taking of Olympus, but was defeated when Sevro Barca cut his hamstrings.",
    "section": "Red Rising",
    "name": "Proctor Jupiter",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At some point in 741 PCE, Proctor Jupiter competed with Fitchner au Barca and Apollonius au Valii-Rath for the title of Rage Knight after Lorn au Arcos retired. When the Martian Civil War began, he sided with House Augustus, and spent the majority of the conflict serving as an emissary to Augustus loyalists still on Mars on behalf of Virginia au Augustus. He then fell with Darrow's squad during the Lion's Rain, where he was killed during the infiltration of Agea.",
    "section": "Golden Son",
    "name": "Proctor Jupiter",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Category:Characters Category:Males Category:Golds Category:Deceased Category:Red Rising Characters Category:Golden Son Characters es:Próctor Júpiter hu:Jupiter Háza#Jupiter_Proktora_az_542._osztályban",
    "section": "References",
    "name": "Proctor Jupiter",
    "type": "characters",
    "series": "Red Rising"
  }
]