[
  {
    "text": "Quinn was a Praetor and a loyal follower of Darrow. She was Darrow's classmate in House Mars and becomes one of his advisors at The Institute. Darrow finds her to be one the fastest runners he's ever met.",
    "section": "General",
    "name": "Quinn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Quinn was dark skinned, her family having African ancestry. She is described as having long, thick legs and was one of the fastest runners in House Mars. Quinn is said to have an attractive appearance. She's also described of being loyal and being a good story teller. One of her ears was cut off during her time in The Institute.",
    "section": "Appearance",
    "name": "Quinn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Quinn is chosen as a midDraft into House Mars. During The Institute, she and Cassius were romantically involved. She would play with his hair and laugh at his jokes. Darrow admires and first grows warm to her when she tells the story about how she killed a deer then shows hair between her teeth and gums and bitemarks on the deer, but she laughs too hard to stay committed with the lie. Of all House Mars, Sevro is sweet only to Quinn, delivering edible meats and mushrooms to her, even though she's sweet on Cassius. Quinn snorts at Darrow's plan to get more troops which involves her running to Deimos Tower in which she'll bring a formal apology to Antonia then return at dusk to Darrow with Antonia's response. However, Quinn is captured on her way back by Titus's men. They beat her, and Titus sends Darrow one of Quinn's ears, thinking Quinn is Darrow's girl. Cassius reacts by sneaking off during the night to confront Titus but is beaten to ruin and pissed on, he's then tied up but secretly freed by Pollux. Quinn is freed after House Minerva defeats Titus then Darrow's surprise attack plan works to take back Castle Mars. She cries while witnessing Cassius mercilessly take revenge on Titus. When Darrow announces only he and Sevro will go to House Diana while Cassius stays in House Mars, Quinn calms Cassius down and helps his ego from being hurt. Quinn stays as a garrison look out at House Mars during the assault on House Minerva. Quinn, with a raised eyebrow, delivers the strange House Pluto emissary, Lilath, to Darrow and Cassius. After Lea's death she advises Darrow to not get distracted by the Jackal. Quinn dislikes Cassius' insulting of Sevro and endures the hardships during Darrow's banishment and Cassius' time as Primus. At some point during this time, Quinn leaves Cassius for Roque. After Darrow takes Olympus and returns to House Mars, he's relieved to find Roque and Quinn are still alive and they embrace. Darrow also learns from Pollux that Roque and Quinn were the ones who kept House Mars together while Cassius, although Primus, had given up a while ago.",
    "section": "Red Rising",
    "name": "Quinn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Now part of the Howlers, she helped in rescuing Darrow from the Sovereign's hold on him and kidnapping Lysander, but was punched severely in the head three times by Aja during the effort. Her death caused Roque's grief and planted the seed of doubt in him with regards to Darrow's leadership, which subsequently led him to betray Darrow and denounce his cause.",
    "section": "Golden Son",
    "name": "Quinn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "During a negotiation discussion to ally with Romulus au Raa with either Darrow and the Rising versus Roque and the Society, Darrow reveals that the Jackal bragged about being responsible for Quinn's death. Had Adrius left her alone when she was injured, she would have lived. The Jackal admits it himself that he pushed a sliver of Quinn's skull further into her brain, killing her.",
    "section": "Morning Star",
    "name": "Quinn",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Quinn-by-mightythepen-082920.jpg Quinn-by-igor-kieryluk.jpg Quinn-infobox-igor-kieryluk.jpg Quinn scillavega.PNG Quinn acemanonthescene.jpg Quinn-by-angela-tubbs.jpg Howlers bixelboon.jpg Quinn mbenskydesigns.PNG es:Quinn hu:Quinn Category:Females Category:Golds Category:Characters Category:Deceased Category:Red Rising Characters Category:Golden Son Characters",
    "section": "Gallery",
    "name": "Quinn",
    "type": "characters",
    "series": "Red Rising"
  }
]