[
  {
    "text": "Roque au Fabii, also known as the Poet of Deimos, is a Gold, and the Imperator of the Sword Armada directly under the command of The Sovereign, as of Morning Star. He is a Peerless Scarred, and was one of Darrow O'Lykos's best friends during their time in The Institute on Mars and in The Academy, but subsequently lost faith in Darrow and his cause, and betrayed him to Adrius au Augustus. He was romantically acquainted with Quinn.",
    "section": "General",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Instead of adhering to the dataDrops that stand for the schooling that most young Golds get, Roque was raised in more organic settings by talking with mentors and teachers on Earth, walking beside lakes and so on. He is a quiet and creative individual, with an affinity for literature and nature.",
    "section": "Background",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Roque is calm and is known for his quiet nature and composure even in intense situations. As a poet, he is fond of using poetry to get across particular ideas and pieces of advice. Roque is mostly fairly gentle, not one for outbursts of temper. However, when sufficiently angered, Roque is a skilled liar and is more than willing to use extreme prejudice to defeat an enemy. Roque is also said to have a deep anger hidden underneath his quiet and thoughtful nature. It's this rage that got him put in House Mars. He can be a loyal friend to those he cares for, forging bonds of brotherhood with Cassius and Darrow. However, Roque's outward compassion and calm demeanor hides his firm, rigid beliefs in the notions of the supremacy of the Golds in the Society. While not outwardly cruel to the lowColors, he has little sympathy for them as well, and believes that Golds have a right to be above others. His notion of superiority of the Gold race ultimately causes his undoing. As a romantic, Roque loves deeply, and develops intense feelings for Lea, Quinn, and even for his Pink lover. Thus, he is heartbroken by their deaths and betrayal. Roque's analytical skills and thoughtful nature allow him to become an excellent ship commander. Roque's tactical brilliance in space is nearly unmatched by any other character. Darrow is only able to best Roque by usage of surprise unseen before tactics. Roque is described by Darrow at one point as what a Gold should be. Uninhibited by greed, lust or cruelty, Roque is at his core what Golds were meant to be. Roque has sympathy and understanding for the lowColors, but at the same time is willing to rule with iron and without mercy. Roque's choice to take his own life rather then be captured on the bridge of his captured warship reflect his commitment to the Golds' rigid system of honor.",
    "section": "Personality",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Roque was leaner and shorter than the typical Aureate, described as having high cheekbones and hair the color of wheat.",
    "section": "Appearance",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Red Rising= One of Darrow's most trusted lieutenants and closest friends. Serves as a voice of reason between Cassius au Bellona and Darrow. |-|Golden Son= After being \"Shamed\" for his less-than-admirable performance at The Institute, Roque joins Darrow in becoming a lancer to House Augustus, and gains important experience in astral warfare. He was romantically involved with Quinn, who gave him comfort after the death of Lea, his previous love interest. His confidence in Darrow begins to waver when the latter disregards his safety and drugs him during the attack on House Bellona, and it falls after Darrow's failures in keeping his men alive - particularly Quinn at the hands of Aja au Grimmus. After the Lion's Rain, he was hailed as the 'Nelson incarnate' for capturing over 80% of the Bellona fleet. He publicly betrays Darrow to The Jackal during Darrow's Triumph and exposes Darrow's Red identity and true motivations, thus sealing Darrow's fate. |-|Morning Star= 12 months after betraying Darrow to the Sovereign, Roque has become one of the Sovereign's lead Imperators and is in control of the massive Sword Armada, and its flagship, The Colossus. Several months after Darrow's rescue and the insurrection on Phobos, Roque is sent to meet with the Moon Lords about aiding the Sovereign to stop the Rising. The meeting is also attended by Darrow and Virginia au Augustus. The Moon Lords have many ships stored on the Dockyards of Ganymede, and both sides seek their aid - which could shift the war in either side's favor. Both sides know this, and pull out all the cards to convince the Moon Lords to join their respective sides. Ultimately, Roque The Poet loses this battle of words, after Virginia reveals the existence of several planet-killing warheads - the same kind the Ash Lord used to obliterate Rhea. After words fail, Roque turns to war. He prepares his fleet to meet Darrow and the rest of the Rising. Roque goes into this battle prepared but also very confident. Darrow has less ships, and is, in Roque's mind, the inferior commander. Although this is easy to label as hubris, Roque has little reason to be afraid. Using the many unique talents and skill sets of the many Colors, Darrow tricks Roque into getting close to Darrow's flagship and boarding it, giving Roque the assumption he has won. Darrow was intentionally sacrificing the Pax, and had hidden",
    "section": "Involvement",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "hundreds of modified clawDrills that he and his soldiers used to board Roque's ship. When Darrow and his crew reach the bridge, Roque is betrayed by his Pink paramour who unlocks the bridge door. Roque is left at the mercy of Darrow and his allies. Adhering to classic Gold honor, Roque takes his own life on his bridge, rather then be taken prisoner or kneeling to Darrow. Roque is honored in the traditional Gold way of sundeath by Darrow - former friends of the poet deliver benedictions, and the corpse is shot into the sun.",
    "section": "Involvement",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In Red Rising, Roque was good friends with Darrow at The Institute, giving him good advice and remaining loyal to him through their numerous experiences. He weeps upon being reunited with him. After leaving The Institute, Roque joins Darrow at The Academy. In Golden Son, Roque is a trusted liutenant of Darrow at the Academy - however, after Darrow drugs him before The Gala Massacre and Quinn is killed by Aja au Grimmus, their relationship undergoes a massive rift. Roque loses faith in Darrow, believing him to not care for his friends and to hide his true intentions. He betrays Darrow after discovering him to be a Red, and condemns him to captivity and torture. In Morning Star, they are enemies, on the opposite sides of the war, with Roque fighting for The Society and Darrow for The Rising. While Darrow mourns the loss of their friendship, they make war with one another, ending in Roque's defeat at Darrow's hands, and his eventual suicide.",
    "section": "Darrow",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Roque and Quinn both attended the Institute together and were part of House Mars. After their time there, they began a romantic relationship. Quinn is killed after the Gala Massacre by Aja, which Roque blames Darrow for. Her death is the catalyst of Roque's loss of faith and betrayal of Darrow.",
    "section": "Quinn",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Lea used to follow Roque everywhere. On the day of her death, Roque reveals to Darrow that he loved her. He is deeply hurt by her death, and regrets never having said anything.",
    "section": "Lea",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Roque-by-mightythepen-083020.jpg Roque-by-Mbenskydesigns-071020.jpg Roque-stand-justin-wong.jpg Roque-defeat-kai.jpg Roque-040116.jpg Roque-042416.jpg Tarot-roque-hierophant-111316.jpg Roque bepisaun.jpg Roque nightingale.jpg Roque lordbelatiel.png Roque-parisa poorpp.jpg Roque poet of deimos halarts.jpg Mayaaustin Roque.png Roque niktropolis.PNG Roque and darrow first meet wheredaydreamersgo.png Roque pbdoodles.PNG Roque laurelcrown moonmagister.PNG Kaitexas roque.PNG",
    "section": "Gallery",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Roque Dalton Garcia was an influential poet that was murdered.",
    "section": "Trivia",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"We are Golds. We do not forget.\" - Red Rising, Ch. 28: My Brother * \"Blood begets blood begets blood begets blood.\" - Red Rising, Ch. 24: Titus's War * O dark dark dark, when did it become just us? Just you and me? * \"There is no greater plague to the introvert than the extroverted.\" * ''\"Home isn't where you're from. It is where you find light when all grows dark\" - Golden Son, Ch. 10: Broken * \"Not all men can understand metaphor and subtlety like I. But do not fear, my muscular friends, I will be here to guide you through the mind-bending things.\" - Red Rising, Ch. 22: The Tribes * \"And violent hearts set harshest flame\" - ''Red Rising, Ch. 24: Titus's War * ''\"Slag that. I'm here for the food.\" - Red Rising, Ch. 28: My Brother * \"I am a master with metaphor and a rogue with assonance.\" - Red Rising, Ch. 32: Antonia *\"Only bold takes Olympus.\" - Golden Son, Ch. 38: The Iron Rain *\"And thus go liars, with a bloodydamn kiss.\" - Golden Son, Ch. 51 *\"If you are thrown into the deep and do not swim, you will drown. So keep swimming, right?\" - Red Rising, Ch. 20 *\"Friendships take minutes to make, moments to break, years to repair.\"'' - Golden Son, Ch. 44 es:Roque au Fabii hu:Roque au Fabii Category:Golds Category:Characters Category:Males Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Deceased",
    "section": "Quotes",
    "name": "Roque",
    "type": "characters",
    "series": "Red Rising"
  }
]