[
  {
    "text": "Horatius au Savag, better known by his nickname Screwface, was a lowDraft of House Mars during Darrow's year at The Institute and one of the original Howlers.",
    "section": "General",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Screwface is chronically insecure, and has deep self-worth issues. Due to bullying in his youth, he internalized the idea that he needed to be taller, more handsome, and more sophisticated in order to be worthy of love and respect. Even among his friends, Screwface often worries that they only see him as a hanger-on. As a result of his insecurities, Screwface has body image issues, and did not feel comfortable in his own skin for most of his life until he was carved by Mickey during the Solar War. Screwface enjoys reading and is known to love a good joke.",
    "section": "Personality",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In the original trilogy, Screwface is described as ugly, and was given his nickname by Cassius au Bellona before The Passage due to his physical appearance. After being carved during the Solar War, his appearance is described as broad-shouldered, ruggedly Roman in the face, and with a chin \"almost as fine and just a little larger than Cassius’s\". During the Long Night, he was scalped and lost a leg.",
    "section": "Appearance",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was part of Darrow's tribe before joining the rest of the lowDrafts under Sevro au Barca's command. While part of Darrow's tribe, he tried his best to freeload, but was not allowed to do so. After acquiring his black wolf cloak, he becomes one of the original Howlers, along with Sevro, Thistle, Clown, Pebble and Weed.",
    "section": "Red Rising",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "When Sevro takes command of the Sons of Ares following the death of his father, Screwface joins alongside Clown and Pebble.",
    "section": "Morning Star",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At some point during the Solar War, Screwface taught Freihild how to play Karachi and other card games.At the beginning of the Solar Republic's siege of Mercury, Mickey carved him a new appearance so that he could be planted among the Society Remnant's legions as a deep-cover mole. To maintain operational security only Darrow, Mustang, and Theodora were aware of his mission.Screwface was initially delighted to be chosen for the mission, and was happy to be carved for the assignment as it finally allowed him to feel at home in his own skin.",
    "section": "The Solar War",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Screwface describes his family as \"full of Pixies\", suggesting that he doesn't have a good relationship with them.",
    "section": "House Savag",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Screwface and Virginia appear to be very good friends, as she considers him her favorite of the original Howlers.",
    "section": "Virginia au Augustus",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Screwface dark age wheredaydreamersgo.png Howlers ocny.PNG Howlers.jpg",
    "section": "Gallery",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Muecas hu:Ravaszpofa Category:Golds Category:Characters Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Males Category:Dark Age Characters Category:Howlers Category:Light Bringer Characters",
    "section": "Notes and References",
    "name": "Screwface",
    "type": "characters",
    "series": "Red Rising"
  }
]