[
  {
    "text": "Sevro is the child of a Gold and a Red, as well as one of the main characters of the Red Rising Trilogy and the Iron Gold Trilogy. Throughout the course of the books, Sevro is one of Darrow's most loyal followers, best friends, and is leader of the Howlers.",
    "section": "General",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro is indifferent to others that he does not know, but is very loyal to certain people. He is also cunning as exhibited during the time at the Institute when he takes the other houses by surprise. Sevro was probably considered to be a scrapper throughout the series, especially in the first book. He is also said to be cold and have a distinct cruel side to him, which is seen early in Morning Star, particularly with Sevro's callous treatment of his enemies. Sevro, however, is ultimately a good person and overcomes his darker side. He has a quick wit and a crude sense of humor which he is not at all shy about. Sevro has a sensitive side which sometimes results in him overreacting. He values loyalty above all else.",
    "section": "Personality",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro is short for a Gold, standing at about 5'9\", a possible result of his half-Red heritage. He has thin lips, a hook nose and a generally unattractive face. He inherited his mother's cheekbones, as well as the shape of his eyes and mouth. In the Institute, his fingernails were sharp enough to kill animals with.As the first Howler, he began wearing a wolfskin in The Institute.He lost one eye while confronting The Jackal. By the time of Golden Son, his hair is shaved to resemble dragons, By Dark Age, he has a short warhawk with a zigzag running down the centre and a goatee. This is his signature look. Sevro is notorious for his poor hygiene, often bragging about the time since his last shower.He even claims to have worn his signature wolfcloak in battle for more than a decade without washing it. As a Peerless Scarred, he possesses the characteristic wound across his cheekbone. According to Darrow, he has abnormally long toenails, which he uses to hang off of ledges. As leader of the Howlers, he also has a large wolf tattoo across his back. He later gets a goatee in an obvious attempt to woo Victra, resulting in Darrow teasing him. He was given a skull tattoo on his right hand by Ragnar to symbolize them being blood brothers, the same is on Ragnar himself and Darrow. In Golden Son, Darrow describes him as 'the ugliest angel ever shit out of heaven'.",
    "section": "Appearance",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Due to his small stature, Sevro is agile even for a Gold. While at the Institute, he was one of the few lowDrafts that could keep pace with (and even outrun) the highDrafts. He is extremely stealthy, often hiding in order to catch his opponents off guard. Even the monstrous Titus au Ladros and his followers feared to attack Darrow as Sevro would kill them in their sleep. He is an excellent survivalist and scout, successfully evading the other factions of House Mars during his time at the Institute. At the same time, Sevro proved resourceful, surviving alone in the valley for extended periods of time. He even found out the location of the other Houses on his own, succeeding where even Darrow and Cassius failed. Sevro is an excellent hand to hand fighter, capable of defeating opponents of superior physical capability. Through skill and observation, he can defeat Golds of the highest stock such as Priam au Caan. He even obtained his wolf cloak by killing a wolf barehanded, using his fingernails to wound it during the battle. Sevro has proven himself to be a skilled tactician and leader, organizing the underestimated lowDregs into the vicious and feared Howlers. Deceptive and sneaky, he specializes in infiltration and sabotage. Sevro is capable of sowing chaos and deceiving his foes regardless of their strength. At one point, he and the Howlers even kidnapped Lysander, heir to Sovereign Octavia au Lune, from inside the Sovereign's Citadel. Sevro also led the Sons of Ares after the death of his father, personally planting spies in the Jackal's forces and rescuing Darrow from a mountain fortress.",
    "section": "Skills and Abilities",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro was born to Fitchner au Barca and his Red wife, Bryn of Cryssos. In order to give birth to a Gold child, Bryn underwent illegal biological modification. This act was later discovered by the Society's bureaucracy, leading to Bryn's death by achlys-9, a poisonous gas. For his heritage, Sevro was labeled a Bronzie (the genetically inferior members of the Gold caste) and was mistreated for much of his early life. In secret, Fitchner began a rebellion against the The Society known as the Sons of Ares, taking up the mantle of Ares. This left Sevro without any parents, forcing him to fend for himself. As a result, Sevro developed into a skilled survivalist at a young age.",
    "section": "A Different Breed",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Like many other Golds, Sevro took a test to enter the Institute, a training school for potential military officers in Gold society. Despite his low score, he was accepted and was the last person drafted into House Mars by Fitchner, who had become Mars' Proctor. The first trial was the Passage: a series of death matches among the students to obtain their House rings and determine who would remain at the Institute. For his trial, Sevro was paired with Priam au Caan, an excellent student and swordsman. Due to his abysmal test performance and small stature, he was intended as a sacrifice for Priam's ascension. Sevro, however, defied the odds and killed Priam by crushing his trachea. The students were later dropped into a valley with limited resources and forced to conquer one another through armed conflict. Different factions developed within House Mars, forcing the students to choose sides in order to survive. Unlike the others, Sevro swore allegiance to none and acted on his own. Earning a frightening reputation for his sudden disappearances and savage nature, Sevro was regarded with extreme caution by many. Fear of him grew even more when it was discovered that he had killed a wolf with his bare hands, wearing its skin as a trophy and earning the nickname \"Goblin\".",
    "section": "Entering the Institute",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "As the game went on, one faction within House Mars became extremely violent. Led by Titus au Ladros, they began terrorizing members of their own House. However, another Gold named Darrow au Andromedus (secretly a Red spy biologically remade into a Gold) had gathered a group of students under his leadership. Composed mainly of lowDrafts, they intended to take control of the House by defeating Titus. Stalking Darrow and his followers, Sevro saved him and another Gold, Cassius au Bellona, after they were almost captured by House Minerva. He then began aiding Darrow's faction, surprising them with his skills in the wilderness and scouting the locations of the other Houses. After some time, Sevro took control of the lowDrafts, helping them kill wolves to create their own cloaks. Known as the Howlers, they helped Darrow defeat Titus and House Minerva. With Darrow as Primus, Sevro and the Howlers acted as his bodyguards as they consolidated control over the other factions. Darrow then informed them about the existence of the Jackal, the Primus of the feared House Pluto. Sevro proposed that he and the Howlers assassinate the Jackal, securing Mars' position in the competition. However, this proposal was rejected, leading to a rift between Darrow and Sevro. Regardless, Sevro went through with his plan and left the House Mars fortress behind.",
    "section": "The Howlers",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro and the Howlers were able to find the fortress of House Pluto, nestled deep within a mountainous area of the valley. Despite successfully infiltrating the stronghold, they were discovered and forced to fight their way to freedom. Sevro was wounded in the escape, losing his eye to the Jackal's knife in the darkness of the citadel. Leaping from a cliff, he and his allies made their way back to House Mars. Upon arriving, they discovered that Cassius had betrayed Darrow, taking up the title of Primus after leaving his former friend for dead in the forest. Some time after, a large sickle was seen burned into the side of a hill during the evening. Sevro then realized that Darrow was alive, with the shape resembling Darrow's personal weapon: a slingBlade. Abandoning House Mars, Sevro led the Howlers in tracking down Darrow. They also engaged House Apollo during their search, causing Sevro to become known as a \"one-eyed demon\" among the other Houses. Ultimately, they found Darrow (who had been styling himself as the \"Reaper\") and began to fight alongside him. Sevro continued to lead the Howlers, defeating numerous Houses to gather enough resources to face the Jackal.",
    "section": "Goblin and Reaper",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After some time, they were able to capture the Jackal, who had disguised himself as a student of House Jupiter. With his hand nailed to a table with a knife, Sevro and the Howlers watched as the Jackal sawed off his own hand. However, the Proctors interfered, having aided the Jackal numerous times throughout the game. In the ensuing struggle, Pax au Telemanus, a fellow Howler, was killed by the Jackal. Enraged, Sevro himself led the hunt for their foe, relentlessly tracking him through snow-covered terrain. They eventually realized that the Jackal had been spirited away to a cave by one of the Proctors. Angered by the death of their friend, Sevro and his allies stormed the fortress. Led by Darrow, they were able to subdue the corrupt instructors. Afterwards, Sevro reunited with Darrow and the rest of their allies. With the Jackal having escaped once more, Mustang decided to pursue him with a portion of their army. While she was away, Sevro was given the task of editing the footage captured by the Proctors to display the rigging of the competition. While editing the footage, Darrow suddenly curses using Red slang in front of Sevro, causing to Sevro to quietly develop doubts about Darrow's background. However, Sevro was pulled away from his duties when it was revealed that Mustang was the Jackal's twin sister. Anticipating her return, Sevro joined the Howlers to prepare for another battle. When she returned, Mustang instead brought the Jackal back as a captive, securing victory for their army.",
    "section": "Among Wolves",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Despite their exemplary performance at the Institute, Sevro and the other Howlers did not receive any sponsorships from high ranking Golds due to their status as Bronzes. Instead, they were sent off to monitor projects on far off planets. Sevro went to Triton, regularly communicating with Darrow and Roque, another friend from the Institute. During his time there, Sevro was approached by Dancer, who sought to recruit Sevro to the Sons of Ares. Dancer then revealed Darrow's status as a carved Red, confirming Sevro's suspicions. Sevro agreed to join the Sons, feeling the same dissatisfaction with Gold rule like the lowColors. Acting both as Darrow's bodyguard and an agent undertaking high risk missions, he remained inactive until Mustang contacted him and the Howlers. With the Summit of the great families on Luna nearing, she decided to use the opportunity to undermine Sovereign Octavia au Lune with the help of Sevro and the Howlers.",
    "section": "Lone Wolf",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The night of the Summit, Darrow and other members of House Augustus were held captive by the Sovereign after Darrow challenged and humiliated/mutilated Cassius in a duel. Mustang finally contacted the Howlers as part of her plan to escape Luna with the rest of her House. Sevro and the Howlers then infiltrated the Sovereign's Citadel and kidnapped her grandson, Lysander, to use as barter for safe passage from Luna. Afterwards, they freed Darrow from his room and fought their way to the rest of House Augustus. He joins Darrow in the Iron Rain on Mars, fighting through to the capital. After the battle, he joins the meeting with his father, Dancer and Darrow as they discuss the next step for the Sons of Ares.",
    "section": "Reuniting the Pack",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro assumes the identity of Ares after his father Fitchner has been killed at the end of Golden Son. Using haemanthus he fakes his death at the hands of Cassius who has secretly flipped allegiances to overthrow the Sovereign. Upon being resurrected, Sevro helps turn the tables to help kill Aja au Grimmus, rescuing Cassius, Darrow, and Mustang from near-certain death.",
    "section": "Morning Star",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro joins Darrow in his flight from the republic to assassinate the Ash Lord. Upon realizing the hollowness of the victory, he leaves Darrow to return to Luna and his family.",
    "section": "Iron Gold",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Some time after returning from Venus, Sevro and Victra received a ransom demand for Pax and Electra from Sefi who had manage to aquire them after their escape from the Syndicate. In exchange for ships and aid in stealing Quicksilver's helium mines, Sefi would return Pax and Electra to them. While Victra headed to Mars to pay the ransom, Sevro and the Howlers with him began to systematically hunt down, torture and kill members of the Syndicate as recompense for kidnapping his daughter and godson. He's convinced by Victra to leave Mustang out of the loop regarding Pax and Electra's current location with Sefi, believing she's too wrapped up as the Sovereign and would try to stop them from getting them back. Sevro returned to Luna and began his private war against the Syndicate and its Queen outside the law. Mustang inevitably deduces the children's location on Mars with Sefi as Victra wouldn't go there unless Pax and Electra were there, and Sevro wouldn't attack the Syndicate if they still had them. Sevro became deeply conflicted with keeping secrets from Mustang, siding with Victra in the divide with Mustang, and felt ashamed in keeping Pax's location a secret from his mother. As he is about to interrogate the Duke of Hands, he lets Mustang figure out the whole situation without him having to share anything and turn his back on his wife. When Mustang makes it clear how much she knows and that she is far from being a toothless Politico, Sevro returns as Imperator of the Republic and begins to follow her again. Following the meeting with Dancer and Mustang where it's revealed Publius cu Caraval was behind the children's abduction, Sevro is sent by Mustang to the Syndicate Queen's location on Earth and eliminate her. Instead, Sevro and the Howlers are ambushed in a trap by Lilath and the Jackal's Boneriders, captured and brought back to Luna after the coup by the Vox Populi. Several Howlers, including Min-Min, are killed in a gruesome manner, while Sevro, Pebble and Clown remain Lilath's prisoners.",
    "section": "Dark Age",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After several months in captivity on Luna, Sevro was sold by The Syndicate via an auction hosted through the Ophion Guild. He was purchased by Apollonius, who transported him to the Venus Dockyards with the intent of using him as bait in order to lure Darrow out of hiding for a final duel. Before being shipped from Luna, the Abomination told Sevro to give Virginia his regards if he ever saw her again. Sevro was delivered to the Dockyards in August 754, where he escaped shortly thereafter. Knowing that Darrow would come for him when he saw Apollonius's broadcast, he remained on the station and waged a campaign of guerilla warfare against the Minotaur's forces while hiding in the air vents. In the course of his campaign, he killed several of Valii-Rath's allies, and took the ears of the Golds he killed as trophies, including Galerius au Voth, Tiberius, and Drusilla. Darrow and Cassius eventually arrived and were captured by Apollonius. Sevro set off a series of explosions to rescue them, and the trio escaped Venus together. After reuniting with Darrow, they and Cassius set out to find Quicksilver so they can use his fleet to combat the Society, only to discover that Quicksilver scrapped it all to build a getaway ship. Sevro, outraged and disgusted, wanted to kill Quicksilver, but Darrow disagreed and allowed him to leave. While departing, Sevro found a young stowaway named Lyria aboard their ship. After she tells him about the murder of Victra's newborn Ulysses, thinking that Sevro had already known about it, he descends into alcoholism and depression out of guilt for not being with his wife and his belief she would not want to see him again. He forces Lyria to keep Ulysses' death a secret and becomes increasingly hostile to the point where he tortures their prisoner Diomedes au Raa and gets into a fistfight with Cassius. Fed up his best friend's behavior, Darrow made Sevro confess his worries that Victra would despise him for not being with her when their son died, and he rebuffed Sevro's concerns by arguing how much trauma and pain they had given Cassius, and yet he still stood beside them as friends.",
    "section": "Light Bringer",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "As noted by Darrow in Red Rising, Sevro has a strange relationship with his father. It is his father that gives Sevro the moniker, Goblin, for his short size and nasty temperament. Both display no familial love when in each other's company and often take to calling each other names or using other insults. For instance, Sevro has no hesitation in laughing at his father's expense when Darrow informs him he knocked him out unconscious and stole his gravBoots. This dynamic between father and son may be the result of Fitchner's preoccupation with leading the Sons of Ares, which took time away from being a proper father to Sevro. For reasons unknown, Fitchner decided to trust his son with his identity as Ares in Golden Son and sent Dancer to him to tell of Darrow's Red background, believing his son would stay loyal to Darrow. Only a few days after the Iron Rain of Mars did his father tell Sevro of his own Red heritage through his mother, Bryn. After his father's death, Sevro took on Fitchner's mantle as Ares and leader of the Sons. Despite their strange father/son relationship, Sevro had a begrudging love for his father and vice versa. He took Fitchner's death hard, and when he became a father himself, Sevro wanted to make sure that he didn't repeat his own father's mistakes in focusing too much on war and fighting at the expense of being with his family.",
    "section": "Fitchner au Barca",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro had little interaction with Victra in Golden Son, referring to her only as \"the tall arrogant one.\" At the time, Victra had unrequited feelings for Darrow and neither she nor Sevro gave each other much attention. In Morning Star, after being rescued with Darrow from the Jackal, Sevro and Victra begin spending more time around each other. Both were alike in their martial mindset, their choice for fists over words, saying what they're thinking without filters, and stubbornness. Victra would eventually join Sevro as a Howler. After Victra makes a comment about their Red collaborator's goatee on Phobos, Sevro decides to grow one, which is noticed by Darrow with a wink. During their abduction of Quicksilver, Victra manages to save Sevro from being pulled out into a vacuum. After the Howlers recover from getting pulled into space with Quicksilver, Sevro is the one that tries to wake Victra by slapping her, which she returns when she wakes up. While Darrow went with Mustang and Ragnar to recruit the Martian Obsidians, Victra stayed behind with Sevro to help with the start of the rising on Phobos. While Sevro mourned Ragnar's death alone, it was Victra that joined him soon after Darrow. The two soon began a relationship thereafter. At Sevro's request, Victra joined Darrow on the Pax during the Battle of Ilium with Roque to keep his black little heart from breaking if Darrow fell in the fight. Before the battle, Sevro confessed his feelings for her, which made Victra call off their relationship. Victra had done so due to deep lingering self-doubt about her nature, believing she had \"poison in her veins\" and would just ruin everything. While Sevro always kept up a rough exterior to protect his softer side, Victra had always believed she had a more wicked dark part of her that she didn't want others to see. She nearly broke Antonia's face when she killed Thistle, but was stopped by Sevro when he puts her in a hold. It's only after Sevro nearly died while saving Cassius's life did Victra realize her love for him. Victra then proposed to Sevro, and they were married on the ship, with Victra taking Sevro's family name Barca despite the Julii name being the much more revered one in the Society. Following the Rising, Victra would give birth to three girls, while carrying a fourth. Both remain deeply in love",
    "section": "Victra au Julii",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "with each other. After his return from Mercury and reuniting with his girls, Sevro rushes to Victra when she arrives. They are alone for roughly 30 minutes before returning to the others with Sevro's Mohawk a mess, two jacket buttons missing, and his lip split, implying they had sex despite Victra being heavily pregnant. Mustang makes one comment that Sevro and Victra will be able to single-handedly populate Pluto in a few years at the pace they're going.",
    "section": "Victra au Julii",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro has three living children, all girls. The eldest is Electra au Barca and the middle child is Calypso. In Iron Gold, the youngest is referred to as Diana, however in Dark Age her name is Selene. Sevro dotes on Electra, affectionately referring to her as his \"wee monster\" or \"little harpy\", and Electra always has a smile on her face when with her father. Sevro personally attended the birth of Electra and his other daughters, even while serving in the Solar War against the Ash-Lord. After he learns of her abduction, his only thought becomes getting back to Luna and finding her, despite the fact that he is leaving behind Darrow, and his men on Mercury, to their probable deaths.",
    "section": "Electra au Barca",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Outside his family, Sevro's friendship with Darrow has been his most important relationship since they met at the Institute. Though they initially started in separate groups within House Mars, Sevro was always watching Darrow's, wanting to be a part of their company and help teach the lowGolds the outdoors. When Darrow and Cassius are cornered by Mustangs men in the lake, it's Sevro that comes to their aid. At the moment, Sevro begins to latch himself to Darrow and take instructions from him, saying that despite him being a Gold like Cassius, he was still like him [Sevro]. Sevro immediately became an asset to Darrow throughout the Institute, serving as his bodyguard, an ace in unconventional warfare, and as Darrow would call him later, his shadow. He is there to help defeat House Minerva, Diana, and later the Proctors on Olympus. When Darrow accidentally slips his identity to Apollo before killing him, Sevro went and deleted the cam footage where Darrow said \"bloodydamn\" without any questions or instructions simply because he felt it was important to Darrow to delete it. Darrow's true origins as a Red didn't bother Sevro at all, nor did the fact that Darrow was working to destroy the Society. As Sevro states, his fellow Golds had been trying to kill him since he was born, and the only one that ever treated him decently were lowColors like Darrow who didn't have a reason to. Sharing the weight Darrow was carrying as an operative of Ares solidified their bond, and Sevro became more than a friend. Sevro stated that it didn't really matter what he thought about helping Darrow, because it just felt right. The two became even closer when both learned Sevro was half-Red himself on his mother's side. When Darrow was believed to be dead, Sevro released the footage of his Carving to every holoSite and every part of the Society. Sevro's intention was to ensure the supposed death of his friend wasn't going to mean nothing and that he wouldn't just disappear like his mother. Despite what supposedly happened to Darrow, Sevro never believed he was actually dead. Darrow is also one of the very few who have seen Sevro past his rough exterior. After they briefly fight on Phobos, Sevro actually breaks down in tears from the burden he's been carrying as leader of the uprising and as Ares. He even puts his",
    "section": "'''Darrow O'Lykos'''",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "head on Darrow's knee, and doesn't flinch away when Darrow puts a hand on his head. Sevro decided to have Darrow's old Red eyes carved into his own, not only as a testament to his own Red lineage, but also the strength of his friendship with Darrow. He even tracked down Darrow's slingBlade from the Institute and stored it in his armory because of how that blade gave him something to follow and dedicate his life to until he started a family.",
    "section": "'''Darrow O'Lykos'''",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro and Mustang have a good rapport. They both worked together under Darrow during the Institute as his most reliable fighters. It was Mustang who first sent for Sevro and the other Howlers to come to Luna to aid Darrow, and help undermine the Sovereign. Once Sevro joins the Sons of Ares, his perception of Mustang begins to change. He continued to trust her as far as Darrow did, but when Darrow was ready to tell Mustang his Red identity, Sevro was fully prepared to kill Mustang if she refused to accept Darrow for what he was. When Darrow is supposedly executed, Sevro broke off relations with Mustang, thinking she had a part in betraying Darrow to the the Jackal and Octavia. Mustang had sent word to Sevro a few months about a peace conference with Cassius and Quicksilver but he refused to listen. Once Darrow takes command again of the uprising, Sevro follows his lead, including Darrow's choice to trust the alliance Mustang makes with the Rising against the Society. After this, their relationship returns to what it was during the Institute. After the Rising, Sevro serves the Republic as Imperator and Mustang the Sovereign, effectively making her his superior. While Sevro respects Mustang and maintains their friendship, he takes Darrow's side in becoming a fugitive for the sake of ending the war with the Ash Lord. When Pax and Electra were kidnapped, Sevro takes his revenge on the Syndicate outside the law, putting him at odds with Mustang. As Sevro closed on the Duke of Hands, who was in Mustang's custody, this directly put both of them in confrontation with each other. Underneath his revenge-spree, Sevro was actually conflicted with keeping information about Pax's location from his mother. Victra had convinced him that the Mustang he fought alongside with had been replaced by Virginia the Sovereign, and would try to stop their efforts to get the children back. In truth, Sevro had doubts about Victra's plan and wanted nothing more than to end the division between his wife and Mustang. Once Mustang makes it clear she has already deduced that Pax and Electra are with Sefi, and what Victra is doing, Sevro is relieved from the choice of having to choose between siding with his wife and telling his friend what is happening. He falls in line with Mustang and returns to his Sovereign as the Republic's Imperator.",
    "section": "Virginia au Augustus",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro had a close friendship with Ragnar almost to the level he had with Darrow, and mourned at the side of his body following his death at Aja's hands. The duo first met when Ragnar makes Darrow an offering of stains, and is almost terrified of the Obsidian based on his size and witnessing his raw strength during the capture of the Pax. They both fought alongside each other through the Iron Rain of Mars, often standing right behind Darrow. and were the only two outside the Sons of Ares who were aware of Darrow's Red identity. Sevro supported Darrow's choice to give Ragnar a razor, and even threatened to cut down Thistle when she was about to attack him. Sevro and Ragnar became even close as they conducted missions against the Jackal and soon they became the key pillars of the Rising. Sevro even indoctrinated Ragnar as a Howler. During their time leading the Sons of Ares, Sevro showed Ragnar a holoVid of Venus's beaches, which made Ragnar smile in a way Sevro had never seen anyone smile before. When Ragnar kept sneaking into Sevro's room in the middle of the night to watch them again, Sevro just decided to give him the holo gear. In repayment, Ragnar placed a skull tattoo on Sevro's right hand, marking him as his blood brother.",
    "section": "Ragnar Volarus",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Clown and Pebble stand as some of the original Howlers going back to the Institute. Both have immense loyalty to Sevro as much as they do to Darrow from their time fighting alongside each other. After the massacre at Darrow's Triumph, both Clown and Pebble chose to remain with Sevro and fight in the Rising. Since then, they've continued to fight with Sevro through the Solar War, and during the black ops mission against the Ash-Lord. Once Sevro learns of Pax and Electra's abduction, Clown and Pebble chose to go with him back to Luna rather than go with Darrow to Mercury, though not without conflicted feelings.",
    "section": "Clown & Pebble",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro had developed unrequited feelings for Quinn sometime during the Institute and maintained them while they were apart. While he knows that Quinn cared for him, he also knows it wasn't in the same way he wanted. He and Quinn are reunited with the other Howlers when Mustang brings them back from their assignments to Luna. When Quinn is killed by Aja, Sevro takes her death hard, saying she didn't have a single cruel bone in her body, and that out of anyone she deserved to live. Sevro even believes Quinn would have been one of the few that would have understood Darrow if she had lived to learn his Red background.",
    "section": "Quinn",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Thistle was one of the original Howlers that fought with Sevro during the Institute. She joins him and the others when called to Luna by Mustang and aids the rescue of House Augustus from Octavia. When Sevro learns of Darrow's identity, he determines that Thistle would be one of the Howlers that would never accept Darrow as a Red, as she was \"too in love with her own species\". During the Iron Rain on Mars, when Darrow gives Ragnar and some Obsidians razors. Sevro reprimands her when she tries to stop it, and even pulls out his razor and threatens to cut her down when she draws hers and threatens Ragnar. It is this moment that Thistle's loyalty to Sevro collapses, which contributes to her leaving the Howlers and joining the Jackal's Boneriders once she learns Darrow's identity. She was aware of the pending massacre at Darrow's Triumph, and allowed it to happen despite knowing that Sevro and the other Howlers were going to be there too. Sevro saw this as a blatant betrayal to him and his Howler family, and completley wrote Thistle off in his memory.",
    "section": "Cyrianna au Tanus (Thistle)",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro had a low opinion of Cassius, seeing him as the same kind of Gold that had looked down on him all his life. The two were complete opposites in personality and this caused occasional friction. Sevro and Cassius only worked together when under Darrow during the fight with House Minerva and Diana at the Institute. After Cassius leaves Darrow for dead as revenge for Julian's death, he tells Sevro that Darrow had been killed by the Jackal. When Darrow leaves his slingBlade mark at Castle Mars as proof he's alive, Sevro realized he'd been lied to by Cassius, and abandons him to locate Darrow. Since the Institute, Sevro had zero liking for Cassius after what he did to Darrow. When Darrow ignites the civil war within the Society between House Augustus and Bellona, Cassius immediately becomes Sevro's foe and vice versa. After Darrow's capture during the Triumph, Cassius is revealed to be the one responsible for killing Sevro's father, though it's unclear whether he was even aware that Fitchner was Sevro's father. Sevro then set his sights on Cassius and promises to pay him in due what he did to Fitchner. When Cassius is taken by Darrow and Mustang and informs them about the Jackal being in possession of an arsenal of nuclear weapons, Sevro is in favor of using torture on Cassius to test if the information is true, but the idea is turned down. Meanwhile, he says nothing of getting his revenge on Cassius, either because he's preoccupied with helping Darrow and the Rising, or knows that Darrow wouldn't like the idea of him killing a prisoner in cold-blood. However, as a riot sparks among the LowColors aboard the Morning Star, following the release of Narol's death by the Jackal, Sevro is the one that puts a stop to the lynching of Cassius. Seeing only one way to quell the rioters' anger, Sevro makes the hard decision to forgive Cassius publicly as his father's murderer and puts an end to the blood feud between them, saying that whatever Cassius did, it was done as a soldier and without hatred, and urged the rioters to be better than those they hate for the sake of building a better world. In turn, Cassius thanked Sevro for his life, knowing then that he didn't deserve it. Sevro agrees to allow Cassius to go free as part of his, Darrow, Mustang",
    "section": "Cassius au Bellona",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "and Cassius's plan to fake Sevro's death and sneak into where Octavia is and kill her. The plan is pulled off and all four work together and succeed in killing Aja and Octavia. At this point, Sevro and Cassius depart on equal footing and he allows Cassius to take Lysander under his protection and go into self-exile.",
    "section": "Cassius au Bellona",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Sevro au barca by blackbirdink-dc47zvy.jpg Sevro merwildandco.jpg Sevro nan fe.jpg Evillienne Sevro.jpg Sevro-01.jpg Sevro-by-tiara.jpg Sevro-by-parisa.jpg Sevro xzemyore.jpg",
    "section": "Gallery",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* Sevro shares a cognomen (last name) with Hannibal Barca, the Carthaginian general and legendary military tactician who obliterated the Roman Republic's army during the Second Punic War. The cognomen \"Barca\" translates to \"lightning\". * Before settling on Sevro's first name, Pierce Brown compiled a list of his favorite words. Sevro's name was based on the word \"sever\", the Latin translation of \"servo\" (slave), and Severian the Torturer, a favorite character of his from The Book of the New Sun by Gene Wolfe. * In a signing for Sons of Ares, Volume 2: Wrath, Pierce Brown acknowledged the inconsistency in Sevro's daughter's name. In Iron Gold, she was called Diana, but in Dark Age she was called Selene.",
    "section": "Trivia",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* '''Shit escalates.''' *'''If your heart beats like a drum and your leg's a little wet, it's 'cause the Reaper's come to collect a little debt.' * 'I like to think I'm an endangered species.' * \"Through the thorns to the stars. You fancy little fart. Omnis vir lupus.\" * \"You tell anyone I cried, I'll find a dead fish, put it in a sock, hide it in your room, and let it putrefy.\" * \"If you touch a Barca, you cease to exist\" * He literally fucked a terrorist, I can say what I want.\"",
    "section": "Quotes",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Sevro au Barca hu:Sevro au Barca Category:Characters Category:Golds Category:Males Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Iron Gold Characters Category:Sons of Ares Category:Dark Age Characters Category:Light Bringer Characters",
    "section": "References",
    "name": "Sevro",
    "type": "characters",
    "series": "Red Rising"
  }
]