[
  {
    "text": "Tactus au Valii-Rath is a Gold and a classmate of Darrow who later becomes one of Darrow's lieutenants and advisors at The Institute on Mars. He was part of House Diana. Tactus is what some might consider to be a Pixie since he indulges heavily in Pinks, drugs and partying.",
    "section": "General",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tactus has Afro-Turkic ancestry. His voice is slow and languid, like a drifting blade. He's wiry and has bronze hair. His skin is dark like oak honey and his high cheekbones and deepset eyes give him a look of permanent derision and remind Darrow of pitviper eyes.",
    "section": "Appearances",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "His mother's a Senator, father's a Praetor. As a kid, Tactus beat a girl half to death when she wouldn't kiss him. The blood of gens Valii goes back to the Conquering, making Tactus an Iron Gold.",
    "section": "Background",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "During the institute he teamed up with Darrow to take down Mustang and House Minerva by hiding in the belly of a dead horse. During the escape of House Diana from House Minerva it is believed that Tactus cut underneath the saddle of the Primus Tamara, causing her to fall off of the horse during her escape and get trampled to death. After Tactus joins the Darrow and Mustang's army and they take the castle of House Ceres, Tactus attempts to rape a Ceres slave during the night. He is caught by Milia causing the army to be split, half wanting to defend Tactus as they are part of his house and the other half calling for justice. Darrow whips Tactus 20 times in front of the army, not holding back causing Pax to nearly hack down Diana soldiers from running to his defense. After Darrow finishes the punishment, he passes the whip to Tactus and tells him to whip him. Tactus is told to whip him 25 times in front of everybody, explaining that it is also his fault that Tactus committed the crime in the first place. But after 5 lashes, Tactus refused to do anymore. Darrow then makes Pax do it instead, for another 25 lashes. Though traumatic for all involved, Darrow is able to earn Tactus' loyalty and obedience, calling them \"blood brothers\" (to which Mustang remarks that Darrow may as well have called them pinecone cousins). Tactus notes strange markings in the snow that follow Darrow's army, and also alerts Darrow about the missing horses which makes Tactus the second person in Darrow's army to know the Proctors are interfering and cheating. Tactus is delighted to see Sevro again and refers to him as his \"belly buddy\" since they were both part of the DeadHorses squad. They also bond over their shared morbid peculiarity. Tactus is the one to have the idea of turning the bloodback pelt into a cloak for Pax. Tactus is drawn to Thistle and her scalp collection. Tactus then asks Darrow where the bloodback came from, which hints that Tactus wants to know what the Proctors want specifically with Darrow. This prompts Darrow to tell Tactus, Mustang, Pax, Milia, Sevro, and the original Howlers the truth about what the Proctors are up to. Tactus is then given command of his own unit in Darrow's army. When Proctor Apollo and the other",
    "section": "Red Rising",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "rigging Proctors confront Darrow in a jammer field, Darrow secretly sends Tactus, Sevro and the Howlers to take House Apollo by entering through the latrine holes. The plan works and the Proctors arrive too late only to see Tactus climbing the highest tower, knife in teeth, and pissing on the House Apollo banner. On the march to House Jupiter, Tactus is positioned to look out for tracks in the snow made by the corrupted Proctors. During the first night of Darrow's occupation of House Jupiter, Tactus and Mustang are out scouting during a storm. Tactus curses over the commUnits about not getting a dry roof while the others do. During the assault on Olympus, Tactus breaks the necks of two Greys who fire at him. After the battle is over and Mustang is revealed to be the Jackal's twin, Tactus stands next to Darrow and complains about waiting at the entrance of Olympus as Darrow's forces wait for a joint attack by the Augustus twins. However, Mustang returns with the Jackal captured.",
    "section": "Red Rising",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tactus served under his fleet commander Darrow, though his loyalty appears to waver after Darrow's loss to Karnus au Bellona at the Academy and subsequent publicized beating by members of the Bellona family, as well as Tactus's own impending personal danger upon losing his contract to House Augustus. Shortly after Darrow's men abduct Lysander au Lune from The Sovereign, he deserts Darrow and brings Lysander back to The Sovereign in the hopes of gaining her favour and protection. Later, as Darrow recruits Lorn au Arcos to his cause, Tactus arrives with Aja Au Grimmus. Tactus is wounded by a trap set by Darrow, and under orders from Octavia Au Lune, moves to slaughter Lorn's family. Darrow appeals to Tactus and, realizing that there is some good in Tactus and also that he hasn't placed enough trust in his friends, persuades him to return. Tactus breaks down emotionally and accepts Darrow's offer, only for Lorn au Arcos to execute him immediately for endangering his family.",
    "section": "Golden Son",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tactus-wheredaydreamersgo art 073020.jpg Tactus humandooesart.jpg Tactus-060916.jpg Tactus-au-rath-gorydamnreaper.png Tactus phantomrim.jpg Pax and tactus before ceres siege chibimiau.jpg Tactus piercings.jpg Tactus-au-rath-pallasillustration.jpg Tactus atubbs74.PNG Tactus nightingale.jpg Tactus leenaegin.jpg Roquetactus nightingalesart.PNG Tactus gracecrandall.jpg Tactus thegorydamnreaper.jpg Tactus.png File:TactusAuValiiRath.jpg|Tactus Au Valii-Rath",
    "section": "Gallery",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"I say we peel their balls off.\" - Red Rising, Ch. 30: House Diana *“So, you’re who they call the Reaper. Well, you just look too pretty to be much damage at all.” - Red Rising, Ch. 30: House Diana * ''\"You're about as pretty as a gargoyle's wart. So when else would you get a chance to snuggle with the likes of me?\" - Red Rising, Ch. 36: A Second Test * \"I could buy and sell you with my weekly allowance.\" - Red Rising, Ch. 36: A Second Test * \"Does the pain in your back give you a hard-on like it gives me?\" - Red Rising, Ch. 37: South * “Live fast. Die young. While you’re a boring old raisin, I’ll be a glorious memory of finer times and decadent days.” - Golden Son, Ch 1: Warlords'' es:Tacto au Rath hu:Tactus au Valii-Rath Category:Males Category:Characters Category:Golds Category:Deceased Category:Red Rising Characters Category:Golden Son Characters",
    "section": "Quotes",
    "name": "Tactus",
    "type": "characters",
    "series": "Red Rising"
  }
]