[
  {
    "text": "Adrius au Augustus, better known as The Jackal, is the second son of Nero au Augustus, Mustang's twin brother, and a Gold of the Martian house Augustus. His epithet, 'The Jackal', was given to him by Lilath during the war games in which he turned to cannibalism from months of starvation while trapped within mountain caves. Adrius is a complicated character. He sees little value in anything other than achieving his goals, yet he still longs for his father's approval.",
    "section": "General",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The Jackal's defining traits are his sociopathic and ambitious nature. Like his sister he has a penchant for politics and subterfuge, however unlike her he seemingly has no sense of right and wrong and is devoid of empathy. Unlike typical golds he doesn't have even a superficial respect for the concept of honor and will betray his allies whenever convenient. While he tries to project an image of not being prideful, he secretly harbors a very large ego and sense of entitlement. He despises anyone who outwits or beats him, and harbors aspirations to become the Sovereign of the Society even if he has to murder billions of innocent people to achieve it. His ability to project a false mien of humility is one of his most valuable skills, as it leads to otherwise insightful people like Darrow, Quicksilver, or Octavia to regard him as the \"lesser evil\" to work with only to later be horrified at the scope of his actions. Despite not being physically adept, the Jackal harbors a vast intellect and is noted by Darrow to be much smarter than him. He's shows the ability to manipulate and predict the actions of people with far more life experience than him, which leads him to acquire considerable military and political power despite his young age. He is shown to be capable with wartime strategy and statecraft, almost becoming the ArchPrimus of the institute and Sovereign of The Society if not for Darrow's interventions. Despite having what appears to be an almost inhumanely logical nature, Adrius does have a strong emotional motivation for his behavior in his desire for his father's love and approval. However, his desire for familial affection does not extend to any true loyalty towards his relatives.",
    "section": "Personality",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Slightly oily blonde hair. Has a stump on one of his hands after he sawed it off to escape from Darrow during Red Rising. He's noted as being small and unusually skinny compared to the normally well muscled Golds.",
    "section": "Appearance",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Adrius was sorted into the house of Pluto and received considerable illegal aid due to the political manipulations of his father. During the early stages of the game his keep was invaded by Vulcan and he retreated into the caves in his territory to escape enslavement. He made the decision to detonate explosives that collapsed the tunnels and seal his house inside. Over the next few months Adrius would assume control over the house of Pluto, who would resort to cannibalism to survive. After escaping the tunnels Adrius, now known as the Jackal, would begin the systematic conquering and enslaving of his neighboring houses, eventually becoming the dominant military force of his region. He successfully undermined the rising of Mars by using his father’s connections to acquire a video of Cassius’s brother’s death to manipulate Cassius into killing Darrow. In retaliation for Darrow’s presumed death, Sevro attempted to assassinate the Jackal but would fail and lose an eye in the attempt. Near the end of the game the Jackal would attempt to kill Darrow’s army by feigning to be a surrendering defector from the house Jupiter in order to lead Darrow’s forces into an ambush at Jupiter keep. Darrow saw through the deception and pinned the Jackals hand to a table using a knife, forcing Adrius to cut off his own hand in exchange for freedom. The Jackal would escape thanks to the intervention of an unknown Proctor and by cutting off his own hand to free himself. Before escaping he killed Pax in a failed attempt to kill Darrow. He managed to reconvene with his now weakened army, but ultimately would be invaded and defeated by Darrow’s forces being led by his sister Virginia. He was enslaved, stripped naked, bound, and delivered to Darrow by Virginia which cemented Darrow's victory as ArchPrimus. He was present with his sister during the ending ceremony of the Institute and watched his father offer to sponsor Darrow.",
    "section": "Red Rising",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Since graduating the institute, the Jackal would pursue several business interests to gain power. Though engaging in business associated with Silvers was considered beneath his status as a Gold, the Jackal would show considerable skill in the field and claimed to have control of 60% of the public media. The Jackal arranged a meeting with Darrow through Victra and offered a partnership between the two. Though doubtful of the Jackal’s trustworthiness, Darrow agreed to the alliance and saved the Jackal from an assassination attempt orchestrated by a splinter faction of the Sons of Ares. He was present at the Gala on Luna where hostilities openly erupted between House Augustus and House Bellona. Though he didn’t personally fight, he did take the opportunity to covertly murder Leto au Augustus, who was more likely than the Jackal to serve as his father’s heir. While escaping with other members of his house, he secretly murdered Darrow’s friend Quinn while pretending to give her medical aid after she was severely injured by Aja. Darrow and the Jackal would occasionally meet and exchange information and plan their next moves despite Mustang’s repeated warnings to Darrow that her brother could not be trusted. After arriving on Mars, the Jackal would apprehend several Sons of Ares operatives including Harmony, Mickey, and Evey. Darrow managed to extract them from the Jackal's custody, but not before Harmony revealed Darrow’s identity as a Red and a Sons of Ares agent to the Jackal. Now knowing of Darrow’s duplicity, the Jackal took the opportunity to strike a secret alliance with the Sovereign to betray his father. At the ceremony meant to name the Archgovernor the ruler of Mars, the Jackal launched a coup that massacred the ceremony’s guests. The Jackal murdered his father, imprisoned Darrow, and became lord of House Augustus.",
    "section": "Golden Son",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After arresting Darrow, the Jackal spent three months torturing him and locked him in solitary isolation for a further nine. Once the Rising began after footage of Darrow’s carving was released, the Jackal launched a campaign of mass lockdowns, arrests, and genocide against rebellious lowColor communities to stop the rebellion. He eventually agreed to turn Darrow over to the Sovereign, but Darrow would escape while he was being prepped for transport. At some point before or during this time, the Jackal’s forces raided a secret nuclear weapons depot owned by the Sovereign. Through this the Jackal came into possession of hundreds of 30 megaton nuclear weapons, while attempting to pin the theft on the Sons of Ares. The Sovereign outwardly accepted this explanation but secretly suspected the Jackal’s involvement and began to work against him. During the insurrection of Phobos, Darrow would call the Jackal and taunt him with the supposed kidnapping of his business partner Regulus ag Sun. The Jackal was sufficiently goaded into sending a considerable invasion force to Phobos, not realizing that his was a ploy to seize his ships. While Darrow’s forces moved to engage the Sword Armada on the Outer Rim, the Jackal used his Syndicate contacts to secretly seed the surface of Luna with his stolen nuclear munitions. Once in place he held the moon’s population hostage to strike a secret deal with the Sovereign to have himself named her successor. After his forces managed to apprehend Darrow’s uncle Narol, the Jackal personally killed him and repeatedly broadcast the execution to taunt the Rising’s forces. During the return of Darrow’s fleet to the core worlds, the Jackal correctly predicted that Darrow would attempt to catch Luna unaware instead of returning to Mars and sent most of his fleet to wait in ambush. He was the first to meet Cassius after his supposed escape and apprehension of Darrow and Mustang. He had Cassius cut off Darrow’s hand as retribution for losing his own during their time at the Institute. He accompanied the group to the inner chambers of the Sovereign for their execution but was captured during their escape. He ordered Lilath to begin detonating his hidden nuclear weapons in an attempt to extort Darrow, but Darrow instead responded by removing the Jackal's tongue. After Mustang became acting Sovereign, the Jackal was tried for his crimes and sentenced to execution. During his hanging, his sister",
    "section": "Morning Star",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "personally pulled on his legs to break his neck.",
    "section": "Morning Star",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Adrius supposedly had a closer relationship with his sister during their youth. He would sometimes draw mazes and challenge his sister to solve them, though after she succeeded Mustang would later see him berating and harming himself for his inability to outwit her. After their brother's death both twins were separated and lost whatever closeness they had. By the time they're old enough to attend the institute Mustang regarded her brother mostly with caution, being aware of his sociopathic nature. After Adrius betrayed and murdered their father, and having become of aware of the truth of Claudius's death, Mustang lost whatever affection she had for her brother and became resolved to completely destroying him. Despite this, at the execution she played the role of a loved one and helped break his neck to spare him the pain of asphyxiation.",
    "section": "Mustang",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "The Jackal displayed a fear and fixation toward Darrow from the first time they encountered each other. He attempted to have Darrow killed in the early days of the institute and later exposed himself to capture in a failed attempt to lead him into an ambush. Years later, the Jackal affected an uncaring disposition towards their prior conflict in an attempt to manipulate Darrow into a partnership. Eventually the facade would drop and Jackal would reveal that he genuinely despised Darrow for upstaging him and earning the approval from his father that the Jackal could never acquire. He would make it a point to torture and humiliate Darrow as an expression of his hatred. Despite their mutual animosity they have a somewhat unique understanding of each other. Darrow's one of the few people who can see Jackal's inner desire for love and connection being the primary motivation for his psychotically ambitious nature. Darrow gifted the Jackal a custom scepter, which the Jackal ironically notes to be his most valued gift despite come from his most hated enemy.",
    "section": "Darrow",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Adrius's desire for love and approval from his father is perhaps his sole emotional motivation for his actions. He views himself as emulating his father's ruthless and pragmatic disposition and believes by succeeding he can earn his father's respect. Nero, for his part, never seems to regard Adrius as anything other than a failure. As a baby Adrius was left exposed on a rock for three days to die due to Nero viewing him as too small and frail to be worth raising. Nero only seemed to regard Adrius as valuable after the death of his other son, though this only manifested in keeping him isolated to avoid assassination. After Adrius's humiliating defeat while attending the Institute Nero has seemingly lost all interest in his son's worth. After Adrius betrays his father and reveals his role in Claudius's death, Nero angry denounces Adrius as not his son. Adrius himself notes that this is what finally pushes him into becoming irredeemably evil.",
    "section": "Nero au Augustus",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Adrius-by-Savelaco.jpg Adrius-parisa poorpp.jpg Jackal lou who.jpg Adrius-nero-virginia-053016.jpg Adrius-041816.jpg Jackal-gorydamnreaper.png Jackal ematije.jpg Jackal tylerellis.PNG Jackal Pen.PNG Violetfever mustang and adrius.jpg Augustus twins.png Kaitexas adrius.PNG Adrius bone necklace halarts.jpg Jackal the drawing astronaut.jpg Jackal mightythepen.jpg Adrius-2-by-pbdoodles.jpg Jackal and antonia scillavega.PNG Adrius-by-pbdoodles.jpg Jackal niktropolis.PNG Jackal bloodydamn.png Jackal and darrow bloodydamn.png Jackal plutogeist.png Jackal violetfeverdreams.jpg Jackal and darrow emiloola.jpg Jackal simoeart.PNG",
    "section": "Gallery",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* \"Then let us rise together. I the scepter, you the sword.\" - Golden Son, pg. 59 * ''\"If you lend me an apple, I'll even put that in her mouth so she looks like a pig at a feast\" - Red Rising, Ch. 40: Paradigm * \"Wish I could have been something more ... regal than Jackal, but reputations tend to make themselves.\" - Red Rising, Ch. 40: Paradigm * \"Humans are always negotiating. That's what conversation is. Someone has something, knows something. Someone wants something.\" - Red Rising, Ch. 40: Paradigm * \"Cheat or be cheated\" - Red Rising, Ch. 40: Paradigm * \"A hand is a peasant's tool. A Gold's tool is his mind. Were you of better breeding, you may have realized this sacrifice means so very little to me.\" - the Jackal right before he cuts off his hand in ''Red Rising, Ch. 40: Paradigm",
    "section": "Quotes",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Adrio au Augusto hu:Adrius au Augustus Category:Golds Category:Males Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters Category:Deceased Category:Characters",
    "section": "References",
    "name": "The Jackal (Adrius)",
    "type": "characters",
    "series": "Red Rising"
  }
]