[
  {
    "text": "Tiberius au Bellona is the Gold Primus of the Martian House Bellona, Governor of Olympia, and Imperator of the Sixth Fleet in The Society Navy. He is the father of Karnus, Julian and Cassius.",
    "section": "General",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He is more solemn and quiet than his wife, Julia, and more obedient to the laws of the Society. He favors his son Cassius above the others in his family. While he appears stoic and emotionless, he nearly shed tears as he witnessed Darrow humiliate and nearly kill Cassius. Despite this, he holds the rules above that of the lives of his family, and tried to stop his family from interfering in the duel between Darrow and Cassius, even if it would have resulted in his son's death.",
    "section": "Personality",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tiberius hosts a Logos of House Augustus who informs him of an increase in helium-3 quotas.",
    "section": "Sons of Ares, Volume 3",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tiberius arrives at The Institute alongside Nero au Augustus and the Institute's Director Clintus for the students' graduation after Darrow broadcasts his victory over The Jackal and the Proctors.",
    "section": "Red Rising",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Tiberius is largely ineffectual after his son Julian is killed, causing his wife to consume the family in her quest for revenge against his killer. He witnesses the duel between Darrow and Cassius, where, despite being visibly aggrieved at the thought of his favorite son dying, is still prepared to allow Cassius to die according to the rules of The Society. He and most of his house are later killed during the Martian Civil War, with only Cassius and Julia surviving from the vast house. Tiberius himself is beheaded by Kavax au Telemanus.",
    "section": "Golden Son",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "* His name is erroneously mentioned as Demetrius au Bellona once in Red Rising.",
    "section": "Trivia",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Tiberio au Belona hu:Tiberius au Bellona Category:Golds Category:Characters Category:Red Rising Characters Category:Golden Son Characters Category:Deceased",
    "section": "References",
    "name": "Tiberius",
    "type": "characters",
    "series": "Red Rising"
  }
]