[
  {
    "text": "Vixus au Sarna was a Gold who was a highDraft of House Mars at the Mars Institute with Darrow O'Lykos (formerly au Andromedus).",
    "section": "General",
    "name": "Vixus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He's described as cruel, having dead eyes and a hawkish face. He's nearly as big as Darrow. Vixus apparently enjoyed mutilating prisoners by cutting off their ears.",
    "section": "Description",
    "name": "Vixus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "He was Titus au Ladros' right hand man and the most dangerous of Titus's followers at the Institute before Titus's death. Darrow is jealous that Vixus is the one who captures the first slave of House Mars when Vixus is seen dragging a girl by the hair across a plain. Later, he assaults Lea and steals her day's labor and spits on Darrow's face. Darrow knocks Vixus out cold, destroying Darrow's chance of uniting the House. During Titus's reign of House Mars, Darrow and Cassius au Bellona spot slaves picking berries who are being slapped by Vixus with a long stick. Vixus still hates Darrow despite joining Darrow's forces after Titus falls. Vixus, Darrow, and Cassandra pursue Mustang after House Minerva falls. Vixus says he wants to break Mustang and see what she looks like with a bridle on. Darrow spots Mustang hiding in the woods but leads the twisted Vixus away from her. He collaborated with Antonia au Severus–Julii to murder Lea and attempted to overthrow Darrow in a coup, which failed. He was crucified by House Pluto when they attacked House Mars.",
    "section": "Red Rising",
    "name": "Vixus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Vixus was among the disguised Pinks at Darrow's Triumph who were responsible for the massacre of his allies.",
    "section": "Golden Son",
    "name": "Vixus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "In Morning Star, Vixus is revealed to have joined the ranks of the Boneriders, the Jackal's inner circle of killers. He is murdered by Darrow when Darrow escaped with Victra au Julii from the Jackal's residence.",
    "section": "Morning Star",
    "name": "Vixus",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "VixusKillLea.PNG House mars mayaaustin.png ==Quotes== *''\"Disgusting, he's a vile thing. A wretched womanish thing.\" - Vixus about Darrow | Red Rising, Ch. 23: Fracture *\"You're a pampered little prick, so that's what I'm gonna take from you, goodman—your little prick.\" - ''Vixus to Darrow | Red Rising, Ch. 23: Fracture es:Vixus au Sarna hu:Vixus au Sarna Category:Males Category:Golds Category:Characters Category:Deceased Category:Red Rising Characters Category:Golden Son Characters Category:Morning Star Characters",
    "section": "Gallery",
    "name": "Vixus",
    "type": "characters",
    "series": "Red Rising"
  }
]