[
  {
    "text": "Weed is a Gold who attended The Institute of Mars from 737 to 738 PCE and is one of the original Howlers.",
    "section": "General",
    "name": "Weed",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Weed is thin, which is what earned him his nickname. Like Pebble and Clown, Weed wears his hair in a mohawk. As a Howler, he wears a wolf cloak and has a tendency to howl as they go into battle.",
    "section": "Appearance",
    "name": "Weed",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "At the Institute, Weed is drafted into House Mars. He is considered a lowDraft, one of the 'dregs' of the House, because he lacks the physical and mental prowess of the mid and highDraft Golds. When House Mars splinters into four tribes within the first four days of the war game, Weed becomes part of Darrow and Cassius' group. After the downfall of Titus, Darrow puts Weed under Sevro's command alongside Screwface, Thistle, Pebble, and Clown. Together, they become the first Howlers. When House Mars captures the castle of House Minerva, Weed is one of the Howlers to hide in the dead horses.",
    "section": "Red Rising",
    "name": "Weed",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "After graduating from The Institute, Pebble and the Howlers are reassigned to Pluto thanks to the machinations of Pliny au Velocitor, but are eventually summoned to Luna by Virginia in late 741 PCE so that they can be on standby to protect Darrow and House Augustus during the January 742 Summit. Weed dies during the Lion's Rain after an EMP detonates nearby and kills the power of his gravBoots and StarShell armour, dragging him to the bottom of the river, where he ultimately drowns.",
    "section": "Golden Son",
    "name": "Weed",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "Howlers.jpg Howlers ocny.PNG Weed sleep cargohold kleeklutch.png",
    "section": "Gallery",
    "name": "Weed",
    "type": "characters",
    "series": "Red Rising"
  },
  {
    "text": "es:Hierbajo hu:Kóró Category:Characters Category:Red Rising Characters Category:Golden Son Characters Category:Golds Category:Males Category:Sons of Ares Category:Deceased Category:Howlers",
    "section": "References",
    "name": "Weed",
    "type": "characters",
    "series": "Red Rising"
  }
]