[
  {
    "text": "Darrow '''O'Lykos''' is the main protagonist and sole narrator of the first Red Rising Trilogy, and one of the five narrators of the Iron Gold Trilogy. His experiences throughout the trilogy transform him from a lowly Red Helldiver into the legendary leader of The Rising, using his education as a Gold to earn numerous supporters from the various classes of society.",
    "section": "General",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "As a lowRed, he had dull red hair and red eyes and was 5'4\" tall. He is also stated to have had a slim face, born handsome. His skin was pale white from lack of sun exposure and he had an Irish accent (as most lowReds do.)",
    "section": "Red",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Once he was carved into a Gold, his appearance and height changed, being 7’1 (2.15m) tall and weighing 160kg from Red Rising to Morning Star. He became stockier in the 10 years after Morning Star Even for a Gold, Darrow is large and tall with a broad chest. Darrow is said to be very handsome. Mustang claims that he seems to be carved from \"angry\" marble and is all sharp angles. He possesses golden eyes and hair with tan skin. He has a skull tattoo on his right hand, which he was given by Ragnar Volarus along with Sevro to symbolize their relationship as blood brothers. He typically wears a blood-red suit of pulseArmor.",
    "section": "Gold",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Before learning the bitter truth that the Reds were suffering in the mines to maintain an already terraformed Mars, Darrow was a loving husband and Helldiver of Lykos through and through. His ambitions and cravings did not extend beyond the welfare and safety of his family. He was rash and without fear when risking his life to keep up productivity in the hopes that he will win extra food for his community.\n\nDarrow was also brave, but compromising and practical if it meant safety for the people around him. Despite being pragmatic and rigid, he cared deeply for his wife and for his family, becoming wrathful after Eo's execution.\n\nAfter being carved into a Gold, Darrow struggled with the concept of losing himself, doing his best to keep in touch with his roots as a Red. He was conscious to a degree of his heritage and felt deep pride for his origins and his people. While he initially hated Golds, he came to respect some members of their caste, befriending several Golds and falling in love with another.\n\nOne of the trademarks of Darrow's personality is his anger. While still a Helldiver, he disregarded Narol's warnings of dangerous gas pockets, enraged by his uncle's hindering of his efforts to win the Laurel for their clan. During the Institute entrance exams, psychological tests showed that he had a fiery temper. This was demonstrated by his draft into House Mars and constant reminders from Matteo.\n\nDarrow's sense of personal morality leaves him conflicted in many of his choices and decisions. While he demonstrates shrewdness and ruthless cunning in his decisions, he does deeply regret the harm wrought to those he cares for or respects. His devotion to The Rising remains rigid, despite moments of self-doubt, and eventually becomes willing to take great risks to achieve his goals. In an interview, Pierce Brown said that \"seeing Darrow from other people’s perspectives... he would seem like much more of a villain.\"\n\nDarrow is a charismatic leader, capable of winning friends and allies with his considerable force of personality. His bold nature and skill at delivering speeches wins him the admiration and loyalty of many. He can make rash decisions without consideration for others at times. However, as the series progresses, he comes to learn from his mistakes and becomes a strong leader of The Rising. \n\nHe likes dancing, singing and fresh fruit, especially strawberries. \n\nAs a Gold, Darrow is noted to be quite harsh on Grays due to Ugly Dan, who would torment Darrow in the mines.",
    "section": "Personality",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Even before he was carved into a Gold, Darrow was very athletic and shown to have highly impressive dexterity and strong grip, characteristics shared amongst most Helldivers. He also had a stronger heart than most other lowReds due to surviving the venomous bite of a Pitviper when he was a child. His dexterity impresses even other Golds, such as Mustang.\n\nAs a Gold, Darrow's powerful build and high bone density granted him superhuman speed and strength. The strength of his grip outclasses that of Titus, the largest member of House Mars. He was able to hold his breath underwater for over eight minutes and could withstand multiple Gs of force without passing out or vomiting. It is mentioned that Mickey's skills were so great that Darrow physically outmatches most Golds. During Darrow's recarving in Morning Star, Mickey made his ribs dense enough to withstand bullets.\n\nIn combat, Darrow is a formidable opponent. Initially, he could ably defeat other Golds during his time at the Institute despite lacking formal training. However, he was left for dead by Cassius after their duel. As time passed, his training under Lorn au Arcos fostered his growth, making him the last student of Arcos' fighting style known as the \"Willow Way\", a legendary form of Kravat created by Lorn known for its aggressive and precise strikes. This newfound skill allowed him to defeat Karnus au Bellona on his own and to avenge his loss to Cassius by cutting his arm off in a duel.\n\nAt 33 years old, Darrow is considered to be one of the best razor fighters, being the last master of the Willow Way. According to Pierce Brown, Darrow at 33 years old against Aja (who was in her 50's-60's in Morning Star) would end up with both of them dead. Against a weakened and older Lorn, Darrow might win, especially in zero gravity as he is better than Lorn in that gravity. Furthermore, Darrow's skill at this age allowed him to defeat a squad of Solar Republic Wardens with nothing but his razor and civilian clothing.\n\nEven before becoming a Gold, Darrow had a natural talent in \"extrapolational thinking\", also called \"lateral thinking\", allowing him to think of indirect and creative approaches via reasoning would not be immediately obvious to others. The solutions he would come up with were often simplistic in hindsight, yet would allow him to completely change the paradigm in his favor. This unique trait is one that was found in successful military leaders and generals including Alexander, Hannibal, Scipio Africanus, Caesar, and Napoleon. \n\nHaving rigorously studied military history during his infiltration of The Society, Darrow becomes a highly capable strategist and tactician. He leads House Mars to victory against considerable odds in the Institute and The Academy, defeating other competitors until only he and Karnus remain as commanders. Darrow's plans are relatively straightforward but extremely effective, being difficult to counteract due to their simplicity and aggression. This zeal allowed him to achieve victory against a previously undefeated military leader like Roque au Fabii, attacking and drilling into the enemy vessel alongside Helldivers to allow for boarding action. Also a ruthless pragmatist in battle, Darrow is willing to use tactics that would be considered underhanded or distasteful to achieve victory. This can be seen in his hiding of The Howlers in dead horses for an ambush on House Minerva to booby trapping Lorn's treasured garden with bombs to shred Aja's Obsidian and unbeknownst to her, lace her with trackable radioactive material as to track her back to Mars.",
    "section": "Abilities",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "The main tool Darrow used in the mines of Lykos is known as a slingBlade. It is a curved, C shape-blade used to fend off Pitvipers and sever limbs stuck inside machinery.",
    "section": "slingBlade",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "During the events of the first book, Darrow was seen to have a ring that had a small hidden blade that deployed at the flex of his knuckle , with which he used to kill proctor Apollo. (it is also worth noting that its not mentioned after the first book nor is any contraption like it which likely means that it was unique)",
    "section": "knifeRing",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Darrow's razor is bone-white and typically wrapped around his forearm. He received it from Mustang as a parting gift. It is later engraved by Sevro during Darrow's imprisonment. The engraving include above the hilt Eo picking a Haemathus from the ground and looking up about to smile. above that, is his father kissing his mother and towards the top of the blade, Leanna, Loran, and himself chasing Kieran down a tunnel wearing Octobernacht masks. The grip is wrapped in salt-stained calf leather.",
    "section": "Razor",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "]Life in the Deepmines\nDarrow was born in the mining town of Lykos on the planet Mars. As a lowRed of the Lambda clan, he was a member of the lowest caste of the Society, the rigid order controlling humanity. He lived under grueling conditions like the rest of his caste, exposed to radiation and starvation. When Darrow was young, his father, Dale, was hanged for rebelling against the Society.\n\nA few years after his father's death, Darrow's elder brother Kieran fell ill. Unable to pay the a Gamma or gray for medicine, Darrow traded a Gray a brass watch given to him by his father at the age of three or four for the medicine.\n\nBy the age of sixteen, Darrow had become a \"Helldiver\", the pilot of his clan's enormous ClawDrill mining vehicle. He made his living tunneling through Mars in search of helium-3, the precious resource that fuels the Society's terraforming projects. At the age of sixteen, Darrow married his childhood friend and sweetheart, Eo. She possessed a rebellious spirit that contrasted Darrow's resignation toward the cruelty of life as a miner. Despite (or perhaps because of) this glaring character difference, Darrow and Eo were very happy together.",
    "section": "Pre-Saga (720-737 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Recruitment\n\nAfter Darrow estimated he had mined enough Helium-3 to win that cycle's Laurel (an award of extra food and luxuries for the Lykos clan that mines the most Helium-3), the award was instead given to the Gamma clan who always won (in what was likely a rigged competition). Following this disappointment, Eo illegally brought Darrow into a garden hidden within the mines. They were discovered and captured by Grays. When Eo and Darrow were to be punished for their crime by ArchGovernor of Mars Nero au Augustus himself, Eo sang The Forbidden Song, a traditional Red song banned by Gold, detailing a rebellion against the Society. For singing this song, Eo was sentenced to death and Darrow forced to watch as his wife was hanged. Following her execution, Darrow buried Eo (also a banned practice), for which he was sentenced to death as well. Unbeknownst to Darrow, his Uncle, Narol, had purposely poisoned him before he was to be hanged, and then did not pull his legs hard enough. Because of the poison slowing his heart enough to make a heartbeat undetectable, Narol was able to save Darrow from actual death. After awakening, Darrow was taken to the Sons of Ares, a terrorist group seeking to topple the Society. The rebels brought him to the planet's surface where Darrow discovered its vibrant cities, where people of all castes live in a highly-ordered society with Reds holding the lowest station of any color. Having been raised believing that Reds were pioneers aiding the terraforming of Mars, he was enraged when he discovered the truth. Inspired by Eo's dream of living for more than mere survival, Darrow took on a dangerous mission for the Sons of Ares. To help the rebels, he agreed to undergo massive biological augmentation to become a Gold and use the privilege of the ruling class to destroy the Society from within. Rebirth\nA Violet carver named Mickey carved Darrow into the form of a Gold, performing extensive surgery and administering intense hormone therapy. His height was increased to around 6’11\" (2.1 meters), while implants and other biological modifications were used to increase his physical and mental abilities.The tensile strength of his tendons and ligaments was enhanced along with the strength of his muscle fibers.",
    "section": "Red Rising (737-738 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 1,
    "source_book": "Red Rising"
  },
  {
    "text": "He engaged in intense physical training and academic tutoring, preparing him to succeed in his masquerade as a Gold, and taking on the name of Andromedus. To polish off Darrow's rough edges, his language and other social skills were cultivated by a Pink named Matteo, who also taught Darrow to manage his temper. Darrow was also cared for by Dancer and Harmony, Red members of the Sons of Ares. The Institute\n\nAfter being educated, he took a test to enter the Institute of Mars, a training school for prospective military officers. Darrow was accepted, having missed only a single question out of hundreds to gain entrance. Here, he was drafted into House Mars by Fitchner, Mars' Proctor, who was impressed by Darrow's immense rage. Upon arriving, he was able to befriend other Golds, among them being the sons of the powerful Bellona family, Cassius au Bellona and Julian. Afterwards, the next trial was the Passage, a series of death matches among the students. After a struggle, Darrow was forced to kill Julian to earn his House ring and continue competing. Finally, the remaining students were dropped into a valley alongside their other House members. Here, the objective was to enslave other Houses in order to win. House Mars was divided early on as different factions developed, with one group being led by Darrow and Cassius. After some time, a violent faction led by Titus au Ladros grew, forcing Darrow to form an alliance with House Minerva, led by Mustang. The alliance was able to bring down Titus, who Darrow later realized to be a fellow Red in disguise. Reluctantly, Darrow allowed Titus to be executed by an enraged Cassius who mistakenly believed Titus had killed Julian. He also captured House Minerva's standard, ending with the enslavement of House Minerva by House Mars. However, Darrow allowed Mustang to flee. Before retreating, Mustang informed Darrow about the Jackal, the unnamed Primus of House Pluto who had become a feared warlord. With this, Darrow earned his status as Primus. He also gained friends in Sevro and his Howlers, a band of outcast students skilled in combat who donned wolf pelts. Unfortunately, Cassius discovered that Darrow killed Julian and proceeded to wound him in a duel before leaving him for dead in the wilderness.",
    "section": "Red Rising (737-738 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 1,
    "source_book": "Red Rising"
  },
  {
    "text": "Becoming the Reaper of Mars\nMustang found Darrow and nursed him back to health, repaying him for allowing her to escape. During this time, Fitchner visited Darrow and informed him of the interference of the Proctors on behalf of the Jackal. He explained to his student that the Jackal was Adrius au Augustus, the son of the ArchGovernor. Fitchner admitted that the ArchGovernor had bribed or threatened the Proctors to ensure his son's victory. He attempted to dissuade Darrow from further taking part in the competition, citing the Jackal's savagery and cunning making him unbeatable. Seeking to defy the Proctors, Darrow and Mustang amassed an army by recruiting slaves that fled and hid from their respective Houses. Led by Darrow, they captured and freed a number of other students. Among them was Tactus au Valii-Rath, an arrogant and power hungry Gold. Ultimately, Tactus submitted to Darrow's leadership when Darrow shared physical punishment with him after he sexually assaulted a girl in the army. During this time, he gained the nickname of the Reaper for carrying a scythe (known as a slingBlade by Reds) as his weapon and for conquering numerous Houses. Darrow then targeted House Mars, sneaking in one evening and carving a slingBlade into doors and tables to scare them. Sevro and his Howlers, under the belief that the Jackal had murdered Darrow, immeditaly abandoned House Mars to hunt down their friend's killer, later managing to find and join Darrow. In taking House Jupiter, they were able to capture a disguised Jackal after Darrow pinned his hand to a table with a knife. However, the Proctors interfered again and the Jackal escaped, having sawed off his own hand. In the ensuing chaos, one of Darrow's closest friends and the \"titan\" of his army, Pax au Telemanus, was stabbed to death by the Jackal. Angered by the corruption of the Proctors, Darrow and his army assaulted Mount Olympus, the floating fortress of the Proctors. Despite successfully taking the fortress, they were unable to capture the Jackal. Mustang then decided to pursue him with a portion of their army. Darrow let her do so but discovered Mustang was actually the Jackal's twin sister. He also learned that Fitchner was Sevro's father and had the Proctor detained in his room instead of being humiliated like his colleagues.",
    "section": "Red Rising (737-738 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 1,
    "source_book": "Red Rising"
  },
  {
    "text": "In an unexpected turn of events, Mustang remained loyal and returned with her brother in captivity. Darrow then returned to House Mars, retaking his position as Primus from Cassius, who declared a blood feud with Darrow. With this, Darrow won the exercise and was given the chance to choose a sponsor who would aid his rise through the Society. In the end, he chose ArchGovernor Nero au Augustus himself, hoping to exact vengeance upon him as he ordered Eo's hanging. Darrow was then named a Lancer of House Augustus before the rest of the students from the Institute, solidifying his bond with his wife's killer.",
    "section": "Red Rising (737-738 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 1,
    "source_book": "Red Rising"
  },
  {
    "text": "Lancer of the Lion\n\nAfter a graduation ceremony in Agea where he gains his Peerless Scar, Darrow spent the year after his success running errands with and for Nero au Augustus, training in the Willow Way with Lorn au Acros, and spending time and building a relationship with Mustang.\n\nIn order to further Ares' plan, Darrow spends the next two years training in the Academy learning to command ships in battle so that he may one day become an Imperator. In a parting gift, Mustang gives him a custom Razor and he gives her a horse-crested ring.",
    "section": "After the Institute (738-741 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Loss at the Academy\n\nHe was initially successful, amassing a formidable fleet and eliminating a number of his other competitors. His last rival was Cassius' older brother, Karnus. During their final confrontation, Darrow gained the advantage but ultimately lost. Because of this, his crew suffered 833 casualties and was forced to answer to Augustus for his failure. For his loss, Augustus severed all ties to Darrow, leaving him at the mercy of his enemies. The Bellona were still seeking revenge for Julian's death and they began harassing Darrow. After his expulsion from House Augustus, several of Cassius' relatives beat him when they find him alone. An Old Foe\n\nDarrow met with Victra au Julii, one of his former lieutenants. As she was the half sister of Antonia au Severus-Julii, one of his rivals from the Institute, he did not trust her. Regardless, she arranged a meeting with the Jackal which Darrow agreed to. There, the Jackal proposed that he and Darrow work together to topple the Society and the Sons of Ares (not knowing that Darrow worked for the Sons). In the midst of their meeting, Darrow recognized Evey, a former Pink pleasure slave to Mickey, who then set off an explosion. Darrow survived unharmed and was able to save the Jackal. He then met with Harmony and Evey, berating them for using violent tactics like bombings. Harmony revealed that Dancer had died, leaving the Sons of Ares vulnerable. She attempted to have Darrow take on an assignment for her but he refused, disagreeing with her brutality. Harmony then showed him a holographic recording of Eo's execution, allowing Darrow to hear her last words. In it, Eo revealed to her sister that she was pregnant and asked her sister not to tell Darrow that she was pregnant. Broken by this revelation, Darrow accepted Harmony's assignment: the bombing of the Summit, a large gathering of the great families on Luna. What Gold Fears\n\nDarrow arrived at the Summit where he met with Roque au Fabii, a poet and a friend from the Institute. Despite his willingness to kill the Golds, he did not wish to see Roque die. Instead, he drugged him and left him in his room. Darrow then entered the gala prepared to carry out the bombing. However, he relented when he realized that he would be failing Eo's dream and when he saw Mustang enter with Cassius.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 2,
    "source_book": "Golden Son"
  },
  {
    "text": "Darrow then challenged Cassius to a duel with the support of Augustus, using an ancient Martian oath to gain his blessing. As they dueled, Cassius appeared to have bested Darrow. However, Darrow was able to fight back. Merely faking his ineptness, Darrow had been trained in the Willow Way by former Rage Knight and renowned razormaster, Lorn au Arcos. He then defeated Cassius, dismembering his sword arm. This caused a massive brawl at the gala, starting a schism that threatened the Society. As he attempted to escape with the ArchGovernor, Darrow was detained by Fitchner, the current Rage Knight. Darrow was taken before the ruler of the Society, Sovereign Octavia au Lune, who had been mentoring Mustang. Darrow was able to reveal the Sovereign's plans: the assassination of Nero au Augustus at the gala. Octavia attempted to explain to an angry Mustang that her father was becoming too dangerous due to his rebellious attitude towards her rule, hence the need for his death as he could destabilize the Society. After this meeting, Darrow was rescued by the Howlers. The Howlers had also collected Lysander, Octavia's grandson, from Mustang who had kidnapped him to use as leverage for escaping the moon. Darrow and Augustus left Luna with the rest of their allies . However, Tactus betrayed them, taking Lysander back to the Sovereign. At the same time, Quinn, a Howler and Roque's lover, was fatally wounded in the escape by one of the Sovereign's Furies, Aja au Grimmus. Darrow and Sevro then assaulted a large space vessel, taking the bridge to command the rest of the ship. When they were almost overwhelmed by hostile forces, they were saved. The Stained known as Ragnar Volarus singlehandedly defeated the Golds assaulting the bridge, pledging his service to Darrow for conquering the ship and all on it. Darrow then renamed the ship, calling it the Pax after Pax au Telemanus. He also annointed Orion xe Aquarii, a Blue, as captain of the Pax, telling her to bypass the Sovereign's blockade. Afterwards, Sevro revealed his knowledge of Darrow's true status as a Red. Delivering a message from the still living Dancer and Ares himself, Sevro affirmed his support of Darrow's cause and their friendship. Darrow then reunited with Augustus and his allies, where they discussed their plans after plunging the Society into civil war.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 2,
    "source_book": "Golden Son"
  },
  {
    "text": "Here, Darrow met Daxo and Kavax, Pax's older brother and father, respectively. Speaking with Augustus, Darrow was able to predict his plan and agreed to it: an alliance with Lorn au Arcos. Recruiting the Rage Knight\n\nDarrow traveled to Europa, Lorn's domain, where he attempted to convince his teacher to side with him. Lorn refused, stating that he had chosen to live in neutrality and isolation with his remaining family. Lorn revealed that the Sovereign's forces were on Europa and attempted to help Darrow escape. Darrow refused, revealing that he knew about the presence of the Sovereign. He then ordered Roque to begin attacking the Sovereign's forces in orbit around Europa. Appearing as though Lorn betrayed Octavia, Darrow and Lorn were confronted by Tactus and Aja. Darrow used landmines to drive them off but Aja escaped, leaving Tactus behind. Lorn and Darrow then pursued Tactus, finding him ready to kill Lorn's grandchildren. Darrow was able to convince Tactus to stand down, apologizing for their broken relationship caused by Darrow's secretive nature. Tactus let Lorn's family go and embraced Darrow in reconciliation. Lorn, however, decided to kill Tactus anyway in retaliation for the younger man threatening his family. Regardless, Lorn allied himself with Darrow. Consolidating Power\n\nUpon returning to the fleet, Darrow learned of a betrayal by Pliny, an adviser for Augustus. He had defected to the service of the Sovereign and had brought several Golds with him. Having kidnapped and killed key allies, Pliny was now a threat to their rebellion. In response, Darrow stormed Pliny's ship and confronted the traitor. Here, he was able to convince Pliny's followers to return to his side, resulting in Pliny's death at the hands of his former allies. During this time, Darrow also informed Ragnar of his Red heritage, seeking his assistance by appealing to Ragnar to live as a free man. Having built enough military power, the next phase of the war against the Sovereign was enacted. The Jackal, controlling a large portion of all media outlets, broadcast a message across all available channels: the call for an Iron Rain on Mars, led by The Reaper. Various families then joined the rebellion against the Sovereign. The Iron Rain\n\nLanding in a drop pod, Darrow led a small force in the ground assault on Agea, Mars' capital city.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 2,
    "source_book": "Golden Son"
  },
  {
    "text": "With the help of contacts within the Sons of Ares, they were able to infiltrate the city through a weakened water grate. Pursuing the Sovereign herself, they were foiled when an EMP blast disabled their armor. Because of this, many from the strike force were drowned in the water channel or killed by enemy forces. Fortunately, Darrow was able to free himself and Ragnar. Together, they were able to save their remaining comrades and successfully mount a counter attack. Darrow then divided his forces into two groups: the Obsidians (led by Ragnar) who would open the gates of Agea and the Howlers who would help him find Octavia. The Howlers were forced to travel on foot through the city, moving at full sprint for over fifteen miles. Sevro acted as a scout, having obtained a pair of functioning gravBoots. He informed them of Ragnar's success in opening the gates, killing the Wind Knight and defeating Cassius (who had become the Morning Knight) in the process. Darrow then rushed ahead, fearing the Sovereign's escape. Leaping onto her ship, he stood before her and her protectors alone. Despite killing Karnus, he was soon overwhelmed and too injured to keep fighting. Octavia then sent Fitchner to execute Darrow. Delirious and defeated, Darrow awaited death. However, Fitchner rescued his former protege and donned the helm of Ares, revealing himself as the leader of the Sons. Unfortunately, Octavia was able to escape Mars, allowing her to gather her forces for retaliation against Darrow. Return to Lykos\n\nAfter the battle, Darrow met with Fitchner and Dancer. Accompanied by Sevro, they discussed the future of the Sons of Ares. Fitchner then decided that the time for war was near, promising Darrow the full support of the Sons' spy network. However, Darrow requested one thing before engaging in open conflict with the Society: the opportunity to see his family in Lykos. He returned to Lykos alongside Mustang, having Sevro and Ragnar follow them in secret. Under the guise of an administrative visit, Darrow observed the nightly celebration of the Reds as they enjoyed the extra food he had brought. After the festivities, he and Mustang traveled through the township on the way to Darrow's old home. Before entering, Darrow handed Mustang the recording of his Carving into a Gold. Darrow then went into his old house, seeing his mother for the first time in three years.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 2,
    "source_book": "Golden Son"
  },
  {
    "text": "She recognized him immediately, leading to a heartfelt reunion between the two. Darrow then proceeded to tell her about his activities among the Golds, revealing the truth about their slavery underground and his fight for Eo's dream. His mother then voiced her dislike for Eo as Darrow's wife, seeing her combative nature as potentially dangerous for her son. She also informed him that Narol had died and that both of his siblings had started families, surprising Darrow. When one of his nieces woke from her sleep, Darrow left while his mother made a prayer for his peace alongside the little girl. Darrow was then forced to confront Mustang in a mining tunnel. In disbelief about his true Color, she held him at gunpoint. Ragnar intervened, threatening to kill Mustang if she assaulted Darrow. Mustang then insulted Ragnar, challenging him to combat. Instead, Ragnar knelt down beside Darrow, having decided to live for more in freedom. Emboldened by Ragnar's support, Darrow then proceeded to ask Mustang what she lived for. Stunned by this display, Mustang fled Lykos and left Darrow. The Triumph\n\nIn honor of his victorious Iron Rain, Darrow received a grand parade on Mars. The event culminated in a banquet where his friends and allies were present. Darrow realized Mustang was not with them, secretly fearing that she had told Nero of his true identity. Regardless, he entertained guests, speaking with Roque who had brought him a gift. While with Roque, Darrow was injected with a tranquilizer by his friend. Unmasked as a spy, Darrow was forced to watch as his friends were killed as the Sovereign began her counter attack. Lorn attempted to rally the Howlers, but was stabbed to death by the Jackal and his lieutenant, Lilath. Victra was also injured, paralyzed as Antonia shot her twice in the spine before killing their mother. The Jackal then confronted Nero, revealing his part in killing Claudius, Nero's favored son. In his rage, Nero insulted the Jackal, stating that he should have smothered him in his crib. With the last vestige of hope for fatherly approval gone, the Jackal shot Nero in the head. Now alone, Darrow was forced to look at the gift Roque had brought: Fitchner's eyeless head in a box. Captured by the Jackal and his cohorts, Darrow was semi-conscious on the floor of a shuttle.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 2,
    "source_book": "Golden Son"
  },
  {
    "text": "Hearing of the Sovereign's plan to dissect him, he worried for Sevro, Ragnar and the Sons of Ares who did not attend the banquet.",
    "section": "Golden Son (741-742 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 2,
    "source_book": "Golden Son"
  },
  {
    "text": "The Rising\n\nDefeated by his foes, Darrow was held captive by the Jackal and his forces. Crammed into a chamber beneath a stone dinner table where the Jackal entertained guests, his mental state began to deteriorate due to the intense isolation. However, he proved unbreakable and endured nine months of imprisonment after three of torture. He was then handed over to Aja and Cassius for dissection to discover how he was Carved into a Gold. While they conversed, Darrow listened in and found that a \"Rising\" had begun to topple the Society. While undergoing sanitation for his transfer, Darrow was rescued by agents of the Rising: Gray soldier Holiday ti Nakamura and her brother, Trigg ti Nakamura. They then removed his bonds and gave him his engraved razor. Initially reluctant to believe them, Darrow was convinced when he met with Sevro over a datapad. Having become the new Ares, Sevro told Darrow to trust the Grays and escape the prison to fight the Society. However, Darrow refused to leave Victra, forcing them to divert in order to free her. Capturing Vixus au Sarna, a former housemate at the Institute, Darrow forced him to lead them to Victra's cell. They sedated a violent Victra, who attacked them despite being paralyzed from the waist down. Having no more use for him, Darrow then killed Vixus to send a message to the Jackal. Unfortunately, they were discovered by the Jackal's forces and had to fight their way to their extraction atop a landing pad. Pinned down, Darrow and Holiday were forced to watch Aja fatally impale Trigg. Enraged, Darrow dragged Holiday and Victra with him to the edge of the landing pad. Sending themselves into free fall, they were rescued by Sevro and Ragnar leading a small army of rebels. Having drilled through the city streets below, the Rising saved the trio in mid-air and withdrew into the tunnels beneath Mars. Among Friends\n\nDarrow then awoke in Tinos, the underground city of the Rising on Mars. He discovered that his family had been saved, allowing him to reunite with his mother and a living Narol. He also met with his siblings, having the chance to see his nephews and nieces. Dancer also spoke with Darrow, revealing Sevro's increasingly violent nature as leader of the Rising. Afterwards, he underwent a second Carving under Mickey alongside Victra.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "Having regained some semblance of his former strength, Darrow participated in several missions to retrain himself. Fighting with Reds under Narol's command known as the Pitvipers, Darrow primarily engaged in acts of sabotage. After some time, he was attacked in the shower after a work out with Victra. Their captors were revealed to be the Howlers, ready to induct both of them into their ranks. Both successfully completed the initiation rite and joined their comrades. This led to another mission: the kidnapping of Quicksilver, the richest man in the Society. Kidnapping Quicksilver\n\nThe Howlers then infiltrated the mining moon of Phobos with the help of contacts for the Rising. Silently entering Quicksilver's room, they found Matteo inside. Seeing him as a threat, Sevro promptly broke his jaw, angering Darrow. They then made their way to a meeting room where they found members of the Society negotiating with Mustang and the Telemanuses. The interruption turned into a large fight, resulting in the death of Moira au Grimmus, Aja's sister, and the Death Knight. Cassius himself was present, though he evaded capture by the Howlers. Instead, Kavax was detained as Mustang retreated, realizing that Darrow was among the intruders. She informed him of the strength his fleet had gathered, remaining under the command of Orion. The group then escaped, flying into space through a broken window with Quicksilver and Kavax in tow. They were saved by Holiday piloting a ship, who brought them to a safe area of Phobos occupied by the Rising. Kavax was then interrogated, revealing that Mustang had begun leading her own rebellion against the Society. Darrow also learned that Sevro had not been responding to communications from Mustang and Kavax's faction. Confronting Sevro for his brutality, their argument devolved into a brawl. Immediately after their fight ended, they reconciled after sharing the emotional burden of their war. For Darrow, he realized that Eo was flawed and that he could no longer use her as an excuse for their war. Instead, he had begun seeing their battle as one for the future of those still living. They then spoke with Quicksilver, who revealed himself as a founding member of the Sons of Ares alongside Fitchner. They formed a tumultuous alliance, accessing Quicksilver's vast resources. Realizing that the Jackal had discovered their presence on Phobos, the Howlers devised a plan to bolster their forces.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "Return of the Reaper\n\nDarrow and the Howlers then arrayed themselves in power armor, ready to begin a new phase in their rebellion. Taking control of communications on Phobos, Darrow made a speech inspiring the lowColors to fight against their oppressors. He then revealed his hands, showing the removal of his sigils as a sign of freedom from the control of the Society. The speech was successful, allowing the Howlers to start a massive battle against the Society's forces on the moon. However, this was not their true plan. Darrow, Holiday and Ragnar made their way to a hangar, intending to free Ragnar's fellow Obsidian from the frigid ice poles of Mars. They were intercepted by Mustang, who had correctly deduced their plan. She then joined them, affirming her belief in their shared cause. Aboard a ship provided by Quicksilver, they were able to reach the ice poles. Unfortunately, they were intercepted by another Society ship, resulting in a dogfight that caused both ships to crash. Death on the Ice\n\nHaving survived the crash, Ragnar led them to the wreck of the other ship. Inside, they were forced to kill cannibalistic Obsidians cast out from their tribes. Examining the evidence, they realized that Aja and Cassius were aboard the ship and had fled the cannibals. Tracking them, Darrow and his cohorts enacted a plan to kill both Olympic Knights. Despite capturing Cassius in their ambush, they realized that Aja was more lethal than they originally imagined. Dueling her, Ragnar was heavily wounded despite his continued assault. Darrow was too late to save his friend, watching as Ragnar was disemboweled by his opponent. They were saved by the timely intervention of the Valkyrie led by Sefi the Quiet, Ragnar's sister. Having fended off Aja, Sefi was reunited with her brother. Exchanging a heartfelt farewell with his sister, Ragnar rejected the Obsidian rite of dying gripping a weapon. Instead, he gathered snow in both hands as Darrow pierced his heart with his razor, ending his pain. Travelling with Sefi to the fortress of her tribe, Darrow and his allies were captured by Ragnar's mother, Alia Snowsparrow. Revealing the Truth\n\nAngered at the death of her son, Alia rejected Darrow's offer of war against the Society. Hoping to sway Sefi, they were allowed to travel to the mountain stronghold of the Obsidian \"gods\": disguised Golds meant to scare the Obsidians into obedience.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "Tricking the Golds, they were able to capture the false deities, revealing their deception to Sefi and her Valkyrie. Joining the Rising, Sefi returned to her tribe with the prisoners. Alia then attempted to rally the members of the tribe against her daughter, angered by her defiance. Seeing through Alia's lies, Sefi decapitated her mother before revealing the treasure that Alia had received to continue deceiving the Obsidians. She then executed the Golds one by one, shattering the clutches of the Society on the Obsidians. For this, Sefi was crowned queen and recruited many of the other tribes to join the rebellion against the Society. Transporting the Obsidian tribes to Tinos, the Rising instantly gained thousands of deadly warriors loyal to their fight. Despite this victory, Cassius revealed to Darrow that a stockpile of nuclear weapons belonging to the Sovereign had been stolen with the Jackal as the prime suspect. The House of Raa\n\nThe Rising then sought to ally itself with the Moon Lords, rebellious governors of the moons orbiting various planets. Meeting with their Sovereign, Romulus au Raa, Darrow and Mustang were brought to Romulus' home for negotiations regarding their alliance. There, they were confronted by their betrayer: Imperator Roque au Fabii, who had become a feared ship commander of the Sword Armada Following through on this display of honesty, Mustang also revealed that a nuclear weapons depot of the Society was emptied within the Rim Dominion. Angered by this apparent willingness to use force, Romulus then sided with the Rising and had Roque removed from his home. Confronted by his old friend, Darrow was angrily dismissed by Roque who held him accountable for the deaths of Quinn and Lea, another paramour of Roque at the Institute. Stating his support for the Society, Roque then returned to his fleet to engage the Rising and the Moon Lords in ship to ship combat. The Battle of Ilium\n\nThe Rising and the Sword Armada met in armed conflict in space with Orion leading the battle with Darrow aboard the Pax. Initially, it seemed as though Darrow had made a grave mistake, charging after Roque into the Sword Armada's battle formation. As the crew of the Pax abandoned ship, they prepared their surprise for the Society. Roque, aboard the Colossus, had begun engaging the Pax at a close range.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "This left his ship vulnerable to highly modified clawDrills hidden within the bowels of the Pax. Drilling through their own ship, Helldivers led by Darrow breached the hull of the Colossus to begin the real assault on Roque's vessel. Taken aback by this sudden offensive, the Society was initially incapable of fighting back as the newly trained Obsidians held the impetus of the charge to Roque. Unfortunately, several security measures aboard the Colossus held the Rising back despite their advance, leaving Darrow and several of his allies trapped right outside the ship's bridge. Unexpectedly, the door to the bridge was opened by a defiant Pink owned by Roque, allowing them to enter and trap the Poet. Unwilling to be dishonored by being captured, Roque committed suicide as Darrow and Victra looked on. With the battle won, Darrow decided to betray the Moon Lords, realizing the danger they posed to the Rising. The Colossus was then commanded to destroy the Ganymede Docks that served as their source of power. Not wanting Darrow to commit another atrocity, Victra issued the order to annihilate the shipyards in his stead. They were frantically contacted by Romulus, who believed Roque was still in command of the Colossus. Completing his deception, Darrow blamed the order on Roque, ensuring the Rising's safety from the wrath of the Moon Lords. Then, it was decided that the Colossus should be renamed. At Sefi's suggestion, it was called \"Morning Star\", honoring the star that Obsidian travelers use guide their way across the ice in winter. Afterwards, Darrow and the Howlers had a small funeral for Roque, even having Cassius present as they were all members of House Mars. Despite their hostility towards the traitor, they respectfully shot his body into space while Darrow recited a poem for his fallen friend. Once they were alone, Darrow wept for Roque with Mustang by his side. The Spirit of Ragnar\n\nAfter the battle, Darrow and Sevro were summoned by Victra. Having hunted down her sister, Victra had finally established herself as the rightful heir to the Julii fortune. This left her allies unsettled, seeing her sudden independent streak as a potential threat to the fragile peace keeping the Rising together. Despite these suspicions, Victra remained a loyal ally and lent her family's resources to the fight against the Society.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "Leaving the territory of the Moon Lords, Darrow was then contacted by the Jackal himself. Adrius revealed that he had captured Narol, executing him in front of his nephew. Unfortunately, the exchange was broadcast across the Rising's fleet, causing tensions between Golds and other Colors to flare. Riots ensued where multiple Golds were killed with Sefi herself leading the violence. Confronting the Obsidian, Darrow saw that she had severely beaten a restrained Cassius. He attempted to reason with Sefi, citing her savagery as opposing her brother's vision of peace. Sefi disagreed, viewing her attack against the Golds as justified payment for their crimes. Darrow then watched as Sevro intervened, throwing himself and Cassius off a platform with nooses around their necks. Sefi was then forced to save both of them to stop the riots, bringing Ragnar's dream for the Obsidians to fruition. Recovering in the infirmary, Sevro stated that he saw himself and Cassius as scared soldiers who simply fought for what they believed in, impressing Mustang with his sudden maturity. Afterwards, Victra entered, forcing the others to leave as she proposed marriage to Sevro. In the following week, the ceremony took place with Mickey as officiant. During the reception, Adrius contacted Darrow again. This time, Mustang interrupted their meeting, her and Darrow both expressing pity for the Jackal as he was alone despite his immense influence. Afterwards, Darrow had Holiday bring Cassius to him. Both men spoke while watching videos of their time at the Institute, discussing their lasting enmity and continued war. The meeting ended amicably as Cassius secretly received a recording from Darrow. Breaking the Chains\n\nWith the Sword Armada beaten, the Rising chose to take the fight to Octavia herself. Preparing for an assault on Luna, Darrow and Mustang devised a plot to end the war with the help of Sevro and Mickey. Seeking information, they turned to a captured Antonia and Thistle, an ex-Howler. Receiving an ultimatum that whoever gave the Rising intel would be spared, Antonia used the situation to her advantage and murdered Thistle. Angered by her sister's brutality and selfishness, Victra entered Antonia's cell and shattered her face. Going through Thistle's belongings, the Howlers discovered her old wolf skin and mourned her despite her betrayal. After some time, Darrow decided to free Cassius.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "With Sevro and Mustang, they allowed him to leave the fleet with a ship but were surprised when Cassius fought back. Disarming Sevro, Cassius then shot him in chest before holding Darrow and Mustang hostage. Once again, Darrow was separated from the Rising as Cassius and Antonia escaped. Disarmed, he and Mustang were brought to Luna with Sevro's corpse. In chains, they were brought to the Sovereign's Citadel to be tried as rebels. Brought before the Jackal, Darrow was enraged when he realized that Adrius had been wearing Fitchner's ribs as part of his armor. In response to this outburst, the Jackal had Darrow's right hand cut off, revenge for Darrow forcing the Jackal to sever his own hand during their time at the Institute. Afterwards, Darrow was brought to Octavia, who had Antonia murdered for her desertion of Roque. She then turned to Darrow, sentencing him to death for his actions against the Society. With the execution to be broadcast throughout Society space, Darrow howled in rage as the Jackal fired Sevro's pistol into his head. However, the pistol was loaded with blanks, saving Darrow and allowing Cassius to free him and Mustang. Darrow then mortally wounded the Sovereign, stabbing Octavia multiple times as she reeled from Cassius' betrayal. Forced to confront Aja in a losing battle alongside Cassius and Mustang, Darrow then revived Sevro, who had been wearing a vest of false flesh and blood created by Mickey. In the ensuing struggle, Aja was decapitated by an elated Sevro, having achieved vengeance for the Howlers she killed. As Octavia lay dying, Cassius and Darrow confronted her for having deceived and murdered so many. Cassius revealed that the recording he received was the massacre of the majority of his family. Seeing Octavia's complicity, he realized the corruption of the Society. However, Octavia was unapologetic, explaining her actions as being necessary to maintain peace and order before finally expiring. Confronting the Jackal, they realized that he had indeed stolen hundreds of nuclear weapons now in place across Luna. With Lilath holding the detonator, Darrow and his allies could only watch as the bloodshed began. With millions dying on the Jackal's orders, Darrow was issued an ultimatum by Adrius: commit suicide or allow the slaughter to continue. Instead, Darrow beat Adrius, pinning him to the ground before ripping the Jackal's tongue out with his bare hands.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "They then contacted ArchImperator Magnus au Grimmus, the Ash Lord and leader of the Society's military forces. With Lysander's help, Mustang convinced him to destroy the Jackal's ship with the help of the Rising, killing Lilath and ending the nuclear threat. With the Jackal defeated, Darrow watched as Mustang marched into the Senate with the Sovereign's Dawn Scepter in hand. Possessing this symbol of power, she became Octavia's successor and cemented the Rising's victory over the Society. In the following weeks, Darrow accompanied Mustang to the Jackal's hanging. Here, she alone pulled her brother's feet. Shortly after, they traveled to Earth where Mustang revealed that she had given birth to their son during Darrow's time in prison. Named Pax, Darrow vowed to tell him of the friends who fought alongside him because of the dream they shared with a Red girl named Eo.",
    "section": "Morning Star (743 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 3,
    "source_book": "Morning Star"
  },
  {
    "text": "Endless War\n\nDespite the demise of the Society and his marriage to Mustang, Darrow did not find peace. For the next decade, he led the Rising against the remaining Society loyalists controlled by the Ash Lord. Under the newly named Solar Republic, Darrow battled the Ash Lord as the ArchImperator of the Republic. His reputation as the Reaper of Mars grew, having defeated the remnants of the Society until only Magnus remained.",
    "section": "The Solar War (743-753 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "A Request for Men\n\nHowever, these victories came at a great cost. To take Mercury, Darrow and the Howlers fell in another Iron Rain to bypass the planet's defenses. Despite their victory, one million of the Republic's soldiers fell in battle. Returning to Luna, it was discovered that the Ash Lord had sent emissaries for peace talks with the Republic. Darrow revealed that he knew about the emissaries but did not inform the Senate or Mustang. Seeing the peace talks as a ruse, Darrow and the Howlers decided to escape Republic forces to assassinate the Ash Lord. Estranged from his son, Darrow spoke to Pax before attempting to leave, promising to return. However, he was stopped by Mustang. She pleaded with him to stand with her against Dancer, who was now a Senator encouraging negotiations with the Ash Lord. Refusing to listen, his actions forced Mustang to capture him. Surrounded by the elite peacekeepers known as Wardens, Darrow fought back despite the overwhelming odds and escaped. Tragically, he accidentally killed Wulfgar, the Obsidian leader of the Wardens, during the battle. Having slaughtered a hero of the Republic, the Reaper was now a wanted fugitive. Unleashing the Minotaur\n\nThe Howlers journeyed to Earth, seeking to infiltrate the underwater prison known as Deepgrave. Successfully bypassing the prison's defenses, they attempted to extract a prisoner who could grant them the resources needed to assault the Ash Lord's fortress on Venus. Entering the prisoner's cell, they encountered an Obsidian they decided to call Tongueless (whose tongue was cut out) who helped them threaten the warden of Deepgrave. The warden revealed the location of the prisoner, allowing Darrow and the Howlers to free him: Apollonius au Valii-Rath, the Minotaur of Mars and Tactus' older brother. Tricking the Apollonius, the Howlers complete their mission by extracting him and decide to bring Tongueless with them. On board their ship, Darrow and Sevro revealed their true identities. Confronting Apollonius, they appealed to his vanity and agreed to give him Venus so long as he helped them kill the Ash Lord. Apollonius agreed, taking up his old armor as they planned their attack on the Ash Lord. Ashes to Ashes\n\nWhile preparing equipment for their mission on Venus, Darrow and Sevro got into a heated argument. Sevro feared that the plan risked too much, accusing Darrow of having fallen to his ego.",
    "section": "Iron Gold (753 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 4,
    "source_book": "Iron Gold"
  },
  {
    "text": "Darrow countered, seeing Sevro's fear as cowardice and viewing their actions as necessary to end the war. Despite this, the mission continued as Apollonius reclaimed his family's resources from his brother, Tharsus. Beginning their attack, Darrow led the Howlers in infiltrating the Ash Lord's island stronghold while Apollonius struck with a full frontal assault. Despite the distraction, the Howlers were almost overwhelmed by the Ash Lord's soldiers. They were saved by Apollonius, who had broken through the defenses at the beachhead. Confronting Magnus himself, they discovered that their foe was a sickly old man confined to his bed. The Ash Lord revealed that he had been poisoned three years beforehand by Apollonius. The Minotaur confirmed this, seeing it as revenge for the old man abandoning him to the Republic. Darrow realized that the Ash Lord could not have been responsible for recent events, questioning his foe about his replacement as leader of the Society's remnants. The Ash Lord then poisoned himself with cyanide but not before revealing that Atalantia, Aja's sister and the last Fury, had taken up his mantle in the war against the Republic. As he weakened, Magnus also revealed that Darrow's son and Sevro's eldest daughter, Electra, had been kidnapped. With the Republic in chaos, Atalantia's victory would come easily. In revenge, Darrow refused to let the Ash Lord die slowly, allowing Apollonius to burn the man alive with chemicals and candles. Leaving the ruins of the fortress, Darrow resolved to confront Atalantia's armada while Sevro sought out their children. Sevro snapped at Darrow, refusing to follow Darrow any longer for he did not wish to become a soldier like Fitchner. Aboard the Ash Lord's shuttle, Darrow and the few remaining Howlers set off for Mercury, where the 7th Legion loyal to Darrow was stationed.",
    "section": "Iron Gold (753 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 4,
    "source_book": "Iron Gold"
  },
  {
    "text": "Breaking their Backs\n\nUpon making contact with the Free Legions, Darrow and the remaining Howlers realized that Orion had been captured by Atalantia. They then launched a rescue mission, battling their way through the heart of the Society fleet to save their ally. The mission was ultimately successful but ended with the death of Tongueless at the hands of Ajax, the son of Aja. With Society forces gradually closing in, Darrow and the Howlers managed to retrieve a secret weapon beneath Mercury's surface: a Storm God (an ancient terraforming machine). Repairing the Storm God with the help of Master Maker Glirastes and Harnassus (Orange commander of the Free Legions in Darrow's absence), the remaining Republic forces were able to manipulate the planet's weather to their advantage to cripple the Society's fleet as Orion synced with the terraformer. Darrow led the Howlers, sweeping away approaching Society forces approaching the city of Tyche under the cover of the storm. While they managed to turn the tide of the battle, Orion became unhinged and drowned the city of Tyche. This forced Darrow to kill Orion using a fail safe he had implanted in case she disobeyed his orders while using the Storm God. During this events, some explorers came with a captured member of the Legio XX Fulminata, who actually was Screw Face, who was carved and put in the legion as an spy for the republic. Alexander tells Darrow that he and his knights will rescue the survivors of Tyche. Darrow believes Alexander will die on the mission, but commends his bravery by giving his own wolf cloak to Alex. Then, with Screw face back and the rest of his forces, Darrow marched through the Ladon in direction to Heliopolis, where he fighted in the defence of the city after a brief confrontation with Atlas au Raa. During the siege of Heliopolis, the Free Legions, led by Darrow, succesfully defended heliopolis from the attacks of the legio X pardus. He worked with Glirastes the Master Maker to create a special weapon that could help Darrow and his free legions brake through Atalantia's siege and leave Mercury. Darrow was present when Alaxandar au Arcos returned to Heliopolis with a golden called Cato au Vitruvius and the knight of fear, Atlas au Raa himself as a hostage. Suspecting from Cato, who seem to be a Glirastes' old friend, Darrow lead the Cato's interrogation himself.",
    "section": "Dark Age (753-754 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 5,
    "source_book": "Dark Age"
  },
  {
    "text": "Due to the lack of evidence indicating that Cato was anything more than a pixie, Darrow allowed him to live with Glirastes, but keeping an eye on him. However, it was something suspicious in the kid, and a phrase said by Cato made Darrow have an idea. He rushed at Sevro's cabin in the Morning Star, and took a blood-stained tunic that belonged to Octavia au Lune. After making a DNA test comparing Octavia's blood with Cato's, he discovered that Cato au Vitruvius was in fact Lysander au Lune, Octavia's grandchild, who he spared his life 10 years ago and put under the protection of Cassius au Belona. Knowing that, Darrow informed all the Howlers and lead an assault on Gliraste's house, only to find Alexandar's corpse and a wounded Rhonna. He lead the Howlers on a persecution to capture or kill Lysander, ordering Harnassus to arrest Glirastes, but Lysander activated Glirastes' EMP, shutting down all electronic devices in Heliopolis, starting The Long Night. Darrow was wounded in the cavalry charge led by Lysander, who forced him to flee in a horse. Then Lysander started a persecution that finished in a clash where Lysander broke Darrow's scythe, the one that Mustang gave him, and stabbed him with Alexandar's razor. He then fled to republic positions, where he Picked a handful of dirt from Lyko, waiting his death, when the Arquimedes arrived with Cassius and they evacuated the planet. Light Bringer \n\nAfter fleeing Mercury with the help of Cassius and his ship the Archimedes, Darrow and the remnants of the Free Legions become stranded on Icarus base, an old Sons of Ares base 200 million kilometres from Mars. They repair the Archimedes by taking turns welding the hull and being exposed to the radiation outside of the ship. Eight months after becoming marooned, their position is discovered by a society Torch Ship. Fearing attack they gather arms and prepare for battle. Screwface soon warns them the ship is not run by the Society, but by the Blue pilot Colloway xe Char who had been abandoned with the rest of the Legions on Mercury. Colloway brings news that Sevro has been sold in auction by the Syndicate to the Minotaur on Venus, who sends a message to Darrow that he has 3 months to retrieve Sevro before he is killed.",
    "section": "Dark Age (753-754 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 5,
    "source_book": "Dark Age"
  },
  {
    "text": "Upon receiving this news, Darrow begins making plans of rescuing Sevro alongside Cassius and Aurae, a former Pink Hetaerae in the Raa household who helped Cassius escape Europa. The rest of Darrow's companions oppose him, and bar his way to the Archimedes, but relent and let him go, while they proceed to Mars on Colloway's ship. Thraxa gives Darrow her family's ancestral razor, Bad Lass. Darrow, Cassius and Aurae proceed to the Venusian Dockyards under the cover of the special cloaking tech that the Archimedes has been fitted in.",
    "section": "Dark Age (753-754 PCE)",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising",
    "book_number": 5,
    "source_book": "Dark Age"
  },
  {
    "text": "Eo of Lykos\n\nDarrow's wife while he was a LowRed, Eo knew Darrow when they were both children, and waited to marry him, despite being eligible for marriage three years earlier. Darrow was devoted to her and did his utmost to provide for her and ensure her comfort and happiness. Her death caused enormous emotional distress for Darrow, and is the catalyst for his infiltration of Gold Society and eventually, for Darrow's role in The Rising itself.\n\nIn Golden Son, Harmony uses the secret that Eo was pregnant at the time of her death to persuade him to commit to a suicidal plan that would cause massive civilian casualties. It is the knowledge of her pregnancy that refuels Darrow's quest for revenge against the Golds.\n\nIn Morning Star, Darrow finally stops using Eo as an excuse for revenge, and instead as a symbol of living for more.\n\nVirginia au Augustus\n\nKnown to Darrow as Mustang, Darrow met her a few times before the Institute, but there, they were initially on opposing sides. However, Darrow comes to respect her, and allows her to escape the fall of House Minerva against his own forces, concerned of what his allies would do to her. Later, Mustang repays him by helping to nurse Darrow back to health when he is betrayed and stabbed in the stomach by Cassius.\n\nDarrow and Mustang forge a deep connection at the Institute, though they are at times at odds, with Darrow torn between guilt and his feelings for Mustang, and Mustang and Darrow having an ideological difference that pits them against one another. Eventually however, Darrow is able to win Mustang's trust and respect again, and they fight side by side to change the Society.\n\nIt is revealed in the end of Morning Star that she and Darrow have a son together named Pax, named for their old friend from the Institute.\n\nPax au Augustus\n\nDarrow's only son by Mustang. \n\n'''Deanna O'Lykos'''\n\nDarrow's mother.\n\nDale of Lykos\n\nDarrow's father, executed when Darrow was very young. Apparently bears many similarities to Darrow.\n\n'''Kieran O'Lykos'''\n\nDarrow's brother and a mechanic after the formation of the Solar Republic.\n\n'''Leanna O'Lykos'''\n\nDarrow's sister.\n\n'''Rhonna O'Lykos'''\n\nDarrow's eldest niece, and a Drachenjäger pilot. Fights alongside Darrow in the Iron Gold trilogy.",
    "section": "Family",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Sevro au Barca\n\nDarrow's best friend, Sevro originally was viewed by Darrow as a rather odd individual, as Sevro demonstrated several eccentric behaviors and responded erratically to authority. Eventually, he becomes one of Darrow's most capable and loyal lieutenants, both inside and outside the Society. Sevro is summoned to Pluto during Golden Son after the Institute. When Darrow and Sevro are reunited, and Sevro reveals he knew about Darrow's Red heritage, bringing great relief to Darrow and affirming their deep friendship in Golden Son. Sevro continues to look for Darrow and fight for his cause when Darrow is captured by the Jackal, and even implants Darrow's eyes from his life as a Red into himself, as a sign of loyalty and connection to him. Cassius au Bellona\n\nA brother-in-arms of Darrow prior to learning that it was Darrow who was forced into killing his twin brother, Julian. Cassius becomes consumed with a desire to avenge his brother, and betrays Darrow in the Institute, though Darrow is able to survive and claim victory. Later, Cassius fights against Darrow and The Rising, with the two developing a bitter hatred for one another. Eventually, Cassius is captured by Darrow and comes to reconcile with him, forgiving him for the death of his brother, and working with him to bring down the Sovereign. Cassius leaves into self-exile, but parts with Darrow on good terms. Victra au Julii\n\nShe enters the story in the beginning of Golden Son where she was part of Darrow's fleet in the Academy. Since then, she was open to her attraction to Darrow but she also knew her chances with him were little to none. Nonetheless, despite Darrow's initial trust issues with her, he comes to view her as one of his most loyal lieutenants. Victra is captured alongside Darrow, but never gives up even when subjected to torture. In exchange, Darrow refuses to be rescued unless Victra is saved as well. He is present at her wedding and is happy for her and for her husband, Sevro. She is present at the end of the series, with Darrow remarking on her loyalty, and promises to tell his son about it someday. Tactus au Valii-Rath\n\nOne of the Golds Darrow encounters in the Institute, Darrow has a complex relationship with Tactus.",
    "section": "Friends",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "While Tactus eventually joins Darrow and House Mars in the Institute, he proves to be a vicious and difficult ally, and causes trouble for Darrow through his insubordination. Darrow wins his respect when he whips him, and then shares his pain by having himself whipped as well. He helps Darrow achieve victory and proves to be an able fighter. In Golden Son Tactus initially aids Darrow against the Bellona and the Sovereign, but begins to doubt Darrow's cause and feels alienated by him. He betrays Darrow and attempts to barter his way back into the good graces of the Sovereign. Darrow and Tactus are able to reconcile, with Darrow realizing how he has alienated his friends and allies, but Tactus is executed by Lorn shortly after. Roque au Fabii\n\nOne of Darrow's close friends at the Institute, Darrow appreciated Roque's calm, poetic nature, and they worked well together at the Institute. Roque is initially one of Darrow's staunchest and most capable allies, and tries to comfort him when Darrow is to be auctioned. However, Roque betrays Darrow when he learns that he is a Red and holds him to blame for Quinn's death, and is one of the primary causes for Darrow's downfall in Golden Son. Roque is a formidable opponent against Darrow in Morning Star, and fights for the supremacy of the Golds. Darrow defeats him, and a broken, dispirited Roque commits suicide, much to the anguish of his former friend who gives him an honorable funeral. Ragnar Volarus\n\nOne of Darrow's most trusted generals and closest friends, the two met in Golden Son when Darrow took over the Colossus. Originally intended as a present for the Ash Lord, Darrow was impressed initially by Ragnar using a bureaucratic loophole to justify his servitude to Darrow. Ragnar felt guilty due to the level of autonomy Darrow granted him, which led to Darrow revealing that the two were both slaves once, and releasing Ragnar from his oath of servitude. In Morning Star, Ragnar proves his ultimate loyalty to Darrow when he makes Darrow his brother by way of a Stained blessing, and by fighting Aja au Grimmus - to his own demise.",
    "section": "Friends",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Lorn au Arcos\n\nNero au Augustus\n\nDarrow was one of Nero's Lancers, and his son-in-law. Just before the massacre at Darrow's Triumph, Darrow was set to become the heir of House Augustus in place of Adrius au Augustus.\n\nRegulus ag Sun",
    "section": "Allies",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Adrius au Augustus\n\nOctavia au Lune\n\nAja au Grimmus\n\nRomulus au Raa\n\nAtlantia au Grimmus\n\nLysander au Lune\n\nAjax au Grimmus\n\nApollonius au Valii-Rath",
    "section": "Enemies",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Darrow has accumulated many names, nicknames and titles throughout his life. The following is a tentative list of them:\n*L17L6363 - In the time of the Society's rule, lowReds had no true names, only designation numbers. This was also his prisoner number while in the Jackal's prison.\n*Darrow au Andromedus - The official, albeit falsified, Gold name registered for him by Dancer. Andromedus was a relatively poor and unknown gold asteroid mining family. After the real Andromedus family perished in an accident, the Sons of Ares changed the records to make Darrow its sole living member.\n*The Reaper (of Mars) - Darrow's most famous alias, gained during his time at The Institute for carrying his sickle-shaped slingBlade, which the Golds recognized as a reaper's scythe. In Red culture, the Reaper is a psychopomp who judges the sins of the dead in the Vale.\n*Howler One - Codename used within the Howlers, with Sevro being Howler Two.\n*Tyr Morga - Lit. \"Morning Star\", in the Obsidian language of Nagal. It was given to Darrow after he helped Sefi unite the Obsidian Clans in Morning Star. \n*'''ArchImperator O'Lykos - His profession since the founding of the Solar Republic until he became a wanted fugitive of his own Republic.\n*The Slave King - '''Derogatory term used by the opponents of the Solar Republic describing how, as a LowRed slave, Darrow managed to become a powerful figure.",
    "section": "Names",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "Evillienne Darrow.jpg\nDarrow-050316.jpg\nDarrow merwild.jpg\nDarrow-by-parisa.jpg\nDarrow gabriellabujdoso faecrate.PNG\nDarrow vimesart.jpg\nDarrow nirusky.jpg\nDarrow-howler-niktropolis.jpg\nHauntedwidget fan art carnage of the sunbloods.png",
    "section": "Gallery",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "* Pierce Brown has stated in an interview that he would imagine Darrow to have a British accent.\n* In an interview, Pierce confirmed that the literary classic character Darrow is most similar to is Edmond Dantes of Alexander Dumas' The Count of Monte Cristo. \n* Darrow states that he is twenty at the start of Golden Son and twenty-one at the end. Later novels retcon the gap between Red Rising and Golden Son to three years instead of two, so that he's twenty-one at the start of the second novel.",
    "section": "Trivia",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "* '''I would have lived in peace. But my enemies brought me war.' - Red Rising, Prologue\n* 'I was forged in the bowels of this hard world.' - Red Rising, Prologue\n* 'I am my father's son.' - Red Rising, Ch. 1: Helldiver\n* 'My people sing, we dance, we love. That is our strength. But we also dig. And then we die. Seldom do we get to choose why. That choice is power.' - Red Rising, Ch. 6: The Martyr\n* 'I am Darwin's scythe. Nature scraping away the chaff.' - Red Rising, Ch. 19: The Passage\n* \"They want me pitiless. They want my memory short. But I was raised differently.\" - Red Rising, Ch. 20: The House Mars\n* 'Some things do not fade. Some things can never be made right.' - Red Rising, Ch. 25: Tribal War\n* 'I break everything.'- Red Rising, Ch. 26: Mustang\n* 'Mars has come!' - Red Rising, Ch 26: Mustang\n* 'Security and justice aren't given. They are made by the strong.'- Red Rising, Ch. 27: The House of Rage\n* 'I am the Reaper and death is my shadow.' - Red Rising, Ch. 32: Antonia\n* 'Live for more.' - Red Rising, Ch. 34: The Northwoods\n* 'The measure of a man is what he does when he has power.\" - Red Rising, Ch. 36: A Second Test\n* 'Or perhaps they think I'm still a child. The fools. Alexander was a child when he ruined his first nation.' - Red Rising, Ch. 42: War on Heaven\n* 'Funny how a single word can change everything in your life.' - Red Rising, Ch. 44: Rise\n* 'For seven hundred years, my people have been enslaved without voice, without hope. Now I am their sword.' - Golden Son, Prologue\n* 'They say a kingdom divided against itself cannot stand. They made no mention of the heart.'​ - Golden Son, Prologue\n* 'Let him welcome me into his House, so I might burn it down.' - Golden Son, Prologue\n* 'I am of the Peerless Scarred. Cruelest and brightest of all humankind.' - Golden Son, Ch. 1: Warlords\n* 'In a world of killers, it takes more to be kind than to be wicked.' - Golden Son, Ch. 11: Red\n* \"Per aspera ad astra.\" - Golden Son, Ch.",
    "section": "Quotes",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "18\n* 'Momentum is everything to a Helldiver, to military endeavors, to life. Keep moving and dare someone to get in your path.' - Golden Son, Ch. 35: Teatime\n* 'Brothers. All water. All flesh. All made from and bound for the dirt.' - Golden Son, Ch. 34: Blood Brothers\n*'Make your blood proud long after death claims you.' - Golden Son, Ch. 36: Lord of War\n* “Tell all who will hear, the Reaper sails to Mars. And he calls for an Iron Rain.” - Golden Son, Ch. 35: Teatime\n* \"Forget a man's name and he'll forgive you. Remember it, and he'll defend you forever.\" - Morning Star, Ch. 11: My People\n* \"Dare to dream of better worlds than these. Slavery is not peace. Freedom is peace. And until we have that, it is our duty to make war.\" - Morning Star, Ch. 23: The Tide\n* \"We are not Red, not Blue or Gold or Gray or Obsidian. We are humanity. We are the tide. And today we reclaim the lives that have been stolen from us. We build the future we were promised. Guard your hearts. Guard your friends. Follow me through this evil night, and I promise you morning waits on the other side. Until then, break the chains!\" - Morning Star, Chapter 44\n* \"If you're watching, Eo, it's time to close your eyes. The Reaper has come. And he's brought hell with him.\" - Morning Star, Ch. 46: Helldiver\n*\"Well, here I am, you deviant bitch. Here I bloody am. The motherfucking consequence.\" - Dark Age, Prologue\n*“I would die for the truth that all men are created equal. But in the kingdom of death, amidst ramparts of bodies and wind all of screams, there is a king, and his name is not Lune. It is Reaper.” - Dark Age, Chapter 84: Meat Straw''",
    "section": "Quotes",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  },
  {
    "text": "es:Darrow\nhu:Lykosi Darrow\ntr:\nCategory:Characters\nCategory:Reds\nCategory:Red Rising Characters\nCategory:Morning Star Characters\nCategory:Golden Son Characters\nCategory:Golds\nCategory:Males\nCategory:Iron Gold Characters\nCategory:Sons of Ares\nCategory:Dark Age Characters\nCategory:Light Bringer Characters\nCategory:Book of Lorn characters",
    "section": "References",
    "name": "Darrow O'Lykos",
    "type": "characters",
    "series": "RedRising"
  }
]