[
  {
    "text": "}}\n\n*Levi Pinfold (UK) \n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Jim Kay (Illustrated Edition)\n*Olly Moss (Pottermore eBook)\n|interior=*Mary GrandPré (US)\n*Levi Pinfold (UK) \n*Jim Kay (Illustrated Edition)\n|narrator=*Stephen Fry (UK)\n*Jim Dale (US)\n|publisher=*Bloomsbury (UK, Canada)\n*Scholastic (US)\n*Raincoast Books (Canada (formerly))\n*Yapı Kredi Yayınları (Turkey)\n|release date=*2 July 1998 (UK)\n*2 June 1999 (US)\n*1 May 2001 (Turkey)\n|pages=*360 (UK)\n*341 (US)\n*314 (Turkey)\n|preceded by=\n|followed by=\n}}\n\nHarry Potter and the Chamber of Secrets, by J. K. Rowling, is the sequel to . It is the second book in the series of seven Harry Potter'' books. The book was published in 1998. A film was theatrically released in November 2002.",
    "section": "General",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "\"For Séan P. F. Harris, getaway driver and foul-weather friend\"\n\nEscape came in the form of a new pupil at Wydean Comprehensive, Sean Harris, who quickly became a firm friend. In 1982, he drew up outside the family home in his blue Ford Anglia and whisked Jo Rowling away from the grim stillness of Tutshill to the concerts and bars of Bristol. He would park under the Severn Bridge and together the pair dreamed up better futures for each other. Harris’s blue Ford Anglia would become immortalised in Rowling’s fiction as Ron Weasley’s family car and he would be described in the dedication in her second book as \"getaway driver and foul weather friend\".",
    "section": "Dedication",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "\"Ever since Harry Potter had come home for the summer, the Dursleys had been so mean and hideous that all Harry wanted was to get back to the Hogwarts School of Witchcraft and Wizardry. But just as he is packing his bags, Harry receives a warning from a strange impish creature who says that if Harry returns to Hogwarts, disaster will strike.\n\nAnd strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor and a spirit who haunts the girl's bathroom. But then the real trouble begins - something is attacking Hogwarts students, making them rigid like statues. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past reveals dark secrets? Or could it be the one everyone at Hogwarts most suspects ... Harry Potter himself!\"",
    "section": "Book description",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry Potter has returned to the Dursleys for the summer holiday in mid-1992, and things are very bad for him. Over the summer, the Dursleys have become so fearful of Harry's new-found magical abilities that they have locked away all of Harry's magical supplies (e.g. his wand, his broomstick, spellbooks, etc.) immediately after his arrival home. They have also banned Harry from saying words such as \"magic\" in the house, as is evident in Uncle Vernon's outburst about Harry saying \"say the magic word\" (meaning \"please\"). Harry begins to worry about what his teachers at Hogwarts School of Witchcraft and Wizardry will think if he heads back to them without back homework done, and whether or not he'll be banned from the Gryffindor House Quidditch team since he has not been able to practise. The Dursleys have, however, let him keep his pet snowy owl Hedwig, but have put a padded lock on her cage to keep her inside day and night to avoid suspicion from the neighbours. Naturally, this does not go well for the bird. Every time she gets bored, her screech rings throughout the house, causing an irritated Vernon to warn Harry that if he cannot control her, she will have to go.\n\nOn July 31 (Harry's twelfth birthday), Harry has never felt so lonely, for he misses Hogwarts and his best friends there, Ron Weasley and Hermione Granger. Neither of them have written to him all summer, not even to send birthday wishes. The Dursleys seem to have also forgotten his birthday, as they are busy preparing for a dinner party for one of Uncle Vernon's clients, Mr Mason, from whom Vernon is hoping to get a huge order. The only thing that the Dursleys care about is that Harry has to stay in his room for the night, making no noise and \"pretending he doesn't exist\". While Uncle Vernon and his son Dudley are preparing to drive into town to buy dinner jackets, Harry goes out into the garden in order to stay out of his Aunt Petunia's way as she is cleaning, singing happy birthday to himself. He stares into the hedge and sits bolt upright when he sees a pair of enormous green eyes staring back at him from among the leaves. When Dudley comes waddling over and starts mocking him for not receiving a party on his birthday, Harry gets annoyed and scares him away by pretending to think out loud of a spell meant to make the bush bare. Unfortunately, Petunia comes out when Dudley calls for her and beats her nephew with a soapy frying pan. She then gives Harry some chores to do while Vernon and Dudley are gone, and once he is finished, it is almost a half-hour before the Masons are due to arrive. Harry goes up to his room without making a sound during the party as promised, but when he gets there, someone else is on his bed.",
    "section": "Chapter 1: The Worst Birthday",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "The thing on his bed, a house elf named Dobby who was behind the mysterious eyes Harry saw, tells Harry that he must not go back to Hogwarts, as it will be dangerous because terrible things are going to happen there. The elf, however, can't tell him what things, and continues to be vague because every time he gets close to letting something slip he starts hurting himself. In the process, he makes a lot of noise, which is noticed by the group downstairs. When he hears Uncle Vernon coming upstairs (claiming that Dudley must have left the TV upstairs on), Harry hides the elf in his closet right before Vernon comes in and scolds his nephew for making such a racket which has messed up the punchline of his \"Japanese golfer joke\". He lets Dobby out as soon as his uncle leaves, and insists that he has to go back to Hogwarts since that's where he has friends despite them not writing to him. But to his surprise, Dobby then reveals that he has stopped letters being sent to Harry, and offers them to him if Harry will stay away from Hogwarts. Harry refuses and, making a frustrated Dobby run downstairs and use a Hover Charm to smash the dinner party's pudding.\n\nHarry is blamed for the incident once Dobby Disapparates, and Uncle Vernon shoos the shocked Masons into the dining room while Harry cleans up, promising to deprive the boy of an inch of his life. The evening is almost saved until an owl from the Ministry of Magic is promptly received (scaring away Mrs Mason, who is mortally afraid of birds) with a warning saying that Harry has violated the Decree for the Reasonable Restriction of Underage Sorcery, though he is not actually punished (possibly because it is only his first offence). After realising that Harry is not allowed to do magic outside of Hogwarts grounds, Uncle Vernon locks Harry in his room. Vernon reasons that if Harry uses magic to get himself out, he will be expelled anyway.",
    "section": "Chapter 2: Dobby's Warning",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "The Dursleys' punishment lasts for three days, until Ron, Fred, and George Weasley, worried about not hearing from Harry all summer, borrow their father's flying Ford Anglia and come to the rescue. They break the metal bars off Harry's window and help him to pick the lock to his door so he can get his Nimbus 2000 and trunk. The Dursleys discover his escape attempt, but by the time they can intervene, Fred, George, Ron and Harry have got everything of Harry's and have flown away. On the flight to The Burrow, Harry explains Dobby's warning. They all agree that it is very fishy and speculate that Dobby most likely belongs to the Malfoys who sent Dobby to Harry as a joke, since the Malfoys are an old wizarding family of great wealth. Fred and George tell Harry that Lucius Malfoy formerly worked for Voldemort but claimed that the Dark Lord bewitched him after Voldemort lost his powers. Harry is taken to The Burrow, the Weasleys' home, and he finds the house truly amazing. Since Ron, Fred and George took the car without permission, they are yelled at by Molly Weasley, who was waiting in the kitchen. After their scolding, she makes them breakfast and has the three Weasley boys (and Harry who volunteered) de-gnome the garden, refusing to use a technique from ''Gilderoy Lockhart's Guide to Household Pests'', and do it their own way. Arthur Weasley soon comes home and is honoured to meet Harry after they are introduced to each other. Molly, his wife, yells at him for enchanting the car. Ginny Weasley, who was enrolling at Hogwarts that year, is very obviously enamoured with Harry and spends most of the chapter hiding from him.",
    "section": "Chapter 3: The Burrow",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry stays at The Burrow until his departure for Hogwarts. The Weasleys make it clear that they all like Harry. For example, Arthur insists that Harry sit next to him during meals where Molly, who constantly deplores the state of his hand-me-down clothes and how thin he is, insists that he eat extra food. During that period, he and the Weasleys travel to Diagon Alley with Floo Powder to get their school supplies. Harry has difficulty with the smoke around him and says \"Diagon Alley\" unclearly, and thus he accidentally lands in a shop in the ill-reputed Knockturn Alley instead. The shop is Borgin and Burkes, specialising in objects related to Dark magic. There he sees Lucius Malfoy, father of Draco Malfoy, Harry's arch rival from school, selling items imbued with Dark magic to a dark arts salesman, Mr Borgin. Lucius Malfoy explains that the Ministry has been conducting raids on wizard houses to uncover illegal artefacts, so he is selling his more problematic possessions. He also expresses his disdain for a rumoured Muggle Protection Act, which he (rightly) assumes Arthur Weasley is behind.\n\nHarry leaves the shop and is found by Hagrid and taken back to Diagon Alley to reunite with the Weasleys and Hermione Granger, who is also there with her parents. In Flourish and Blotts, he and the Weasleys meet the famous wizard/author Gilderoy Lockhart, who announces that he will be taking over as Hogwarts's new Defence Against the Dark Arts teacher. He then forces Harry to have his picture taken with him for the main page of the Daily Prophet. They also meet Draco and Lucius Malfoy there. The elder Malfoy continuously taunts and insults Arthur and his family and eventually Arthur lunges at him. During the fight, Malfoy grabs one of the Weasleys' second-hand books and, after Hagrid breaks the fight up, throws the book back at Ginny in contempt.",
    "section": "Chapter 4: At Flourish and Blotts",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "It is time to return to Hogwarts, Harry and the Weasleys arrives at King's Cross Station on the Ford Anglia, after several delays (Fred and George forgetting their broomsticks, and Ginny forgetting her diary.) On the way to the Hogwarts Express, when Harry and Ron try to go through the barrier to Platform Nine and Three-Quarters after everyone else went through, the barrier is mysteriously sealed against them. Having missed the train, Harry and Ron thus decide to fly Mr Weasley's flying Ford Anglia to Hogwarts. They end up getting spotted by many Muggles and crash into the Whomping Willow, the impact breaking Ron's wand. The giant tree starts pounding the car. The battered car manages to escape, ejecting Harry, Ron, and their luggage, before quickly driving off into the Forbidden Forest.\n\nAfter they make it to the castle, Professor Snape catches the boys and attempts to have them expelled for being sighted and breaking wizard law to get to the castle. Albus Dumbledore, however, says he will send a letter to Harry and Ron's families. Still, Professor McGonagall gives a warning and separate detentions to both boys, and pointed out that they hadn't thought things through as they could have just sent a letter to Hogwarts with Hedwig. She also tells them that Ginny had been sorted into Gryffindor, providing them with Endless Sandwiches and disallowing them from attending the Start-of-Term Feast.",
    "section": "Chapter 5: The Whomping Willow",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "The next day, Ron receives a Howler from his mother during breakfast in the Great Hall. Then, Minerva McGonagall hands out timetables and the first class is Herbology with the Hufflepuffs. In the class, Professor Sprout teaches how to transplant Mandrake seedlings, which have restorative properties when mature. The next class is Transfiguration, where Ron has problems with his broken wand, even when he repaired it with some Spellotape. Later, the trio have their first lesson with Gilderoy Lockhart, appointed as the new Defence Against the Dark Arts teacher. His way of teaching is a complete disaster. Much to Harry's chagrin, he receives constant attention from Lockhart and Colin Creevey, a first year student. Both constantly interact with him on the base of his fame (Colin treats Harry as a celebrity and Lockhart hopes to actually bring him to that state).",
    "section": "Chapter 6: Gilderoy Lockhart",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "The Gryffindor Quidditch team has a very early practice on Saturday morning, where they are treated to an hour-long introduction to a new training programme Oliver Wood spent the summer working on. Soon after the actual practice starts, the Slytherin Quidditch team, with new Nimbus 2001 broomsticks, arrives, and an argument over field time ensues. During the confrontation, Malfoy is revealed to be the new Slytherin seeker, and the one responsible for getting the Slytherin team new brooms. Hermione says that nobody on their team had to buy his way in, they made it on pure talent. to which Malfoy calls Hermione a Mudblood, for which the Gryffindor team react angrily and Ron tries to curse him. However, his damaged wand causes the curse to backfire and he is rushed to Hagrid's cabin when he starts vomiting slugs. Ron and Hagrid both explain to Harry that Mudblood is a very insulting name for Muggle-Borns like Hermione. They also explain that there are some wizards like the Malfoys who think they are better than everyone else because they are Purebloods. After they return to the castle, Professor McGonagall assigns Harry and Ron their detentions. Harry is made to help Lockhart answer his fan mail, while Ron polishes the school's prizes and trophies. During his detention, Harry hears a disembodied sinister voice which Lockhart cannot hear.",
    "section": "Chapter 7: Mudbloods And Murmurs",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "In return for distracting Argus Filch just when he is about to give Harry severe punishment, Harry promises he will come to Nearly Headless Nick's Deathday Party on Hallowe'en. He brings Ron and Hermione along as well. While there, they meet Moaning Myrtle. The three of them quickly get sickened by the ghostly party and return to the Great Hall.\n\nBefore they get to the Hallowe'en feast, Harry hears the voice again (which Ron and Hermione also cannot hear) and follows it to the second floor, where he finds the bathroom flooded and Mrs Norris, Filch's cat, hanging from a torch bracket, petrified and next to her, a threatening message is written on the wall, reading \"THE CHAMBER OF SECRETS HAS BEEN OPENED. ENEMIES OF THE HEIR, BEWARE\". Then, students leaving the Hallowe'en Feast surround them. And Malfoy yells: \"Enemies of the Heir, beware! You'll be next, Mudbloods!\"",
    "section": "Chapter 8: The Deathday Party",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Filch and Snape try to get Harry in trouble for what happened, but Dumbledore says that it is powerful dark magic that no second year student could perform. They decide that Professor Sprout's mandrakes will be used, once they are mature enough, to create a draught that can revive Mrs Norris. Hermione wants to research the Chamber, so she persuades Professor Binns (the History of Magic teacher) into telling the class about it. He explains that one of the founders of Hogwarts, Salazar Slytherin, got into an argument with the others about whether Muggle-borns should be admitted. When the rift grew too large, he left the school. According to legend, as a going-away present to the school, he built a secret chamber that could only be opened by his true heir. This \"Chamber of Secrets\" contains a monster that only the Heir of Slytherin can control and that, once released, would purge the school of all Muggle-borns. Binns unsuccessfully tries to assure the class that the Chamber does not actually exist and that the school has been searched many times in vain.",
    "section": "Chapter 9: The Writing on the Wall",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry, Ron and Hermione decide that the heir is probably Draco Malfoy, since everyone in his family have been sorted into Slytherin House, he is a Pureblood supremacist, and because his father worked for Voldemort. To try to confirm it, Hermione proposes to use Polyjuice Potion, which can change a person into somebody else for an hour. After getting Lockhart's signature to check out the book Moste Potente Potions from the Restricted Section that has the recipe, Hermione warns them that the potion will take a month to brew, supposing they gather all the necessary ingredients (two of which can only be found in Snape's private inventory). Since no one comes into Moaning Myrtle's bathroom, the three of them decide it is the best place to brew the potion unnoticed. Hermione begins working with the ingredients they have.\n\nDuring the month that it takes the Polyjuice Potion to brew, a Quidditch match between Gryffindor and Slytherin takes place. During the match, one of the Bludgers stakes after Harry and focuses completely on him. Since Bludgers are supposed to attack each and every player, the crowd immediately realises that this Bludger has been tampered with. Harry still manages to catch the Golden Snitch and allow for Gryffindor to win thanks to the Slytherin Seeker Draco Malfoy wasting his time insulting Harry and not paying attention to his surroundings where the Snitch was hovering slightly above his left ear. However, before Harry could catch the Snitch, the Bludger broke Harry's arm, and Lockhart, attempting to fix it, gets rid of all the bones in his arm instead. Madam Pomfrey gives Harry Skele-Gro potion to counter this and Harry is forced to stay in the Hospital Wing overnight.\n\nDuring that night, Dobby visits Harry and reveals that it was he who made the Bludger chase after Harry, and was also responsible for the barrier of Platform Nine and Three-Quarters not letting him in for in hopes of Harry leaving or never arriving at Hogwarts. He also reveals that the Chamber of Secrets has been opened before and immediately punishes himself, as he is not supposed to reveal anything. After Dobby disappears, Dumbledore, McGonagall, and Madam Pomfrey enter with Colin Creevey, who has also been petrified. He was found with a camera containing film that has been burnt to the melting point. Dumbledore just observes the camera saying, \"The Chamber of Secrets has indeed been opened again.\"",
    "section": "Chapter 10: The Rogue Bludger",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "After Harry heads to Moaning Myrtle's bathroom the next morning and explains the details he learned from Dobby, Hermione comes up with a plan of Harry and Ron providing a distraction in Potions so she can steal the remaining ingredients for the Polyjuice Potion from Snape's private stores. Shortly afterwards, when McGonagall comes around with the sign-up list for the students who will remain in the school during Christmas, learning that Malfoy, Crabbe, and Goyle have signed up, Harry, Ron, and Hermione do this as well, since this gives them the perfect opportunity to use their Polyjuice Potion. With Harry providing a distraction during Potions class by throwing a Filibuster firework into Goyle's cauldron, it creates the necessary disturbance allowing Hermione to succeed without trouble, though Snape still suspects Harry's involvement with this incident after finding the firework. Harry later signs up for a Duelling Club which, to Harry's great displeasure, is taught by his two least favourite teachers, Lockhart and Snape. During a practice battle in the first meeting, Draco Malfoy conjures a snake to attack Harry. Lockhart tries to banish it, but all he manages is to set it loose on the students. Harry sees that the snake is advancing on a Hufflepuff student named Justin Finch-Fletchley and instinctively tells it to stop, which-to Harry's great surprise-it does. He expects Justin to be grateful Justin and the others are less than ecstatic about it. All they saw was Harry speaking Parseltongue, the language of snakes, and since they cannot understand it, it seemed to them that he was egging the snake on. Harry learns that Parseltongue is a very rare gift that is closely associated with Salazar Slytherin. Due to this, Harry becomes the number one suspect among students for being the heir of Slytherin. Hermione even tells him that since Salazar Slytherin lived so long ago, he might actually be a descendant. When a Herbology lesson is cancelled, Harry has a talk with Hagrid, who reveals that the school's roosters are being mysteriously killed. Seconds after leaving Hagrid, Harry runs into a petrified Justin Finch-Fletchley and a black, also petrified, Nearly-Headless Nick. Peeves alerts the whole school, and a Hufflepuff student called Ernie Macmillan claims that Harry has been caught red-handed.",
    "section": "Chapter 11: The Duelling Club",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "For the first time, Harry is taken to Dumbledore's office, and there he witnesses Fawkes—Dumbledore's phoenix—bursting into flames and then being reborn from the ashes. Dumbledore says that he does not believe Harry to be behind the attacks, a belief reinforced by Hagrid backing Harry's alibi, but a large portion of the school is now sure that Harry is Slytherin's heir. When Christmas arrives (Harry's gifts: a toothpick, fudge in a tin, a copy of Flying with the Cannons, a new quill, a jumper and plum cake), with the Polyjuice Potion ready and Hermione having acquired some spare Slytherin robes to use (since they can't use their regular clothes while transformed), they give to Crabbe and Goyle two chocolate cakes containing \"sleeping pills\" that made Crabbe and Goyle fall asleep after eating the cakes. Harry and Ron take their hairs (and shoes, because Crabbe and Goyle have larger feet) and assume their form. Hermione tries to use a hair she thought belongs to Millicent Bulstrode, but it is actually her cat's hair and Hermione is transformed into a cat/human hybrid. Hermione is forced to spend a few weeks in the Hospital Wing. As Crabbe and Goyle, once Draco leads them to the Slytherin common room, Harry and Ron interrogate an unsuspecting Malfoy and discover that even though he wishes he were, Draco is not the Heir of Slytherin. They also hear that Lucius Malfoy mentioned that the last time the chamber was opened, fifty years ago, a Muggle-born student died and whoever was responsible was expelled. Malfoy also mentions his father's secret stash of illegal artefacts.",
    "section": "Chapter 12: The Polyjuice Potion",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Weeks later, Ron and Harry overhear Argus Filch complaining about his workload and leaving. They arrive at Moaning Myrtle's bathroom to find it flooded. Myrtle, a sulking ghost, explains that she had flooded it because somebody flushed a diary down the toilet and onto her. Harry picks it up; he discovers that it once belonged to somebody called T.M. Riddle, but the diary is completely blank. Ron remembers from his detention that Riddle had won an award for special service to the school fifty years before, as he had another slug attack on the trophy. Hermione deduces that since this coincides with the last time the Chamber was opened, Tom Riddle might have received his prize for catching whoever was responsible for the attacks back then. Even though all attempts to extract information from the diary fail, Harry feels a strange compulsion to keep it. On Valentine's Day, Ron and Harry are dismayed to find out Lockhart has spread dwarves dressed as cupids throughout the school to receive and deliver Valentines as a morale booster due to believing that he made the attacks stop. One cupid-dwarf manages to deliver one (a singing valentine) to Harry. While struggling to avoid him, the embarrassed Harry trips and falls, having ink spilled all over the contents of his bag. Ginny notices the diary and assumes a horrified expression. Draco Malfoy also tries to steal the diary as Harry is picking up his stuff, but an angered Harry stuns him, ignoring that Percy Weasley was also there trying to handle the situation, which results in Percy reprimanding Harry. Later, Harry realises that even though ink is spilled all over the diary, it is not stained at all. He tries writing to the diary and, to his surprise, Riddle writes back. He explains that he was the one who caught the person who opened the Chamber of Secrets the last time, and he can show Harry what happened. Harry agrees and gets sucked into a \"recording\" of Riddle's memory. Transported back to 13 June 1943, he witnesses the school's previous headmaster, Armando Dippet, informing Riddle that the school will be closed, since now a Muggle-born girl has died. Riddle is apprehensive of this, since it would mean getting sent back to the Muggle orphanage he grew up in and grown to hate. Dippet guesses that Riddle is Muggle-born as well, but Riddle corrects him by revealing that he's actually half-blood, having been left at the orphanage after his witch mother died, but not before requesting her son's first name to be Tom, after his Muggle father, and his middle name to be Marvolo, after his wizard grandfather. When dismissed by Dippet and a 50-years-younger Dumbledore, Harry follows Riddle down into the dungeons, where Riddle catches a 50-years-younger Hagrid fiddling with a young Acromantula in a cupboard. Accusing the giant of harbouring the monster behind the death of the Muggle-born girl in question, Riddle reports Hagrid to Dippet, despite Hagrid protesting that that his Acromantula, who he has seemingly named Aragog, has never killed anyone. Having seen this, Harry now believes that Hagrid was the one who opened the Chamber fifty years before and he is responsible this time.",
    "section": "Chapter 13: The Very Secret Diary",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry, Ron and Hermione decide not to ask Hagrid about it, hoping that the attacks have stopped-and indeed, almost four months after the attack on Justin and Nearly-Headless Nick, the disembodied voice keeps quiet and the attacks seem to have ceased. However, odd things keep happening: Harry returns to his dormitory one day to find it a mess. Ron deduces that somebody has been looking for something, and Harry eventually notices that Tom Riddle's Diary is gone. This greatly befuddles them, knowing that only a Gryffindor student or a staff member could know the password to enter the dormitory. The next day, the scheduled Quidditch match between Gryffindor and Hufflepuff is cancelled due to yet another attack and Harry hears the voice again. This time Minerva McGonagall calls for Harry and Ron personally, and leads them to the Hospital Wing, where they see Hermione petrified. She was found near the library with a Ravenclaw prefect, holding a small circular mirror. This proves that Harry is not the Heir of Slytherin, since he would never attack one of his friends. Harry and Ron decide they now must talk to Hagrid. With the now constant supervision on students, this is not easy, but they manage to do it by using Harry's invisibility cloak. When they reach Rubeus Hagrid's cabin Harry and Ron manage to hide just before Cornelius Fudge, who is the Minister for Magic, and Dumbledore arrive at the scene. Fudge announces that Hagrid, who to the best of his knowledge opened the Chamber of Secrets the last time, will be sent to Azkaban prison as a precaution. They are shortly joined by Lucius Malfoy, who declares that he and the other governors of Hogwarts have unanimously voted to suspend Dumbledore, despite the obvious logic that this would only worsen the situation. Both Hagrid and Dumbledore give last words to Harry and Ron: Hagrid says that if anybody wants the truth they should \"follow the spiders\" and Dumbledore says that he will only truly have left the school when none there remain loyal to him. He also stresses that if anybody at Hogwarts needs help, it will always be available to those who ask for it.",
    "section": "Chapter 14: Cornelius Fudge",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry and Ron decide to follow the spiders as per Hagrid's advice, after Harry notices the spiders during a Herbology lesson. Walking with Fang as their guide along the trails of the spiders, which are strangely all fleeing Hogwarts, takes them into the Forbidden Forest. Even though Ron is deeply arachnophobic, Hermione having been petrified and that they may be able to help through this investigation gives him the willpower to go along anyway. There, they encounter Arthur Weasley's car, which had apparently taken to driving through the forest like a wild animal. The two boys follow the spiders deeper into the forest all the way into a webbed lair. There, they are met by a now adult but ageing Aragog, who reveals that Hagrid is innocent and explains his past from being given to Hagrid as an egg by a distant traveller to his accusation as the Chamber's resident monster until his transfer to the Forbidden Forest and his founding of his colony with Mosag. When Harry asks of the monster that killed the girl in 1943, Aragog remarks it is an ancient creature that all spiders as well as giant ones fear and that they never mention its name nor speak about it, even when Hagrid asked many times, and adds that the dead girl was found in a bathroom. Harry and Ron thank him and turn to leave, but Aragog halts them, deciding to leave them as dinner for his children. Mr Weasley's Ford Anglia comes blasting through the layers of spiders, however, and enables the boys and Fang to escape. Ron is furious that Hagrid has endangered their lives until Harry explained his logic. After this, Harry and Ron feel that they have reached dead ends everywhere, until one possible last hope occurs to them. Recalling Aragog's remarks of the dead girl in the bathroom Harry suggests that Moaning Myrtle might have been that victim. Of course, with the school under such security, it will be almost impossible to sneak in the girls' bathroom near where the first attack occurred.",
    "section": "Chapter 15: Aragog",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Days later, Professor McGonagall informs the students that the Mandrake Draught will soon be ready. Later that same day, Harry and Ron manage to trick Lockhart - who is leading them to their next class - into letting them go by stroking his ego. Just as they pat themselves on the back, they get caught by Professor McGonagall, and Harry has to make up an excuse - they were going to see Hermione in the Hospital Wing, where visitors were now prohibited. They now have to go along to make their story appear convincing, but rather than simply hanging around Hermione's petrified form, this time Harry finds a piece of paper tightly clutched in her hand, which reveals what Hermione discovered before she was attacked. She had discovered, based on strong circumstantial evidence, that the monster in the Chamber of Secrets is a Basilisk, one of the giant \"Kings of all Serpents\", thus explaining the mysterious voice that only Harry could hear, since he could speak Parseltongue. The Basilisk kills people by looking them in the eye, but no one died since they only looked indirectly at its deadly gaze: Colin Creevey saw it through his camera, Justin Finch-Fletchley saw it through Nearly-Headless Nick (since he was already dead and could not die \"again\", he was only petrified), Mrs Norris saw a reflection of it in the water from the flooded bathroom, and Hermione and Penelope Clearwater both used a mirror to look around corners after Hermione has figured things out. Harry discovers in the paper that spiders flee from it and how a rooster's crowing is potentially fatal to the Basilisk (which explains Hagrid's roosters having been killed during the year). On the note is also scribbled a single word, \"pipes\", implying that the serpent manoeuvres through the plumbing (which helps them to realise that the entrance to the Chamber of Secrets is in Moaning Myrtle's bathroom). Having solved the mystery, Harry and Ron decide to go to the staff room and report to the teachers. When they get there, they overhear the teachers talking about another attack having occurred. Harry and Ron decide to hide to hear more details and discover that Ginny has been kidnapped by the Basilisk, and the heir of Slytherin has left another message under the previous one: \"HER SKELETON WILL LIE IN THE CHAMBER FOREVER\".",
    "section": "Chapter 16: The Chamber of Secrets",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry and Ron also discover that Hogwarts will be closed tomorrow. The teachers then force Lockhart to deal with the monster, as he has been claiming he could handle whatever is behind the attacks. Looking very crestfallen, he leaves for his room. Harry and Ron decide that if Lockhart is going to deal with the monster they might as well tell him what they know. They go to his room, only to find him frantically planning to run away. When questioned on why such a talented wizard as himself is leaving, Lockhart admits that he is a fraud who put Memory Charms on the people who really did the things that he claimed to have done in his books. He then attempts to put a Memory Charm on the two boys as well, but they manage to disarm him and, under wand threats, take him to Moaning Myrtle's bathroom. Moaning Myrtle explains her death, remarking the last thing she saw was a pair of enormous eyes by one of the sinks, whose tap has never worked. Harry finds a snake engraved on the tap and then opens the entrance to the Chamber of Secrets by speaking Parseltongue to it. Harry, Ron and Lockhart slide down a large pipe and find themselves in maze-like tunnels far below the school. Down there, they encounter a snakeskin left by the Basilisk. Just then, Lockhart feigns fainting and steals Ron's wand. Victoriously declaring that he will erase Harry and Ron's memories and tell everybody they lost their sanity at the sight of Ginny's mangled body, Lockhart casts the Memory Charm. However, Ron's broken wand causes the charm to backfire, erasing Lockhart's memory and causing a portion of the ceiling to cave in, trapping Harry in the direction of the chamber and Ron and Lockhart in the direction of the castle. Ron must then stay behind and clear a path through the rocks while Harry continues in search of Ginny. Harry then encounters a wall with stone snakes on it, opens it by speaking Parseltongue, and enters the Chamber.",
    "section": "Chapter 16: The Chamber of Secrets",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry finds himself standing at the end of a long dimly lit giant hall. At the far end by the foot of Slytherin's statue, he finds Ginny lying on the ground, pale and cold. He drops his wand and runs to her, trying to get a response from her, but to no avail. Tom Riddle approaches them, holding Harry's wand, and remarks that his presence in the present is because he is a memory, which had been preserved in his own diary for 50 years. He then reveals what has happened: Riddle had opened the Chamber of Secrets fifty years earlier and intended to purge the school of Muggle-borns; however, when he discovered that the school was going to close down because of the attacks and that Dumbledore (then the Transfiguration professor) was keeping a closer watch on him, he was left to abandon the attacks and frame Hagrid for doing it. He eventually left behind a diary containing the memory of his 16-year-old self in hopes that it would, one day, fall into the hands of an unsuspecting victim who would help him to finish his work. The diary ended up in Ginny's possession. Riddle had written back sympathetically, and Ginny grew to confess her fears, hopes and feelings to him. She essentially poured some of her soul into him, which was exactly what he wanted. He gradually grew more powerful and eventually managed to pour some of his soul back into her, possessing her and using her body to open the Chamber of Secrets, releasing the Basilisk that launched the new series of attacks and to write the threatening messages on the walls. However, Ginny became suspicious of the diary and tried to dispose of it by flushing it down a toilet in Moaning Myrtle's bathroom. This is when Harry found it, and when Ginny saw Harry with the diary on Valentine's Day, she panicked and worried that Riddle had told Harry about her role in the attacks, so she stole it from his dormitory. It began taking control of her again, but this time with the intention of killing Harry, so he had Ginny write her own farewell on the wall and come down to wait, luring Harry to the rescue and, consequently, his doom. Riddle is angered that Harry managed to defeat the Dark wizard Lord Voldemort as a mere baby.",
    "section": "Chapter 17: The Heir of Slytherin",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "When Harry asks why Riddle cares how he escaped, Riddle remarks that \"Voldemort is his past, present and future.\" He then writes the air with Harry's wand his full name, TOM MARVOLO RIDDLE, then waves the wand and the letters form an anagram: I AM LORD VOLDEMORT. Harry then discovers that Lord Voldemort was only a pseudonym and that his real/birth name was Tom Marvolo Riddle. Riddle remarks that he couldn't bear to use the name of a Muggle father who abandoned him before his wizard son would be born, right when he found out that his wife was a witch descended from Salazar Slytherin. Instead he scrambled that name to create a new one which he knew people would fear when he became the \"greatest sorcerer in the world\". Harry remarks that he must be mistaken, because, as everybody knows, Albus Dumbledore is the greatest sorcerer in the world. Even with Voldemort being at the peak of his power, he was afraid of Dumbledore, and now he is barely alive. Riddle replies that Dumbledore has been driven out the castle by the mere memory of him. Harry declares that Dumbledore is not as gone as Riddle seems to think. In this display of loyalty, he summons Fawkes the phoenix to him, who also brings with it the Sorting Hat, both assets that Riddle claims to be extremely useless. Riddle then summons the Basilisk and commands it to kill Harry. However, Fawkes is not as defenceless as one might initially think, and pecks out the Basilisk's eyes, thus preventing its gaze from killing. The basilisk is still able to hear and smell Harry, however, and remains very dangerous, so Harry, in desperation, puts on the Sorting Hat, wishing against hope for help. Instead of an answer, a heavy sword with a hilt embedded with rubies falls on Harry's head from inside the hat. After several missed strikes from the blinded Basilisk, it strikes again, right at him this time, but Harry thrusts the sword into the roof of the Basilisk's mouth, killing it. However, one of its poisonous fangs falls into his arm, injecting a deadly poison. While Riddle gloats over his \"win\", Harry takes Riddle's diary and thrusts the Basilisk fang into the diary. Ink begins pouring out of the book like blood as Riddle is destroyed.",
    "section": "Chapter 17: The Heir of Slytherin",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Ginny instantly stirs and wakes up as Harry is now moments from death, when Fawkes cries on the wound, and since phoenix tears have healing powers, Harry is instantly cured. Harry and Ginny travel back through the Chamber to find Ron and Lockhart; Lockhart has no idea of who or where he is. Harry, Ron, Ginny and Lockhart grab onto Fawkes and fly up the tunnel, out of the Chamber (another phoenix specialty, as they can lift very heavy loads). They return to Moaning Myrtle's bathroom, where the Entrance seals shut again, and head to McGonagall's office.",
    "section": "Chapter 17: The Heir of Slytherin",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "At McGonagall's office, Harry, Ron, and Ginny find Dumbledore, McGonagall, Arthur and Molly Weasley, who are delighted to see them alive. Harry worries that Ginny will get blamed for being the person behind the attacks, but to his great relief Dumbledore rightly deduces that Voldemort is the culprit and only used Ginny's body. After Ginny leaves to get a much-needed rest, Harry and Ron both receive two hundred house points each for Gryffindor and both get an Award for special services to the school, and then Dumbledore asks to speak with Harry alone. Harry expresses his concern that he belonged in Slytherin. Dumbledore reveals that Voldemort transferred some of his powers to Harry when he gave him his scar, explaining his ability to speak Parseltongue. He asks Harry why he thinks the Sorting Hat put him in Gryffindor if he has so many Slytherin qualities, and Harry admits that the only reason it did was because he had asked it to. Dumbledore confirms this and tells Harry that \"it is our choices, rather than our abilities, that reveal who we truly are\". He points out to the sword Harry had drawn out of the hat - Harry now notices it has Godric Gryffindor's name on it. Dumbledore says that only a true Gryffindor would be able to draw it out.\n\nLucius Malfoy then barges into McGonagall's office, outraged that Dumbledore has returned to the school after being dismissed. Dumbledore calmly responds that the governors had asked him to return once they discovered that Arthur Weasley's daughter was attacked. Apparently, they had been blackmailed by Malfoy to vote for Dumbledore's dismissal in the first place under Malfoy's threat of cursing their families. Dobby follows Lucius into the room, thus showing that his masters are the Malfoys. Dumbledore and Malfoy have a calm but venomous interchange (respectively), during which Dumbledore and Harry (with the help of Dobby's unspoken hints) essentially expose Lucius for sneaking Riddle's diary (one of his illegal artefacts) into Ginny's school things during the fight with Arthur at Flourish and Blotts. This is supposed to frame Ginny for the attacks, with heavy implications on the Muggle Protection Act Arthur Weasley has been suggesting. Malfoy dares Dumbledore to prove his accusation, and while the Headmaster has insufficient evidence for that, he cautions Malfoy against orchestrating any further such plots, otherwise he is certain that Arthur Weasley would do whatever it took to trace it back to Malfoy.\n\nKnowing that a master can release his house-elf by giving them some clothes, Harry tricks Malfoy into freeing Dobby by giving Malfoy one of his own socks, which he promptly passes to Dobby as rubbish to get rid of him. Malfoy's retribution is thwarted by the now free Dobby, who then thanks Harry profusely and disappears. The petrified people are cured, Hagrid is released from Azkaban, Lockhart is sent to a hospital and Lucius Malfoy is fired from his post as school governor. The book ends with Harry at King's Cross, crossing the barrier back to the Muggle world and Ginny mentioning to Harry, Fred, and George that Percy has a girlfriend, and she is Ravenclaw's perfect, Penelope Clearwater.",
    "section": "Chapter 18: Dobby's Reward",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"2\" border=\"2\"\n!Spell\n!Usage\n|-\n|Oculus Reparo\n|The Oculus Reparo spell was used non-verbally on Harry's glasses in Diagon Alley by Arthur Weasley after they broke going through the Floo Network.\n|-\n|Freezing Charm\n|Hermione used Immobulus to stop two Cornish Pixies from causing more havoc in Professor Lockhart's lesson.\n|-\n|Slug-Vomiting Charm\n|Ron used Slugulus Eructo on Draco, which, due to his broken wand, backfired and led to Ron vomiting slugs instead. They went to Hagrid for help.\n|-\n|Engorgement Charm\n|Hagrid secretly cast Engorgio on his pumpkins to make them larger for the Hallowe'en feast. Hermione noticed this and pointed it out to Harry and Ron, questioning whether Hagrid should have done it.\n|-\n|Transmogrifian Torture\n|Professor Lockhart explains how he knew the exact counter-curse for this, probably to show off, but it is never confirmed whether this is a real spell or if it has anything to do with petrification.\n|-\n|Brackium Emendo\n|Professor Lockhart attempts to use Brackium Emendo in order to mend Harry's bones after a rogue Bludger hit him during a Quidditch Match. Harry protests and asks if someone could take him to the hospital wing instead.\n|-\n|Disarming Charm\n|Professor Snape uses Expelliarmus on Professor Lockhart during the first and last session of the duelling club. This becomes Harry's signature spell after Snape indirectly teaches it to him.\n|-\n|Tickling Charm\n|Rictusempra was used by Harry on Draco during the duelling club, which Snape quickly reverted.\n|-\n|Dancing Feet Spell \n|Tarantallegra was used by Draco on Harry during the duelling club, which Snape quickly reverted.\n|-\n|General Counter-Spell \n|Finite Incantatem was used by Snape on Harry and Draco during the duelling club which led to Harry no longer dancing and Draco no longer laughing.\n|-\n|Snake Summons Spell \n|Serpensortia was used by Draco against Harry during the duelling club, summoning a snake, to which Harry then spoke in Parseltongue without realising, in front of the whole school, sparking rumours that he was the Heir of Slytherin.\n|-\n|Alarte Ascendare \n|Alarte Ascendare was used by Professor Lockhart on the snake Draco summoned during the duelling club. \n|-\n|Revealing Charm \n|Aparecium was used by Hermione on Tom Riddle's diary after Harry showed them it. This didn't work and nothing was shown. \n|-\n|Wand-Lighting Charm\n|Lumos was used by Harry to help him and Ron follow the trail of spiders through the Forbidden Forest.\n|-\n|Memory Charm \n|Obliviate was about to be used by Lockhart on Harry and Ron when he was packing up to leave Hogwarts after being exposed.\n|}",
    "section": "List of spells first introduced",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"4\" border=\"2\"\n! width=\"15%\" |Character\n! width=\"15%\" |Killed by\n! width=\"15%\" |Cause of death\n! width=\"15%\" |Circumstances\n|-\n|Myrtle Warren\n|Salazar Slytherin's Basilisk\n|Direct eye contact with the Basilisk.\n|(Mentioned only)\nVoldemort's first attempt to rid Hogwarts of all Muggle-born students.\n|-\n|Salazar Slytherin's Basilisk\n|Harry Potter\n|Impaled at the roof of the mouth with Godric Gryffindor's Sword.\n|Attacked Harry Potter in the Chamber of Secrets.\n|-\n|Tom Riddle's Diary\n|Harry Potter\n|Stabbed with the Basilisk's fang.\n|Sent the Basilisk after Harry Potter and tried to steal Ginny Weasley's life force.\n|}",
    "section": "List of deaths",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Chamberofsecrets.jpg|British Children's Edition, published by Bloomsbury\nChamber of secrets.jpg|British Celebratory Edition\nChamber Special Edition.jpg|British Special Edition\nChamber-uk-adult.jpg|British original Adult Edition\nHP and the Chamber of Secrets adult.jpg|British Adult Edition\nNormal COS Signature.jpg|British Signature Edition\nHarry Potter and the Chamber of Secrets new adult edition.jpeg|British 2013 Adult Edition\nChamber of Secrets New UK Cover.jpg|British 2014 Children's Edition\nChamber of secrets-cover.jpg|American (paperback and hardback), published by Scholastic\nHarry-potter-and-the-chamber-of-secrets.jpg|American alternative paperback\nHarry-potter-new-chamber-of-secrets-cover-630.jpg|American 15th anniversary edition\nUS 2018 paperback 02 COS.jpg|American 20th anniversary edition",
    "section": "English-language",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry potter 2014.jpg|Hungarian 2014 edition\nSirlar-odasi-kap-8267.jpg|Turkish",
    "section": "Translations (cover based on Bloomsbury's)",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Harry Potter 2 Arabic cover.jpg|Arabic\nBook bolg 2.jpg|Bulgarian, Хари Потър и Стаята на тайните, published by Egmont Bulgaria\nHpk2.jpg|Czech, Harry Potter a Tajemná komnata, published by Albatros\nHP 2 Chamber of Secrets Chinese Choice cover 9789573317586.jpg|Traditional Chinese, 哈利波特—消失的密室, published by Choice\n-Files-Images-Bokadeildin-permur-bokarodir-potter2midi.jpg|Faroese, Harry Potter og kamarið við loynidómum, published by Bókadeild Føroya Lærarafelags\n800px-הארי פוטר 2.JPG|Hebrew edition\n9789639884298-us.jpg|Hungarian, Harry Potter és a Titkok Kamrája\nLithuanian original 02 COS.jpg|Lithuanian, Haris Poteris ir Paslapčių Kambarys, published by Alma Littera\nHarry Potter Cover 2 Serbian.jpg|Serbian, Hari Poter i Dvorana Tajni, published by Evro Giunti\nHarry potter in dvorana skrivnosti.jpg|Slovene, Harry Potter in dvorana skrivnosti\n2150-Harry-Potter-ve-Sirlar-Odasi.jpg|Turkish, Harry Potter ve Sırlar Odası",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Bosnian 02 COS.png|Bosnian, Harry Potter i odaja tajni, published by Buybook\nBulgarian 2019 hardback 02 COS.png|Bulgarian 20th anniversary edition\nZbook catalon2a.jpg|Catalan edition\nChina2.jpg|Simplified Chinese (China) 2008 Collector's Edition, 哈利·波特与密室, published by People's Literature\nDanish cover vol2.jpg|Danish, Harry Potter og Hemmelighedernes Kammer, published by Gyldendal\nDania 2.jpg|Danish edition\nDanish adult cover 2.jpg|Danish adult edition\nDanish 2012 paperback 02 COS.jpg|Danish 2012 paperback\nDutch original 02 COS.jpg|Dutch, Harry Potter en de Geheime Kamer, published by De Harmonie and Standaard\nDutch Chamber of Secrets book cover.jpeg|Dutch (the Netherlands) 2010 Pocket edition, published by Uitgeverij De Harmonie\nFinnish Book 2 cover.jpg|Finnish, Harry Potter ja salaisuuksien kammio, published by Tammi\nFrench Book 2 Cover.jpg|French original paperback, Harry Potter et la Chambre des secrets, published by Éditions Gallimard\nFrench T2 (2011 new edition).png|French 2011 paperback\nFrench T2 (2016 new edition).jpg|French 2016 edition\nHarry Potter 2.jpeg|German, Harry Potter und die Kammer des Schreckens, published by Carlsen Verlag\nGerman Adult Edition 02 COS.png|German adult edition\nGerman 2013 Pocket 02 COS.png|German 2013 Anniversary Pocket Edition\nGerman 2018 hardback 02 COS.png|German 20th anniversary edition\n1499934470758.jpeg|Indonesian, Harry Potter dan Kamar Rahasia\nLibro2 high.jpg|Italian, Harry Potter e la camera dei segreti, published by Adriano Salani Editore\nItalian 2021 redesign 02 COS.png|Italian 2021 redesign\nJapanese original hardback 02 COS.jpg|Japanese original hardback, ハリー・ポッターと秘密の部屋, published by Say-zan-sha\nJapanese shinsouban hardback 02 COS.png|Japanese 20th anniversary edition\nLithuanian 2020 hardback 02 COS.png|Lithuanian 20th anniversary edition\nPortugal2.jpg|Portuguese edition\nHP2BOX.png|Brazilian Portuguese collector's edition, Harry Potter e a Câmara Secreta, published by Rocco\nRussian 2008 Black Deluxe Edition 02 COS.png|Russian 2008 Black Deluxe Edition, Гарри Поттер и Тайная комната\nGx97ylls6CI.jpg|Russian edition\nSlovak 2020 exclusive box set 02 COS.png|Slovak 20th anniversary edition, Harry Potter a Tajomná komnata, published by IKAR\nIspania 2.jpg|Spanish edition\n2-Harry Potter y La Camara Secreta.jpg|Spanish, Harry Potter y la cámara secreta, published by Alfaguara/Salamandra\nSpanish 15th anniversary 02 COS.jpg|Spanish 15th anniversary edition\nSwedish 02 COS.jpg|Swedish, Harry Potter och Hemligheternas kammare, published by Tiden\nThai 2020 hardback 02 COS.jpg|Thai 20th anniversary edition, แฮร์รี่ พอตเตอร์กับห้องแห่งความลับ, published by Nanmeebooks\nCOS Ukrainian edition.jpg|Ukrainian, Гаррі Поттер і таємна кімната, published by А-БА-БА-ГА-ЛА-МА-ГА",
    "section": "Translations (alternative covers)",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Bloomsbury 02 COSIE cover - Jim Kay.jpg|UK edition (Bloomsbury)\nScholastic 02 COSIE cover - Jim Kay.jpg|US edition (Arthur A. Levine Books)\nHarry potter hungarian.jpg|Hungarian edition, Harry Potter és a titkok kamrája\nharry-potter-och-hemligheternas-kammare.jpg|Swedish edition, Harry Potter och Hemligheternas kammare\nhari-poter-i-dvorana-tajni-ilustrovano-hari-poter-02-dvorana-tajni-ilustrovan_5a5c8a9002efa.jpg|Serbian edition (Evro Book)\nHP2IllustratedITA.jpg|Italian edition (Salani Editore)\nChamber of Secrets French book cover.jpg|French edition\nChamber of Secrets Cover - Mina Lima.jpg|MinaLima edition",
    "section": "Illustrated Editions",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "UK House Edition hardback Gryffindor 02 COS.png\nUK House Edition hardback Hufflepuff 02 COS.png\nUK House Edition hardback Ravenclaw 02 COS.png\nUK House Edition hardback Slytherin 02 COS.png\n\n}}",
    "section": "Hogwarts House Edition",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "*When Harry watches Draco Malfoy and his father in Borgin and Burke's, a cursed Opal Necklace is described. This is the necklace used in . *The only book in the series where Sirius Black is not mentioned or appears. *Nearly Headless Nick was petrified, but as a ghost, he would be unable to drink the Mandrake Potion. It is unknown how Nick was revived. It is possible that, as the same way ghosts taste, they poured the potion through him. *Book title:\n**In the Spanish translated edition published by Salamandra, the name is Harry Potter y la Cámara Secreta, which means \"Harry Potter and the Secret Chamber.\"\n***In the book, however, the Chamber of Secrets is translated as Cámara de los Secretos, the correct translation. Something similar happens in the sixth book. **In the German translated edition published by Carlsen, the name is Harry Potter und die Kammer des Schreckens, which means \"Harry Potter and the Chamber of fright.\"\n*This novel establishes the date in which Harry Potter takes place. During Nearly-Headless Nick's party, his cake says that it's his 500th Deathday, and his death took place in 1492. This means that the events of \"Chamber of Secrets\" takes place during the year 1992-1993, meaning that Harry Potter's school years take place during the 1990s. *The warning written on the wall, \"Her skeleton will lie in the Chamber forever,\" was actually realised. Though originally written in reference to Ginny Weasley, the message can be reinterpreted as being in reference to the Serpent of Slytherin, as the basilisk was in fact a female. Thus her skeleton will lie in the Chamber forever. *An interesting note is that in some translated versions of the book, the true name of Lord Voldemort is changed to form an anagram that made sense for the scene he makes his name into \"I am Lord Voldemort\". In Spanish, it would be \"SOY LORD VOLDEMORT\", so he is called Tom Sorvolo Ryddle. The other names are:\n\n{| class=\"wikitable\"\n! Language\n! Name\n! Anagram\n!",
    "section": "Behind the scenes",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "Translation\n|-\n|English\n|Tom Marvolo Riddle\n|I am Lord Voldemort\n|I am Lord Voldemort\n|-\n|Bulgarian\n|Том Мерсволуко Риддъл \n|Тук съм и Лорд Волдемор\n|Here I am also Lord Voldemort\n|-\n|Basque\n| Tom Narivoloz Riddle\n|Lord Voldemort naiz\n|I am Lord Voldemort\n|-\n|Catalan\n|Tod Morvosc Rodlel\n|Sóc Lord Voldemort\n|I Am Lord Voldemort\n|-\n|Czech\n|Tom Rojvol Raddle\n|Já Lord Voldemort\n|Me Lord Voldemort\n|-\n|Danish\n|Romeo G. (Gåde) Detlev Jr. |Jeg er Voldemort\n|I am Voldemort\n|-\n|Dutch\n|Marten Asmodom Vilijn\n|Mijn Naam is Voldemort\n|My name is Voldemort\n|-\n|Finnish\n|Tom Lomen Valedro\n|Ma olen Voldemort\n|I am Voldemort\n|-\n|French\n|Tom Elvis Jedusor\n|Je suis Voldemort\n|I am Voldemort\n|-\n|Galician\n| Tom Morlov Riddle\n|Milord Voldemort\n|Milord Voldemort\n|-\n|German\n|Tom Vorlost Riddle\n|Ist Lord Voldemort\n|Is Lord Voldemort\n|-\n|Greek\n|Adon Morvol Hert\n|AΡΧΩΝ ΒΟΛΝΤΕΡΜΟΡΤ\n|Lord Voldemort\n|-\n|Hebrew\n|טום ואנדרולו רידל \n|אני לורד וולדמורט\n|I am Lord Voldemort\n|-\n|Hungarian\n|Tom Rowle Denem\n|Nevem Voldemort\n|My name is Voldemort\n|-\n|Icelandic\n|Trevor Delgome\n|Eg er Voldemort\n|I am Voldemort\n|-\n|Italian\n|Tom Orvoloson Riddle\n|Son io Lord Voldemort\n|I am Lord Voldemort\n|-\n|Latvian\n|Toms Svereldo Melsudors\n|Es esmu Lords Voldemorts\n|I am Lord Voldemort\n|-\n|Norwegian\n|Tom Dredolo Venster\n|Voldemort den Store\n|Voldemort the Great\n|-\n|Portuguese (Brazil)\n|Tom Servolo Riddle\n|Eis Lord Voldemort\n|Here is Lord Voldemort\n|-\n|Romanian\n|Tomas Dorlent Cruplud\n|Sunt Lordul Cap-de-Mort\n|I am Lord Voldemort\n|-\n|Russian\n|Том Нарволо Реддл\n|Лорд Волан-де-Морт\n|Lord Voldemort\n|-\n|Serbian\n|Tom Mervolodomos Ridl\n|To smo mi Lord Voldemor\n|It is us, Lord Voldemort\n|-\n|Slovak\n|Tom Marvoloso Riddle\n|A som i Lord Voldemort\n|And Iam Lord Voldemort too\n|-\n|Slovene\n|Mark Neelstin\n|Mrlakenstein\n|Voldemort\n|-\n|Spanish\n|Tom Sorvolo Ryddle\n|Soy Lord Voldemort\n|I am Lord Voldemort\n|-\n|Swedish\n|Tom Gus Mervolo Dolder\n|Ego sum Lord Voldemort (Latin)\n|I am Lord Voldemort\n|-\n|Turkish\n|Tom Marvoldo Riddle\n| Adım Lord Voldemort\n|My name is Lord Voldemort\n|}",
    "section": "Behind the scenes",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "*Many fans noted that Dumbledore said that Voldemort was the last remaining ancestor of Salazar Slytherin, instead of descendant. J. K. Rowling said this was a \"deliberate mistake\". This could support the theory that time travel will recur in the series (see \"Rumour\" note for ). This mistake was fixed on further printings, though, so it's more likely to be a mistake that slipped past the editors than an actual hint. Some versions have put it back after Rowling's comment, perhaps overlooking the tongue-in-cheek nature of the term \"deliberate mistake\". This line was left out of the film.\n*It was implied in the book that Ginny had sent Harry his singing valentine. Some members of the on-line fandom have questioned this conclusion, suggesting it being a prank by the Weasley Twins or a genuine overture from Moaning Myrtle as other possibilities. Rowling, herself, however, confirmed in an interview that the valentine was sent by Ginny.",
    "section": "Rumours",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "The book was also adapted into a film, the second Harry Potter film of the series. The movie Harry Potter and the Chamber of Secrets was released on November 15th, 2002. It was directed by Chris Columbus and the trio was starred by Daniel Radcliffe, Rupert Grint and Emma Watson.",
    "section": "Film adaptation",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  },
  {
    "text": "*\n*\n* \n*Harry Potter and the Chamber of Secrets (character index)\n*Second year\nde:Harry Potter und die Kammer des Schreckens\nde2:Harry Potter und die Kammer des Schreckens\nes:Harry Potter y la cámara secreta\nfi:Harry Potter ja salaisuuksien kammio\nfr:Harry Potter et la Chambre des Secrets\nit:Harry Potter e la Camera dei Segreti\nja:ハリー・ポッターと秘密の部屋\nnl:Harry Potter en de Geheime Kamer\npl:Harry Potter i Komnata Tajemnic\npt:Harry Potter e a Câmara Secreta\nru:Гарри Поттер и Тайная комната\ntr:Harry Potter ve Sırlar Odası\nvi:Harry Potter và Phòng chứa Bí mật\nzh:哈利·波特与密室\nno:Harry Potter og Mysteriekammeret\n2\nCategory:Canon",
    "section": "See also",
    "name": "Chamber of Secrets",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 2,
    "source_book": "Chamber of Secrets"
  }
]