[
  {
    "text": "}}\n\n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Olly Moss (Pottermore eBook)\n|interior = *Mary GrandPré (US)\n|narrator = *Stephen Fry (UK)\n*Jim Dale (US)\n|publisher = *Bloomsbury (UK, Canada)\n*Scholastic (US)\n*Raincoast Books (Canada (formerly))\n*Yapı Kredi Yayınları (Turkey)\n|release date = 21 July 2007\n|pages = *759 (US)\n*610 (UK)\n*690 (Turkey)\n|preceded by = \n|followed by = \n}}\n\nHarry Potter and the Deathly Hallows is the seventh and final book in the Harry Potter series by J. K. Rowling. It was released on 21 July 2007 at 00:01 am local time in English-speaking countries.\n\nIt was followed by a sequel to the original series, .\n\nThe title was first released to the public through a hangman game posted by J. K. Rowling on her official website on 21 December 2006. Shortly afterwards, it was confirmed by the publishers. Rowling left a note, written on a bust of Hermes in her room at the Balmoral Hotel in Edinburgh, saying, \"JK Rowling finished writing Harry Potter and the Deathly Hallows in this room (652) on 11th Jan 2007\". On her website she said, \"While each of the previous Potter books has strong claims on my affections, Deathly Hallows is my favourite, and that is the most wonderful way to finish the series.\" She has previously said that although all the books carry on the story, Deathly Hallows'' is more a continuation of the story in the previous book, , than has been the case with any other book in the series. It is the fastest-selling book of all time, selling 20 million copies in the first 24 hours.",
    "section": "General",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "The dedication of this book is split seven ways.\nTo Neil\nTo Jessica\nTo David\nTo Kenzie\nTo Di\nTo Anne\nAnd to You\nIf you have stuck with Harry until the very end.\n\nThe \"seven-way split\" refers to some of those with whom Jo has shared her life while writing Harry:\n\n*Dr Neil Murray is Jo's husband.\n*Jessica, David, and Mackenzie are her children.\n*Di is Jo's younger sister, Dianne.\n*Anne is Jo's mother, who died at 45 of MS. (Although Jo's mother did not know of the books since she died early on, Jo has said her death had a profound influence on how the series was written).\n*The final dedication is to all the fans who have made Harry's journey their own.\n*The seven dedications could be a reference to the seven books in the series, or seven Horcruxes, or the fact that seven is the most powerful magical number.",
    "section": "Dedication",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Oh, the torment bred in the race, \nThe grinding scream of death\nAnd the stroke that hits the vein,\nThe haemorrhage none can staunch, the grief, \nThe curse no man can bear.\n\nBut there is a cure in the house, \nAnd not outside it, no, \nNot from others but from them, \nTheir bloody strife. We sing to you, \nDark gods beneath the earth.\n\nNow hear, you blissful powers underground – \nAnswer the call, send help. \nBless the children, give them triumph now. \n(Aeschylus, The Libation Bearers)\n\nDeath is but crossing the world, as friends do the seas; they live in one another still. For they must needs be present, that love and live in that which is omnipresent. In this divine glass they see face to face; and their converse is free, as well as pure. This is the comfort of friends, that though they may be said to die, yet their friendship and society are, in the best sense, ever present, because immortal.\n(William Penn, More Fruits of Solitude)",
    "section": "Epigraphs",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry is waiting in Privet Drive. The Order of the Phoenix is coming to escort him safely away without Voldemort and his supporters knowing - if they can. But what will Harry do then? How can he fulfil the momentous and seemingly impossible task that Professor Dumbledore has left him?\n\nAs he travels Harry discovers that a battle is breaking out at Hogwarts. He has to do anything to stop it even if that involves killing himself.",
    "section": "Book description",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "The seventh and final book begins with Voldemort and his Death Eaters having a meeting at Malfoy Manor. They are beginning to plan out how to kidnap Harry Potter during his evacuation from 4 Privet Drive when he will be vulnerable. After \"borrowing\" Lucius Malfoy's wand in order to annihilate Harry once and for all &mdash; Voldemort does so in a way that indicates Malfoy has no choice &mdash; Voldemort kills his captive, Charity Burbage (the Muggle Studies professor at Hogwarts) for teaching the subject and penning an article suggesting that Muggles should be treated as equals to pure-bloods. It's revealed during this meeting that Lucius has lost all of Voldemort's respect and that the Dark Lord's favour has shifted to Lucius's sister-in-law Bellatrix Lestrange, who has helped wreak chaos on the wizarding community; Severus Snape, who has enabled a clear field for his master's rise to power with his murder of Albus Dumbledore at Hogwarts; and Corban Yaxley, who has enabled the Death Eaters to infiltrate the Ministry of Magic by means of the Imperius Curse.",
    "section": "Chapter 1: The Dark Lord Ascending",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "]]\n\nHarry, meanwhile, is rummaging through his school trunk, sorting what he will need to take with him from what will be left behind. While taking a break, he reads some articles about Dumbledore. One is sympathetic, the other critical. In those obituaries, it is revealed that Albus's father Percival supposedly hated Muggles and had attacked three Muggle boys, earning himself imprisonment in Azkaban, where he later died. The other article is an interview by Rita Skeeter, concerning a forthcoming biography of Dumbledore entitled The Life and Lies of Albus Dumbledore, in which she hints that Dumbledore was responsible for the death of his younger sister Ariana, and that he was, at one time, a wizarding supremacist with Gellert Grindelwald.",
    "section": "Chapter 2: In Memoriam",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry is beginning to have regrets about not having asked Dumbledore more about his past, but this is soon forgotten as he leaves his home that night. He convinces Petunia, Vernon, and Dudley Dursley that they need to leave as well to avoid being captured by the Death Eaters. Eventually Order of the Phoenix members Dedalus Diggle and Hestia Jones arrive to escort them to an undisclosed location. Before leaving, Dudley admits that he cares about Harry and thanks him for saving his soul during the Dementor attack of 1995, and they shake hands. Petunia burst into tears saying what a gentleman her son was, yet Hestia objected, saying he didn't really say, \"Thank you.\" but Harry tells her he was.",
    "section": "Chapter 3: The Dursleys Departing",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Soon after, the Order of the Phoenix arrives with a plan to sneak Harry away from his house and avoid being captured by Voldemort. After initially opposing the plan, Harry acquiesces, seeing that he has no choice, and Ron, Fred, and George Weasley, along with Hermione Granger, Fleur Delacour, and Mundungus Fletcher, take Polyjuice Potion to make themselves look like Harry, in order to act as decoys for Voldemort. Each depart with a different Order member (Ron with Nymphadora Tonks, Fred with his father Arthur, George with Remus Lupin, Hermione with Kingsley Shacklebolt, Fleur with Bill, and Mundungus with Alastor Moody) to protect them while riding on broomsticks or Thestrals, while Harry leaves with Rubeus Hagrid in a side-car attached to Sirius Black's motorcycle. However, the plan goes badly wrong as the group is attacked by Death Eaters almost immediately after taking off, during which Hedwig is killed. Harry fights off Death Eaters by firing curses and hexes at them, while Rubeus uses a number of gadgets the motorcycle is now equipped with: a deployable solid brick wall, a net, and a dragon-fire booster.\n\nThe Death Eaters discover the real Harry after he attempts to Disarm an Imperiused Stan Shunpike. Moments later, Voldemort joins in the pursuit. Hagrid leaps off the bike at another Death Eater, and as Voldemort is about to kill Harry, the latter's wand acts of its own accord and shoots a curse at Voldemort that breaks Lucius' wand. Voldemort attempts to strike again, but at that moment, Harry enters the protective charms of the Tonks' home, and Voldemort and the Death Eaters are unable to follow him.",
    "section": "Chapter 4: The Seven Potters",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry finds that Hagrid has crashed in the garden and he is able to get out a simple \"Hagrid?\" before he too collapses.\n\nWhen Harry wakes up, he meets Tonks' parents, Ted and Andromeda, who have been taking care of him and Hagrid. The couple show the two a Portkey, which transports them straight to The Burrow. There, the casualties are counted: Hedwig was killed by a Killing Curse from a Death Eater; George's ear was cursed off by Severus Snape; and Mad-Eye was killed by Voldemort himself. George makes a joke about his ear being cursed of and says he’s feeling: “saint like” because he is “holey.”\n\nHarry later has a vision regarding his escape, as a result of a connection between his and Voldemort's minds, in which Voldemort questions Garrick Ollivander, who crafted the wands, about why Harry's wand acted as it did. Garrick is unable to explain.",
    "section": "Chapter 5: Fallen Warrior",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "During their time at The Burrow, Harry, Ron, and Hermione are kept busy with preparations for Bill and Fleur's wedding, which Harry suspects is an attempt by Molly Weasley to stop their planning and delay their departure. Nevertheless, they manage to get together and discuss their plans for completing the quest Dumbledore left them, to find and destroy Voldemort's Horcruxes.",
    "section": "Chapter 6: The Ghoul in Pyjamas",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "]]\nThe day before the wedding, Harry's 17th birthday, he dreams of Voldemort searching for someone known as \"Gregorovitch.\" For his birthday, he receives a number of gifts, the most useful being a new sneakoscope from Hermione. Knowing that Harry was about to leave, Ginny Weasley passionately kisses him as something to remember her by, which Ron \"accidentally\" interrupts.\n\nLater in the day, Minister for Magic Rufus Scrimgeour, arrives at The Burrow to give Harry, Ron, and Hermione Dumbledore's personal effects, which had been bequeathed to them in his will:\n\n*To Ron, the Deluminator, with the power to douse all lights in the surrounding area.\n*To Hermione, , a book of wizard-culture fairy tales written in Runes.\n*To Harry, Godric Gryffindor's Sword, and the first Golden Snitch Harry had ever caught in a Hogwarts Quidditch match.\n\nThe sword is withheld because, Rufus claimed, it was not Dumbledore's' to give. The three try to discover the purpose of the objects given to them, but are forced to give their attention to other matters, specifically Bill and Fleur's wedding the following day.",
    "section": "Chapter 7: The Will of Albus Dumbledore",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry disguises himself as Ron's \"cousin\" Barny Weasley for the wedding to avoid causing an uproar. After the ceremony, while Ron and Hermione are dancing, Harry speaks with Elphias Doge and Ron's great-aunt Muriel from whom he learns more less than savoury details from Dumbledore's past: Dumbledore had had a sister, Ariana, whose existence had been hushed up by the family and who Muriel believes was a Squib. Muriel then speculates whether it was Albus or Aberforth who killed Ariana. Elphias is shocked and will not believe Muriel and is brought to tears because of all of the lies. During the wedding celebration, Kingsley's Patronus arrives to warn the attendants that Voldemort has taken over the Ministry of Magic and Rufus has been killed.",
    "section": "Chapter 8: The Wedding",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "to Tottenham Court Road]]\nHarry, Ron, and Hermione flee the wedding, first arriving on Tottenham Court Road in Muggle London. There, they quickly make for a café to settle down and decide their next course of action. Though they think themselves safe for the moment, two Death Eaters suddenly locate them, almost immediately upon their arrival, and attack them. Harry, Ron, and Hermione manage to defeat the Death Eaters, but thinking themselves in danger in public, flee to 12 Grimmauld Place, former Order headquarters, where they hide. Although there was some debate whether Snape could get in, with reinforcement Death Eaters, but their fears were soon realised to be untrue as they reach the dilapidated house.",
    "section": "Chapter 9: A Place to Hide",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "]]\nThe first morning there, Harry finds the name Regulus Arcturus Black, the deceased younger brother of Sirius and a former Death Eater, on a bedroom door. Harry realises that Regulus was the \"R.A.B.\" from the faux-Horcrux Harry found with Dumbledore, and he, Hermione, and Ron begin searching the house for the real one. They soon surmise that the locket had indeed been in the house, at one time. Unable to find it, they call upon Kreacher, the Black family's house-elf. Kreacher tells the trio that he had helped Voldemort place the real Horcrux in the cave. After Regulus learned of this, however, he had ordered Kreacher to return with him to the cave in order to substitute a fake locket for the real one, as the Black family would have been safer not involved in Voldemort's affairs. Regulus was killed in the process while Kreacher escaped with the Horcrux locket. Kreacher also tells them that Mundungus stole the locket, and they send Kreacher to find him.",
    "section": "Chapter 10: Kreacher's Tale",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "While waiting for Kreacher, the trio are visited by Remus. He explains more of the situation: the Voldemort-controlled Ministry and Death Eaters are searching for Harry, claiming that he had a part in Dumbledore's death, and now openly persecuting Muggle-born wizards and witches. He then offers to join the trio in their quest, not wanting to remain with his wife, Nymphadora, who is pregnant with their child because he fears the child will be a werewolf like him. Harry calls him a coward for abandoning his son, and Remus angrily storms off. Later, Kreacher brings Mundungus back to 12 Grimmauld Place, but he has already given away the locket to Dolores Umbridge as a bribe.",
    "section": "Chapter 11: The Bribe",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "After a month of spying on the Ministry of Magic, the trio infiltrate it in order to retrieve the Horcrux from Umbridge. They ambush three employees and use Polyjuice Potion to impersonate them with Hermione taking on the appearance of Mafalda Hopkirk, Ron looking like Reginald Cattermole, and Harry impersonating Albert Runcorn.",
    "section": "Chapter 12: Magic is Might",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "After being separated, Harry discovers Alastor's magical eye has been taken by Umbridge. Thinking it a disgrace to Alastor's memory to keep it stuck in Umbridge's door, he steals the eye, so as to give it a proper burial and the respect it deserves. Once Harry reunites with Hermione, he witnesses the Muggle-Born Registration Commission, set up to convict Muggle-borns of \"stealing\" magic, at work. Enraged by what he sees, Harry stuns Umbridge and the Death Eater Corban Yaxley, who is now head of the Department of Magical Law Enforcement. Hermione takes the Horcrux, which Umbridge had falsely used to bolster her Pure-blood credentials, from Umbridge. By the time Harry and Hermione begin freeing the Muggle-borns, the Ministry knows that there are intruders in the building, having discovered Alastor's eye missing. Once they reunite with Ron, they encourage the Muggle-borns to flee the country.",
    "section": "Chapter 13: The Muggle-Born Registration Commission",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "They make for the exit, and as they escape, their hiding place is discovered, Ron is splinched, and they are forced to flee to the countryside, where they move from place to place, never staying anywhere for more than a night or two. One night, Harry has a vision of Voldemort interrogating Gregorovitch and realises that Voldemort is searching for something Gregorovitch once had but which was stolen by a young man long ago.",
    "section": "Chapter 14: The Thief",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "After several weeks of travelling in which they accomplish nothing, they overhear a conversation between Ted, Dirk Cresswell, Dean Thomas, and Goblins Griphook and Gornuk, wherein it is revealed that Godric Gryffindor's sword, which had been in Dumbledore's possession and was then sent to the Lestrange Vault for protection, is actually a copy. They also mention that the whereabouts of the real sword are unknown. Harry, Hermione, and Ron also overhear that some students attempted to steal the sword from Snape, prior to its removal. Upon hearing that the perpetrators were their friends, the trio worry about the punishment but are relieved to hear that their friends only served detention with Rubeus Hagrid. Harry and Hermione hear all this and are heartened, and after questioning the portrait of Phineas Nigellus Black, they discover that the sword had last been used by Dumbledore on another Horcrux, Marvolo Gaunt's ring.\n\nHermione realises that it must be impregnated with basilisk venom and therefore can destroy Horcruxes. Ron is discouraged, feeling that with the sword now necessary as well and out of reach, their quest is becoming hopeless. He argues with Harry and it becomes apparent that the locket Horcrux has messed with Ron's mind, making him behave the way he is, and angrily departs claiming that Hermione had chosen Harry over himself when she decides to stay, leaving Harry and Hermione together.",
    "section": "Chapter 15: The Goblin's Revenge",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Hermione is distraught upon Ron's departure, and Harry is angry, but the two of them realise they will have to continue without him. After many more listless weeks, they make their way to Godric's Hollow on the off-chance Dumbledore left the sword there for them, with Bathilda Bagshot, author of A History of Magic. Arriving in Godric's Hollow on Christmas Eve, the two first visit the graveyard where both Harry and Dumbledore's families are buried. After sharing an emotional moment and laying a wreath on Harry’s parents' grave, they visit the memorial to Harry's family, and then encounter the historian Bathilda, who was an old family friend of the Dumbledores.",
    "section": "Chapter 16: Godric's Hollow",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry and Hermione follow her to her old, disgusting home, where they find a picture frame of Gellert, who is Bathilda's great-nephew and, long ago, was Dumbledore's childhood friend. However, Harry and Hermione don't realise that the real Bathilda has been killed and her body has been taken over by Voldemort's pet and Horcrux Nagini. Only Harry can understand the very little that Bathilda speaks as he can speak Parseltongue, and Nagini is a snake.\n\nBathilda coaxes Harry up the stairs, ordering Hermione to stay behind, in order to ambush Harry. Hermione seems reluctant, but Harry thinks that by following her perhaps she may present him with the Gryffindor sword.\n\nOnce Harry is upstairs, Bathilda's body crumbles and Nagini flops out, and begins attacking Harry.\n\nUpon leaving, Hermione runs upstairs to help Harry, unfortunately her Blasting Curse rebounds in the chaos and cracks Harry's wand in two.\n\nAs they Apparate, the very second that Voldemort appears, Harry's mind begins to flash back to the night in which his lightning scar on his forehead became so, and it reveals exactly how Voldemort had killed Harry's parents.",
    "section": "Chapter 17: Bathilda's Secret",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry was briefly incapacitated following the incident in Godric's Hollow, and he and Hermione spend Harry's few days convalescing in the Forest of Dean where Harry sits down to vindictively read Rita's book The Life and Lies of Albus Dumbledore. He discovers that the boy he saw in Voldemort's mind is none other than Gellert and that Dumbledore and he had been good friends as teenagers and had shared the idea that wizards should rule over the Muggles. Making this discovery, Harry reaches a new level of disillusionment with his former mentor.",
    "section": "Chapter 18: The Life and Lies of Albus Dumbledore",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "While Hermione sleeps, Harry resumes the position of keeping watch outside the tent. Not long after a silver doe appears. It is obviously a Patronus, due to the silvery texture and appearance. The doe leads Harry away from the camp site and to a small, frozen lake, where, at the bottom, lies Godric Gryffindor's Sword. Harry breaks the ice using Hermione's wand, strips to his underpants, and attempts to retrieve the sword. Only when he attempts does Salazar Slytherin's locket sense that the sword is near, it wraps itself so tightly around Harry's neck that it cuts his flesh, keeps him from getting to the surface for air, and begins to both strangle and drown him. Harry tries to make it back to the surface, but he only kicks himself into the rocky and icy part of the pool. Harry attempts to loosen the locket but his fingers are too frozen. Harry begins to suffocate, and he feels a pair of arms (Harry thinks they belong to Death) wrap around his chest before passing out. When Harry comes to, he thinks Hermione has come and saved him again, but she hasn't -- it's Ron! Ron was also able to retrieve the sword and cut the locket off of Harry's neck. Ron asks Harry why he didn't take the Horcrux off first, then explains that he'd been looking for him and Hermione all day. Ron also reveals that while running to the pool, he saw something move behind the trees. Harry quickly dresses himself and tells Ron that since he was the one who got the sword out of the pool, he has to be the one to destroy the Horcrux. Harry speaks Parseltongue in order for the locket to open and be able to be destroyed. Tom Riddle's eye appears when it opens and a voice begins speaking to Ron, teasing him. From the locket appears two figures that are meant to belittle any person attempting to destroy it in order to stop them: Riddle-Harry, and Riddle-Hermione, who was more beautiful and at the same time more terrible than the real Hermione. They tease Ron, all the time Harry is telling Ron to stab it; Riddle-Harry saying that Ron's mother would rather have had him for a son than Ron. Riddle-Hermione saying that nobody would ever look to him when Harry was around.",
    "section": "Chapter 19: The Silver Doe",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "She then proceeds to wrap her arms around Riddle-Harry. They kiss romantically, and it is at that moment that Ron almost fails in both spirit and mind. He overcomes his weakness and smashes it with the sword, and the Horcrux is destroyed. Harry tells Ron that he has no deep romantic love feelings for Hermione, he loves her like a sister, and that she cried for weeks once he left. They hug and reconcile, and Ron is there to stay. When they head back to the camp, they awake Hermione to tell her of the good news: The Horcrux was destroyed and Ron has returned. She, however, doesn't seem too happy with Ron leaving them. She begins to beat him up. Hermione is furious at Ron for leaving for weeks and then suddenly showing back up. Ron explains that he wanted to come back as soon as he left but he ran into some Snatchers, whom he tricked into thinking he was Stan Shunpike and escaped with an extra wand. He then tells them that early Christmas morning, he heard Harry and Hermione talking through the Deluminator (discussing Harry's broken wand). Next, he explains that the Deluminator showed him the way back to them. He tells Harry and Hermione how he saw the silver doe while waiting for someone to show themselves and Harry following it, then explains how he watched Harry jump into the pool and then after a while realised something was wrong and rescued Harry, then grabbed the sword. He and Harry tell her about vanquishing the Horcrux (though they're careful about skipping the part where Riddle-Harry and Riddle-Hermione show up). In the end, Hermione lets him go and goes to bed without another word, while Harry and Ron talk about how she could have been worse.",
    "section": "Chapter 19: The Silver Doe",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Ron reveals that he was able to find Harry with the aid of Dumbledore's gift, the Deluminator, which has many more useful abilities than they originally thought. He also reveals that Voldemort's name has been \"made Taboo:\" anybody saying it can be traced and located, which is how they were found in the café back on Tottenham Court Road. Hermione, who has recently been poring over realises their next necessary step. She tells them that they need to speak to Xenophilius Lovegood and ask him about Grindelwald's mark, a symbol which has shown up time and again during their journey. Only days after escaping from Voldemort in Godric's Hollow, the trio begin searching the hills surrounding Ottery St Catchpole for the Lovegood residence.",
    "section": "Chapter 20: Xenophilius Lovegood",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "At the Lovegood House, Harry, Ron, and Hermione are told that the symbol actually represents the Deathly Hallows. Mr Lovegood then introduces them to The Tale of the Three Brothers, a fairy tale about three men who bested Death and who received a magical item for it: An unbeatable wand (called the Elder Wand), a stone which could bring back the dead (the Resurrection Stone), and an Invisibility Cloak that can hide the wearer from Death itself and never failed with age, unlike most cloaks of that nature. Lovegood tells them that the three items are collectively represented by the symbol, and whoever masters all three artefacts will be the \"Master of Death.\" Harry believes his own cloak to be the legendary Invisibility Cloak and is very excited. They soon discover that Lovegood has betrayed them to the Ministry; Luna, his daughter, was taken captive earlier in the year because he was encouraging support for Harry, and he believes that giving them Harry will win her freedom. The trio barely escape from the Death Eaters sent to fetch them. In an ingenious plan to ensure escape, but also protect Ron's alibi, Hermione throws Harry's cloak over Ron and blasts away the floor. When they are sighted by the Death Eaters, she guides Harry and Ron as they Disapparate away.",
    "section": "Chapter 21: The Tale of the Three Brothers",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "After hearing the story of the Deathly Hallows, Harry becomes obsessed with finding them, and he begins to neglect his duties as the group's leader as he sits in reverie. With Harry not performing, Ron steps up to lead them as they venture up and down the island checking any place with links to the wizarding world for signs of another Horcrux. After listless weeks, Ron finally manages to tune into a rogue wizard radio broadcast called \"Potterwatch,\" run by Lee Jordan, which reports the news as it actually happened unlike the Daily Prophet. The broadcast is quite entertaining, and Harry laughs for the first time in months. However, after the programme, Harry accidentally says Voldemort's name, breaking the Taboo, and a group of Snatchers find Harry, Ron, and Hermione.",
    "section": "Chapter 22: The Deathly Hallows",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Hermione's quick thinking comes in handy when she uses a jinx to disfigure Harry's face so he is not immediately recognisable. They all give false aliases, but the Snatchers soon find out their true identities, albeit a little uncertainty. Because of their uncertainty, the Snatchers take the trio to Malfoy Manor.\n\nThere, they are taken into the drawing room to have their identities confirmed. The Malfoys' son Draco is home for the Easter holidays. He is reluctant to identify the trio, but when Lucius Malfoy is satisfied that the prisoners are indeed Harry Potter and his accomplices, he reaches for his Dark Mark. At that instant Bellatrix Lestrange, who was with the Malfoys, stops Lucius, because she saw a sword being carried by one of the Snatchers and believes it to be Godric Gryffindor's Sword which was supposed to be in her vault at Gringotts. She singles out Hermione for torture and interrogation, although Ron tries and fails to take her place, to find how the trio acquired the sword, while Ron and Harry are locked in a cellar with Dean, Griphook, Garrick Ollivander, and Luna. Hearing Hermione's cries, Harry locates his broken shard of mirror, sees a flash of blue in it resembling Dumbledore's eye and in desperation begs for help. Upstairs, Hermione lies to Bellatrix, saying that the sword is a copy. Bellatrix sends Draco to fetch Griphook who Harry convinces to corroborate Hermione's story. As Draco slams the door, Dobby Apparates into the cellar. Harry orders him to take Dean, Luna and Ollivander first and then return for everyone else. When Dobby Disapparates, the noise is heard upstairs, and Wormtail is sent to investigate.\n\nWhen he reaches the cellar, Harry and Ron attack him, but Wormtail resists, losing his wand to Ron, but grabbing Harry's neck with his artificial hand. Harry calls upon the life debt that Wormtail owes him, and Pettigrew momentarily hesitates, and his artificial hand, made for him by Voldemort three years previous, immediately strangles Wormtail to death for the mercy he has shown. At that moment, Hermione lets out a horrible scream of pain. Harry and Ron leave Wormtail's body on the floor and rush upstairs to find Bellatrix questioning Griphook and an unconscious Hermione at her feet. Griphook tells Bellatrix that the sword is, in fact, a copy. Bellatrix kicks him aside and presses her Dark Mark. When they crash through the door, Ron disarms Bellatrix, and he and Harry begin a fierce exchange of spells with the others in the room. They are forced to stop when Bellatrix threatens to cut Hermione's throat. As Voldemort approaches, Dobby returns and drops a chandelier onto Bellatrix, who drops Hermione and runs away. The chandelier falls onto the goblin and Hermione and shards of glass fly all over the place. Ron sprints to pull Hermione from the wreckage as Harry wrests three wands from Draco; his wand and the wands Ron and Harry had taken during the earlier skirmish. Harry picks up Griphook, seizes Dobby and Disapparates as Ron does the same with Hermione. They escape as Voldemort is close to arriving, but Dobby is struck by Bellatrix's knife as they flee. They Apparate to Shell Cottage, Bill and Fleur's house, as Voldemort makes it to Malfoy Manor. As Ron takes Hermione inside, Harry sees that Dobby has been struck with Bellatrix's sharp knife and that he is dying. Dobby dies in Harry's arms with the final words, \"Harry...Potter...\" as Harry is forced to watch helplessly.",
    "section": "Chapter 23: Malfoy Manor",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "As Harry stares at dead Dobby curled up on the grass, he can't help but remember staring at Dumbledore's corpse the same way. Bill suggests that he bury him. Harry believes that for Dobby's bravery, he deserves a funeral just as grand, and he refuses to use magic. He digs Dobby's grave by hand as Hermione and Griphook's injuries are tended to in the house. While digging the grave, Harry does some thinking. He realises that Dumbledore had been right about Dobby, Ron and Pettigrew. He comes to a reaffirmation of faith in his old mentor and loses his burning obsession with the Deathly Hallows. Dean takes the injured Griphook inside as Bill tells Harry that Ron has taken Hermione inside and that she'll be alright. \n\nDean and Ron come outside. Ron says to Harry that Hermione is doing better and Fleur is looking after her. Then Dean and Ron join Harry with digging the grave. The group holds a funeral for Dobby. They provide clothes for him; Harry wraps him in his jacket, Ron gives him shoes and socks, and Dean gives him a hat. Luna says a few words for him, as Harry is too grief-stricken to speak.\n\nRon and Dean give thanks to Dobby, and Harry manages to choke out a goodbye as he forces himself not to break down. He asks for some alone time, then finds a large stone and places it, pillowlike, on Dobby's grave with the epitaph \"HERE LIES DOBBY, A FREE ELF.\" He looks at the grave once more and heads back inside.\n\nOnce inside, Harry washes his hands, then tells Bill he needs to talk to Ollivander and Griphook. He meets up with Ron and Hermione and then questions Griphook about how to break into Gringotts Wizarding Bank, believing that a Horcrux is hidden in Bellatrix's vault. This feeling was based on her reaction when she saw that the trio had Gryffindor's Sword. Harry then questions Ollivander about the Elder Wand, revealing his deep insight into Lord Voldemort's way of thinking. Ollivander also gives him a lesson on wand mechanics; when a wizard disarms, kills, or otherwise defeats another wizard, they can use that wizard's wand as well as their own. Harry tells Ron and Hermione that Voldemort is seeking the Elder Wand as the way to defeat him. While telling them this, he receives confirmation as he has a vision in which Voldemort successfully steals the Elder Wand from the tomb of Dumbledore.",
    "section": "Chapter 24: The Wandmaker",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Griphook eventually agrees to help the trio, in return for Gryffindor's sword. Harry reluctantly concedes that he will have to give up the sword but plans to hand over the sword after all the Horcruxes have been destroyed. He tells Griphook he can have the sword after they have broken into the Bank, but he is very careful not to mention when, as Goblins are notoriously known for going back on their word. The trio spends nearly a month planning in one of the Cottages cramped bedrooms, only seeing daylight or the other occupants of the house at mealtimes. Harry, as well as the other two, comes to strongly dislike Griphook because the Goblin seems to relish causing pain. During their stay, Remus Lupin visits them again. Chastened by Harry, he had returned to Tonks by Christmas, and he came to Shell Cottage to tell everyone that she has given birth to a son who does not have his werewolf tendencies but instead possesses Tonks's Metamorphmagus abilities. Lupin also gives Harry the honour of being Teddy Lupin's godfather. After many rounds of wine, he departs, and as they are cleaning up, Bill corners Harry and tells him to be wary of Griphook. Harry realises that if keeps this up, he'll be just as reckless a godfather to Teddy as Sirius had been to him.",
    "section": "Chapter 25: Shell Cottage",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "After extensive planning, on 1 May the group sets out for Gringotts to obtain the Horcrux. Hermione poses by way of Polyjuice Potion as Bellatrix using a lone hair that had been left on her during the Skirmish at Malfoy Manor. Ron is disguised as a fictional foreign wizard, and Griphook and Harry go under the Invisibility cloak. Through their use of disguises and Harry's repeated use of the Imperius Curse, they manage to gain access to the bank. As they are travelling down the tunnel to the Lestrange Vault, their cover is blown by Thief's Downfall, and the Gringotts' defences are set against them. With Griphook's help, they gain access to the vault and find the Horcrux, Helga Hufflepuff's Cup. Harry grabs it, but Griphook betrays their presence and flees with the sword. Many guards begin to pour into the vicinity as Harry, Ron, and Hermione exit the vault. Fighting off the guards, they narrowly escape on the back of a captive half-blind dragon which is released into the wild following their escape. Gryffindor's sword is kept by Griphook.",
    "section": "Chapter 26: Gringotts",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Sitting on the edge of the lake where they dismounted from the dragon, Harry has a vision shortly after their escape in which Lord Voldemort discovers that his secret has been discovered. In his rage, he kills dozens of Gringotts employers and lists off all the locations of the Horcruxes, now that he realises they are being sought after and destroyed. Voldemort inadvertently reveals that the unknown Horcrux, which Harry suspects to be a relic of Rowena Ravenclaw, founder of Ravenclaw house, is safe within Hogwarts Castle, confirming a belief Harry had shared with the others to much derision. Harry realises that if they want to get the Horcrux within Hogwarts, they need to do so immediately, before Voldemort finds his other Horcruxes are missing. They immediately Apparate to Hogsmeade to find a way to sneak into the school.",
    "section": "Chapter 27: The Final Hiding Place",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "When they arrive in Hogsmeade, they immediately trigger the Caterwauling Charm placed on the village alerting the Death Eaters to their presence. Harry and friends are cornered by the Death Eaters, but are saved by Aberforth Dumbledore, Albus Dumbledore's younger brother. Harry also discovers that Aberforth was the one he saw in the mirror at Malfoy Manor. During the ensuing argument, Aberforth urges the trio to flee, but they refuse to give up. Aberforth then tells them the truth about Ariana; She had been a witch, but an attack on her by Muggle boys had left her unable to control her natural magical abilities. Percival attacked the Muggles in retaliation. The family kept Ariana and her incurable condition secret to protect her, with Kendra and Aberforth caring for her the most. However, one of Ariana's magical outbursts killed Kendra. With Aberforth about to return to school, Dumbledore took over care of Ariana. At this time he was introduced to Gellert Grindelwald. He began to neglect his duties as he was planning his uprising with Grindelwald, for which he was confronted by Aberforth. Grindelwald, Albus, and Aberforth got into a duel, in which Ariana was accidentally killed in the struggle.",
    "section": "Chapter 28: The Missing Mirror",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "After sharing this sad story and being told by Harry that his brother regretted that moment to his death, Aberforth opens a secret passageway to Hogwarts, where Neville Longbottom greets them. The trio learn that Neville, Ginny, and Luna had restarted Dumbledore's Army to resist the regime of Severus Snape, who was made headmaster following Voldemort's takeover of the Ministry and that the members of the reconstituted Dumbledore's Army have taken shelter in the Room of Requirement to hide from Snape's forces.\n\nBelieving that Harry's return meant revolution, Neville summons members of the D.A. who have been forced to leave the school, including Ginny, Luna, and Dean, or those who had graduated previously, such as Fred and George Weasley, Harry's old Quidditch team, and his first girlfriend, Cho Chang. Harry asks them what they know about any artefact that belonged to Ravenclaw, which Dumbledore believed to be a Horcrux. However, the only known relic is Rowena Ravenclaw's Diadem, which has been lost for centuries. Wishing to see what the diadem looks like, Harry and Luna venture under Harry's Invisibility cloak to Ravenclaw Tower. He reveals himself to get a closer look at the diadem but is seen by Alecto Carrow who had been stationed to watch the room.",
    "section": "Chapter 29: The Lost Diadem",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "She immediately summons Voldemort, but she is immediately stunned by Luna. Soon, both Amycus Carrow and Minerva McGonagall arrive to see what the disturbance is about. When Carrow suggests that they push the blame off onto the students, McGonagall protests, and he spits in her face. In a rage, Harry uses the Cruciatus Curse on him until he passes out. Telling her that he is on a mission for Dumbledore, Harry asks McGonagall for time to search the castle, but before plans can be made, they come across Severus Snape in the corridor, and in a fierce duel, Snape is run out of the building.\n\nShortly after Harry's arrival, Voldemort discovers that two more of his Horcruxes have disappeared and gathers an army of Death Eaters, Dementors, and his other supporters, in order to assault the school and kill Harry once and for all. After forcing Snape to flee, McGonagall and Kingsley Shacklebolt, who only recently arrived, raise their own army consisting of teachers, students, the D.A, the Order of the Phoenix, and enchanted statues and suits of armour.",
    "section": "Chapter 30: The Sacking of Severus Snape",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "At midnight, the Battle of Hogwarts begins. All the while Harry tries to locate the diadem and Ron and Hermione who had gone missing. Thinking that the diadem had not been seen in living memory, he speaks with the Grey Lady and surmises that Tom Riddle had learned of the diadem's location from her. Shortly after the battle begins, Harry recalls seeing the diadem in the Room of Requirement and meets up with Ron and Hermione, who had disappeared in order to retrieve Basilisk fangs from the Chamber of Secrets to destroy the next two Horcruxes. The trio re-enter the Room of Requirement, and Ron remembers all about the house-elves in the kitchens. He does not feel that it is right to order them to die for them, so he makes his thoughts known. With a clatter, Hermione drops all the basilisk fangs she is holding, and she and Ron share a deep, meaningful kiss, completely forgetting that Harry is there and that there is a war going on. After being reminded, they search the Room of Hidden Things, a version of the Room of Requirement that students have used to hide contraband over the centuries. Once they are inside, they are confronted by Malfoy and his cronies Vincent Crabbe and Gregory Goyle. During a short duel in which Crabbe aims to kill, Crabbe mishandles the Fiendfyre spell, causing a huge inferno. Harry, Ron, Hermione, Malfoy, and Goyle escape on two old brooms, and the diadem is destroyed by the fire, along with Crabbe. Soon after, Fred and Percy Weasley, who had just reconciled with his family, are seen duelling with two Death Eaters one of whom is Minister for Magic Pius Thicknesse. After they defeat them, there is an explosion in the corridor, and Fred is killed, deeply affecting his parents, sister and brothers, as well as Harry and Hermione.\n\nWith the cup and diadem destroyed, only one Horcrux remains. Voldemort's snake, Nagini. The trio fight their way through the castle, as the two armies battle furiously, dodging curses, Death Eaters, and Acromantulas and saving Draco Malfoy's life again along the way. When they reach the Entrance Hall, they find that Giants have joined the battle. Before leaving Hermione spots Fenrir Greyback trying to attack Lavender Brown on a balcony and casts a spell that knocks them off. While Lavender stirs feebly, Fenrir tries to get up but Sybill Trelawney drops a Crystal ball on his head and he is knocked unconscious. It is presumed that Lavender dies later. Trelawney then grabs another Crystal ball and uses her wand to throw one with a \"tennis like serve\". Once onto the grounds, they come across Voldemort's Dementors. Unable to produce Patronuses, because of the horrors they have witnessed, all seems lost, and Harry even welcomes the oblivion that accompanies the Dementor's Kiss. They are saved by Seamus, Luna, and Ernie, who conjure Patronuses long enough for Harry to summon the will to drive the Dementors away. Then Seamus, Luna, and Ernie run to safety.",
    "section": "Chapter 31: The Battle of Hogwarts",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry, Hermione, and Ron finally make it to the Shrieking Shack, where Voldemort is waiting out the battle. They discover him talking to Severus Snape, who wishes to participate in the battle to find Harry, but Voldemort's only concern is that the Elder Wand does not seem to work properly for him. He coldly sets his snake on Snape, believing that the wand cannot serve him while Snape is still alive, as Snape had killed Dumbledore.\nAs he dies, Harry runs out to him, and Snape gives up his memories to Harry, and his last request was to look into Harry's eyes who has the same eyes as his mother Lily. Voldemort then delivers an ultimatum; if Harry does not surrender himself in an hour, he will join the battle, and all in Hogwarts will be destroyed. Returning to the castle, Harry sees the defenders looking for loved ones and counting up the dead, with Lupin and Tonks laying next to Colin Creevey and Fred. After seeing this, Harry makes his way up to Dumbledore's office to view the memories Snape left him.",
    "section": "Chapter 32: The Elder Wand",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry dives into Snape's memories, learning several surprising secrets. Snape and Lily were friends as children, back when Lily was first discovering her magical powers. The two remained close friends through school, even after Lily was sorted into Gryffindor and Snape was sorted into Slytherin, until the day Snape angrily called Lily a mudblood while being teased by James and Sirius. This ended their friendship permanently, as Lily refused to accept Snape's many apologies despite his total regret and remorse leading to him joining the Death Eaters. After overhearing the prophecy involving Harry and Voldemort and reporting it to the Dark Lord, Snape was horrified when Lily was targeted and went to Dumbledore begging him to keep her safe. He explained to Albus that he lacks any compassion towards James, Harry, and the Order, but to save Lily he decided to betray Riddle, become a spy and supply the enemies with important information. Dumbledore agreed on the condition Snape promised his total allegiance to him, however even he couldn't protect them due to their poor judgement in making Wormtail their Secret Keeper. Afterwards, Dumbledore knew the day would come Voldemort would return and Snape promised to protect Harry no matter what in Lily's memory, which he did throughout his time at the school despite the boy reminding Snape of James and the risk to his life if Voldemort or the Death Eaters should find out. Upon Voldemort's return, Dumbledore sent Snape to return to the Death Eater's ranks to act as a double agent for him.\n\nHarry then finds out that, prior to his sixth year, Dumbledore had put on the ring in a foolish attempt to see his deceased family only to fall victim to a curse which, despite Snape's efforts, would kill him within a year. Dumbledore then tells Snape to do what he could to protect Draco and, knowing that Voldemort had ordered the boy to kill the headmaster, to take over the task. As well as preventing damage to Draco's soul from committing a murder, he would also be sparing Dumbledore from a painful death. Dumbledore then explains why Harry is so important; when Voldemort's body was destroyed, a piece of his soul latched onto the baby since he was closest living thing (explaining why Harry can speak Parseltongue). In effect, Harry himself is a horcrux and must be killed by Voldemort personally to destroy that part of his soul. Snape is horrified that they have essentially been preparing Harry to die at the proper time, and when Dumbledore notes that despite everything Snape does truly care for Harry, Snape summons his Patronus which is a doe... his love for Lily being so strong, his Patronus changed to be the same as hers (as well as revealing that it was Snape who led Harry to the Sword of Gryffindor in the lake).",
    "section": "Chapter 33: The Prince's Tale",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry emerges from the memories, now knowing that Snape was always working for Dumbledore against Voldemort and that he must die to destroy the Dark Lord forever. Resigned to his fate, Harry sneaks out of the castle under his Invisibility cloak and stops to tell Neville to kill Nagini, the other remaining Horcrux, at all costs. Then, before he sacrifices himself to Voldemort, he opens the Golden Snitch left to him by Dumbledore to reveal the Resurrection Stone. He uses it to summon the spirits of his parents, of Sirius, and of Remus Lupin, all of whom provide emotional support as Harry walks to his death. He enters Voldemort's camp and shows himself. He tries to betray fear as he allows himself to be hit with the Killing Curse.",
    "section": "Chapter 34: The Forest Again",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "However, Harry finds himself in a sort of dream and meets the deceased Albus Dumbledore in what appears to be a deserted King's Cross Station. He appears to be in a Limbo state in which he can speak to Dumbledore. Here, it is explained he cannot be killed by Voldemort whilst Voldemort lives. Since Voldemort used Harry's blood to recreate his body, Lily's protection over Harry binds the two and therefore tethers Harry to life. Dumbledore then gives Harry a theory on why his wand acted of its own accord: as a result of their encounter in the Little Hangleton graveyard three years previous, Harry's wand was imbued with some of the qualities of Voldemort's wand and regurgitated some of his own magic back at him. He also discovers that the part of Voldemort's soul he had had inside himself had been destroyed by the attempted murder; Harry was in fact a Horcrux. Near a bench Voldemort's soul is represented as a naked flayed child, whimpering and struggling for breath.\n\nDumbledore confides in Harry that he had sought the Hallows, with Grindelwald, for less than noble reasons and that the death of his sister resulted from their association. In Dumbledore's opinion, only Harry is worthy of possessing the Hallows. With all of his secrets in the open, Harry can no longer find himself angry with Dumbledore even after all he has been through, fully reconciling with his old mentor. Harry is given the choice of moving \"on\" to the afterlife or returning to life to try to stop Voldemort. Harry chooses to return to life and fight back.",
    "section": "Chapter 35: King's Cross",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Back in the forest, Voldemort appears to have collapsed at the same time Harry did. Fearing not all went according to plan, he orders Narcissa Malfoy to check and see if Harry is dead, and after being subtly notified that her son, Draco, is alive and well inside Hogwarts, she tells Voldemort and the Death Eaters that Harry is indeed dead, so that she may enter the castle and find him. Voldemort then attempts to desecrate Harry's \"corpse\" by casting the Cruciatus Curse on it multiple times, but Harry feels no pain from these curses. Afterwards, Voldemort orders Hagrid to carry Harry back to Hogwarts during the Death Eaters victory march. Voldemort then challenges Hogwarts to surrender, but is faced down by Neville. Voldemort proceeds to torture Neville by summoning the Sorting Hat, placing it on his head, and setting it aflame. At that moment, Hogwarts reinforcements appear near the school boundaries and run toward the school, the centaurs join the side of Hogwarts in the battle, and the battle recommences. In the confusion, Harry covers himself with the Invisibility Cloak. Nagini, the last Horcrux, is beheaded by Neville using Gryffindor's sword, pulled from the Sorting Hat in part for his bravery. Harry fights his way into the Great Hall casting curses and protective spells from underneath his cloak, where a huge battle is taking place as Hogwarts fighters, Dumbledore's Army, the Order of the Phoenix, and other forces battle the remnants of Voldemort's army. Eventually, All the Death Eaters are either killed or defeated, with just Voldemort and Bellatrix left standing. Voldemort duels Minerva McGonagall, his old mentor Horace Slughorn, and Kingsley Shacklebolt, while nearby Bellatrix battles Ginny, Luna, and Hermione. After Ginny narrowly avoids a Killing Curse, her mother takes over and brutally kills Bellatrix in a duel. In his deep fury and anger, Voldemort tries to kill Mrs Weasley, but Harry reveals himself by casting a Shield Charm to protect her. Coming face-to-face with Voldemort in the Great Hall, Harry is seemingly faced with impossible odds: Voldemort possesses the Elder Wand and has murdered whom he thought to be its previous master, Severus Snape. Harry believes differently based on the information he received from Ollivander; as Harry sees it, Draco Malfoy became the true master of the Elder Wand when he disarmed Dumbledore against his will, therefore, defeating him.",
    "section": "Chapter 36: The Flaw in the Plan",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Since Harry had taken Malfoy's wand at Malfoy Manor, full mastery and control of the wand then passed to Harry, not Voldemort. The two debate this point among the verbal barbs they trade, with Harry revealing that Dumbledore also asked Snape to kill him if necessary to prevent anyone else from defeating him and having the Elder Wand's power die with him, but that was prevented by Draco disarming him. Harry also attempts to save Voldemort, whom he is calling by his given name, Tom Riddle, from himself by telling him to feel some remorse for all he had done. This shocks Voldemort more than anything Harry has ever said to him up to this point. Harry explains all of this to Voldemort, who chooses not to believe him. Just as the sun breaks the horizon, Voldemort attacks Harry. When Voldemort's Killing Curse from the Elder Wand strikes Harry's Disarming Charm, the Elder Wand flies out of Voldemort's hand into Harry's hand and the Killing Curse is directed towards Voldemort. Harry's theory has been proven correct; the Elder Wand refuses to kill its true master. Voldemort is bereft of all his Horcruxes and is finally killed. His mutilated soul returns to Limbo for eternity. Harry is congratulated for his final victory. The dead are buried with respect, with Voldemort buried separately. In the wake of the battle, major changes begin to occur in the Wizarding world. Kingsley Shacklebolt is appointed interim Minister for Magic and the Death Eaters are fleeing for their lives. Harry takes the time to explain to Ron and Hermione everything that happened as they walk to the Headmaster's office. Harry is now master of all three Deathly Hallows but chooses to leave the Resurrection Stone lost in the forest where he dropped it, and plans to return the Elder Wand to Dumbledore's tomb in the hope that when he dies its tremendous power will be broken, although not before he uses it to fully repair his own holly and phoenix feather wand. Dumbledore's portrait applauds his decision.",
    "section": "Chapter 36: The Flaw in the Plan",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "In the story's epilogue, taking place nineteen years later, that is in 2017, Harry, Ginny, Hermione, and Ron all meet at King's Cross, preparing to send their children to Hogwarts, where Neville Longbottom has become the Herbology professor. The four adults have remained very close friends, and their children too are very close. Harry and Ginny are married with three children named James Sirius, their eldest, Albus Severus, starting his first year, and Lily Luna Potter, who complains about having to wait two years to go to Hogwarts. Ron and Hermione are also married and have their own two children named Rose, starting her first year with Albus, and Hugo, who has to wait two more years like Lily. Harry incidentally sees Draco Malfoy with his wife (later disclosed as Astoria Greengrass) and son Scorpius, and is acknowledged with a curt nod. James spots Ted Lupin kissing Victoire Weasley, interrupts them, and comes running to tell the others. He also teases Albus that he might be sorted in Slytherin. As James gets on the train, Albus confides in his father his fear of being sorted into Slytherin. Harry tells him that he was named after two Hogwarts headmasters, one of whom was a Slytherin and probably the bravest man he ever knew. When Albus is still scared, Harry tells him that the Hat will also take into account his personal preference, as it had when Harry himself was sorted—something he has never shared with any of his kids. As he watches the train pull away, Harry absent-mindedly touches the lightning bolt scar on his forehead, noting that it had not pained him for nineteen years. The story closes with the words, \"The scar had not pained him for nineteen years. All was well.\"",
    "section": "Epilogue: Nineteen Years Later",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "This book has the most named casualties of any book in the series. In all, more than 50 people were killed in the Battle of Hogwarts. \n\nSeveral people were injured, including George Weasley losing an ear with the Sectumsempra curse in the Battle of the Seven Potters. Here is a list of people killed in Harry Potter and the Deathly Hallows in order of death/murder:\n\n{| class=\"wikitable\" border=\"2\" cellspacing=\"1\" cellpadding=\"4\"\n! width=\"20%\" |Character\n! width=\"20%\" |Killed by\n! width=\"15%\" |Cause of death\n! width=\"25%\" |Circumstances\n|-\n|Charity Burbage\n|Lord Voldemort\n| rowspan=\"3\" |Killing Curse\n|Gathering of Death Eaters at Malfoy Manor, killed because of what she said about muggles\n|-\n|Hedwig\n|A Death Eater\n| rowspan=\"2\" |Battle of the Seven Potters\n|-\n|Alastor Moody\n| rowspan=\"4\" |Lord Voldemort\n|-\n|Rufus Scrimgeour\n|Unknown, presumably Killing Curse\n|Takeover of the Ministry\n|-\n|German family\n| rowspan=\"2\" |Killing Curse\n|Voldemort's search for Gregorovitch and the Elder Wand\n|-\n|Mykew Gregorovitch\n|Voldemort's search for the Elder Wand\n|-\n|Bathilda Bagshot\n|Nagini\n|Unknown\n|Body used as a disguise for Nagini\n|-\n|Ted Tonks\n| rowspan=\"3\" |Snatchers\n| rowspan=\"3\" |Unknown\n| rowspan=\"3\" |Attempting to escape persecution by the new Ministry\n|-\n|Dirk Cresswell\n|-\n|Gornuk\n|-\n|Muggle family of five\n|Unknown Death Eater(s) or sympathisers\n|Presumably the Killing Curse\n|Carried out \"for sport\" during Voldemort's control of the Ministry\n|-\n|Peter Pettigrew\n|His own magical silver hand\n|Strangulation\n|Because he owed a life debt to Harry, he hesitated for a moment while trying to kill Harry, and in the process his silver hand turned on him and took his life.\n|-\n|Gellert Grindelwald\n|Lord Voldemort\n|Killing Curse\n|At Nurmengard Prison\n|-\n|Dobby\n|Bellatrix Lestrange\n|Hit by Bellatrix Lestrange's knife\n|The escape from Malfoy Manor\n|-\n|Unnamed Gringotts goblin\n| rowspan=\"2\" |Lord Voldemort\n| rowspan=\"2\" |Killing Curse\n|Punishment for reporting to Voldemort that a cup had been stolen from the Lestrange Vault\n|-\n|Several Death Eaters\n|In a fit of rage after hearing about the loss of the Cup Horcrux\n|-\n|Vincent Crabbe\n|Himself (by accident)\n|Fiendfyre\n|The Battle of Hogwarts, his spell raged out of control, destroying everything in the Room of Requirement\n|-\n|Fred Weasley\n|probably either Augustus Rookwood or Bellatrix Lestrange\n|Unknown spell's explosion (possibly Expulso, Bombarda Maxima or Confringo)\n| rowspan=\"5\" |The Battle of Hogwarts\n|-\n|Remus Lupin\n|Antonin Dolohov\n\n|Duel\n|-\n|Nymphadora Tonks\n|Bellatrix Lestrange\n\n|Duel\n|-\n|Colin Creevey\n|An Unknown Death Eater\n|Sacrificing himself for Harry\n|-\n|Lavender Brown\n|Fenrir Greyback\n|Maimed\n|-\n|Severus Snape\n|Nagini\n|Snakebite / exsanguination / poison\n|The Battle of Hogwarts, ordered by Voldemort in the Shrieking Shack\n|-\n|Nagini\n|Neville Longbottom\n|Beheaded with Godric Gryffindor's sword\n|The Battle of Hogwarts, request from Harry\n|-\n|Bellatrix Lestrange\n|Molly Weasley\n|Duel\n|The Battle of Hogwarts, Bellatrix attacked Ginny Weasley\n|-\n|Lord Voldemort\n|Himself / Harry Potter\n|Rebound of the spell Avada Kedavra Curse, due to Harry having true mastery of the Elder Wand, Harry defeating Lord Voldemort (himself)\n|The Battle of Hogwarts, while duelling with Harry Potter in the Great Hall.\n|}",
    "section": "List of deaths",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Rowling first announced that she had a particular title in mind in the latter part of 2006. However, she also announced that she had a final choice of three possible titles, before choosing this one. She has declined to explain the meaning of the title, or say what the other two possibilities were, on the grounds that doing so would reveal information about the book. The other titles she had in mind were Harry Potter and the Elder Wand, which became a chapter title, Harry Potter and the Peverell Quest, and Harry Potter and the Hallows of Hogwarts. There were also fan rumours of titles such as \"Harry Potter and the Green Flame Torch,\" \"The New Beginning,\" the \"Pyramids of Furmat,\" \"The Forest of Shadows,\" the \"Fortress of Shadows,\" and others.\n\nHallows is a word which has fallen into disuse in modern English except as part of some names. It is popular to name churches after saints, and there are a number of 'Church of all Hallows' in Britain, as well as some schools. Similarly the holiday of Hallowe'en is derived from \"All Hallows' Eve.\" This usage of the word refers to saints, relics of saints, or the places where saints have lived or their remains have rested (making those places holy). Part of the mythology of hallows is that the spirit of the saint remains in his relics, and may come to the aid of those who seek it. Thus pilgrims venture to see holy relics or visit shrines hallowed by the saints.\n\nRowling has chosen to use the word 'deathly' in the title, rather than deadly. These two are similar in sound, and sometimes confused in meaning, but are different. A 'deathly hallow' need not be dangerous, but rather in some way is related to death.\n\nThe word 'hallows' has been used in a number of legends to represent important and powerful objects. The Tuatha de Danaan in Ireland possessed six hallows: Manannan's horse, Goibniu's shirt and tools, Lochlan's helmet, Alba's shears, a fishskin belt and Asal's pig bones. These were guarded by four Guardians of the Hallows: Manannan, Lugh, Cumhal and Fionn. As the legend changed, the hallows became four objects: The spear of Lugh, Stone of Fal, Sword of Nuada and Dagda's Cauldron.\n\nThe symbolism of four hallowed objects extends into the suits which now appear on tarot cards. These are wands, coins, cups, and swords. In particular the picture card, the Magician, shows a man waving a wand, with a sword, cup, and engraved metal disc on a table in front of him. Sources suggest that the figure depicted may represent Hermes, the same ancient god as the bust which Rowling used to announce completion of the book. Hermes is also considered a messenger in older legends.\n\nThe coronation ceremony for monarchs still contains four ritual objects, now represented as the sceptre, sword, ampulla of oil and crown. Similar objects also appear in Arthurian legends where the Fisher King is the guardian of four hallows; the sword, spear, dish and holy grail. Earlier Arthurian legends also refer to a set of thirteen treasures of Britain.\n\nThe symbolism in Harry Potter and the Deathly Hallows does not follow any particular legend, but there are clearly four Hogwarts founders, and Voldemort indicated that he intended to make six Horcruxes.",
    "section": "Choice of title and symbolism",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Before the book was officially published, it became apparent that many people advertising the book in non-English-speaking countries without being able to read it, were having much difficulty working out what the words \"deathly hallows\" mean, when translating the title. As a result, Rowling authorised the alternative title \"Harry Potter and the Relics of Death\" to translate.",
    "section": "Harry Potter and the Relics of Death",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "DeathlyHallowsCover.jpg|British Children's Edition, published by Bloomsbury\nHarry-potter-and-the-deathly-hallows-celebratory-paperback-edition.jpg|British Celebratory Edition\nDeathly Hallows Special Edition.jpg|British Special Edition\nHP7 adult.jpg|British Adult Edition\nAdult.jpg|British adult full dust jacket\nNormal DH Signature.jpg|British Signature Edition\nHarry Potter and the Deathly Hallows new adult edition.jpeg|British 2013 Adult Edition\nDeathly Hallows New Cover.jpg|British 2014 Children's Edition\nHp7.jpg|American, published by Scholastic\nHP7 Scholastic Full.jpg|American full dust jacket\nKkhp7-lg.jpg|American 15th anniversary edition\nUS 2018 paperback 07 DH.jpg|American 20th anniversary edition",
    "section": "English-language",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Harry Potter 7 Arabic cover.jpg|Arabic edition\nHpk7.jpg|Czech, Harry Potter a Relikvie smrti, published by Albatros\n-Files-Images-Bokadeildin-permur-barnabokureldri-Harry Potter 7 perma.jpg midi.jpg|Faroese, Harry Potter og arvalutir Deyðans, published by Bókadeild Føroya Lærarafelags\n200px-Hp8.jpg|Hebrew edition\nLithuanian original 07 DH.jpg|Lithuanian, Haris Poteris ir Mirties Relikvijos, published by Alma Littera\nHarry-potter-i-insygnia-smierci-ksiazka-a,big,318865.jpg|Polish, Harry Potter i Insygnia Śmierci, published by Media Rodzina\nX 3a8fdbee.jpg|Russian, Гарри Поттер и Дары Смерти, published by РОСМЭН\nHarry Potter Cover 7 Serbian.jpg|Serbian, Hari Poter i Relikvije Smrti, published by Evro Giunti\nHarry potter in svetinje smrti.jpg|Slovenian, Harry Potter in svetinje smrti",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Bosnian 07 DH.png|Bosnian, Harry Potter i kobne moći, published by Buybook\nBulgarian 2019 hardback 07 DH.png|Bulgarian 20th anniversary edition, Хари Потър и Даровете на Смъртта, published by Egmont Bulgaria\nDanish cover vol7.jpg|Danish, Harry Potter og Dødsregalierne, published by Gyldendal\nDanish 2012 paperback 07 DH.jpg|Danish 2012 paperback\nDutch Book 7 cover.jpg|Dutch, Harry Potter en de Relieken van de Dood, published by Standaard and De Harmonie\nDutch Deathly Hallows book cover.jpeg|Dutch (the Netherlands) 2010 pocket edition, published by Uitgeverij De Harmonie\nFinnish Book 7 cover.jpg|Finnish, Harry Potter ja kuoleman varjelukset, published by Tammi\nFrench 07 DH.jpg|French hardback, Harry Potter et les Reliques de la Mort, published by Éditions Gallimard\nFrench T7 (2011 new edition).png|French 2011 paperback\nFrench T (2016 new edition).jpg|French 2016 edition\nHarry potter heiligtuemer.jpg|German, Harry Potter und die Heiligtümer des Todes, published by Carlsen Verlag\nGerman Adult Edition 07 DH.png|German Adult Edition\nGerman 2013 Pocket 07 DH.png|German 2013 Anniversary Pocket Edition\nGerman 2018 hardback 07 DH.png|German 20th anniversary edition\nIndonesian 07 DH 9786020379791.png|Indonesian, Harry Potter dan Relikui Kematian, published by Gramedia Pustaka Utama\nItalian 07 DH.jpg|Italian, Harry Potter e i doni della morte, published by Adriano Salani Editore\nItalian 2021 redesign 07 DH.png|Italian 2021 redesign\nLithuanian 2020 hardback 07 DH.png|Lithuanian 20th anniversary edition\nHP7BOX.png|Brazilian Portuguese collector's edition, Harry Potter e as Relíquias da Morte, published by Rocco\nRussian 2008 Black Deluxe Edition 07 DH.png|Russian 2008 Black Deluxe Edition\nSlovak 2020 exclusive box set 07 DH.png|Slovak 20th anniversary edition, Harry Potter a Dary smrti, published by IKAR\n77.jpg|Spanish, Harry Potter y las reliquias de la muerte, published by Salamandra\nSpanish 15th anniversary 07 DH.jpg|Spanish 15th anniversary edition\nHarry Potter och Dodsrelikerna.jpg|Swedish, Harry Potter och Dödsrelikerna , published by Tiden\nThai 2020 hardback 07 DH.jpg|Thai 20th anniversary edition, แฮร์รี่ พอตเตอร์กับเครื่องรางยมทูต, published by Nanmeebooks\nUkrainian 07 DH.jpg|Ukrainian, Гаррі Поттер і смертельні реліквії, published by А-БА-БА-ГА-ЛА-МА-ГА\n\n}}\n\nIn the UK, a paperback edition of Deathly Hallows was issued in both children's and adult editions in 2008, roughly a year after the hard-cover. In North America, however, readers had to wait until mid-2009 before a paperback edition arrived. In Canada, only the children's edition has been published in paperback; the Raincoast Books adult edition (which corresponds to the Bloomsbury edition) does not, as of late February 2010, have a scheduled publication date. In 2010, a new UK Bloomsbury edition of the Harry Potter series was issued out, labelled the 'Signature' editions, to introduce the new generation of young readers to the Harry Potter story.",
    "section": "Translations (alternative covers)",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "UK House Edition hardback Gryffindor 07 DH.png\nUK House Edition hardback Hufflepuff 07 DH.png\nUK House Edition hardback Ravenclaw 07 DH.png\nUK House Edition hardback Slytherin 07 DH.png",
    "section": "Hogwarts House Edition",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "Rowling has said that she will not write any more books about Harry. However, she has also said that she may publish some of the 'background' information which she has created during the seventeen years she has been writing the books. When questioned about possible future books about Harry, she jokingly suggested Harry Potter and the Mid-Life Crisis. This background information will be released, all 18,000 words, on her new Harry Potter website, . Pottermore will contain 18,000 words of never before seen background information about the going on's at Hogwarts, the characters and many magical creatures. Pottermore was released to the public in April, 2012.\n\nOtherwise, following the publication of Deathly Hallows, Rowling has published two additional Harry Potter-related works: , a short story that was written for charity in 2008, and , a book published at the end of 2008.\n\nIn April 2010, Rowling hinted that she might return to the Harry Potter series, but not for another 10 years.\n\nOn 23 November, 2015, it was revealed that would be the official sequel to Harry Potter and the Deathly Hallows as the eighth story of the series.",
    "section": "Future books",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "The book was also adapted into two films, completing the Harry Potter film series. was released on 19 November, 2010, and was released 15 July, 2011. David Yates directed both parts, and all the major cast members returned.\n\nThis is the only book that was released as two separate films.",
    "section": "Film adaptation",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "*J. K. Rowling finished writing this book on 11 January 2007 in an unknown hotel room. *This book is noted for containing more and stronger profanity than in the other books; Aberforth Dumbledore called the three Muggle children who attacked his sister, Ariana Dumbledore \"bastards\" and the trio \"bloody fools\", Hermione Granger called Ron Weasley an \"arse\", Ron Weasley called Draco Malfoy a \"two-faced bastard\" and, most notably, Molly Weasley called Bellatrix Lestrange a \"bitch\". The series covers such profanities, such as when Ron Weasley insulted Severus Snape in the third book (Chapter 9, Grim Defeat), it did not reveal the words Ron used, and when Lee Jordan insulted Draco Malfoy for playing foul in Quidditch, the word was not revealed either (Chapter 15, The Quidditch Final), and when Ron told Draco to \"go and do something that Harry was sure he would have never said in front of Mrs Weasley\". Ron also said 'effing', which is a bowdlerised version of 'f**king'. While other books had used minor instances of strong language, they had never delved beyond \"damn\" or \"hell\" (although this book uses such words with a generally higher frequency than the first six books). The previous book similarly contained some strong language, but not as much as in this book. For example, Morfin calls Merope a \"slut\" for marrying a Muggle. *The Three Peverell brothers are connected to Harry Potter, Severus Snape and Lord Voldemort due to the way they die. Lord Voldemort and Antioch Peverell die for power. Severus Snape and Cadmus Peverell die for love. And Harry Potter and Ignotus Peverell greet Death as an old friend and depart that life for good. It is stated that Lord Voldemort is distantly related to Cadmus, as is Harry to Ignotus. *In chapter seven, when Harry discusses Ginny with Ron, Harry says \"It's not as if I'm going to marry her!\" Ironically, he is married to her in the epilogue. *This is the only book in the series to not feature any Quidditch matches. *In the episode of iCarly (iFence), Sam Puckett can be seen reading the American version of the 7th book because of the red page and the cover if the sleeve is removed. Freddie Benson betted her to read \"The Penny Treasure\", a fake cover was used to disguise the book in this episode.",
    "section": "Behind the scenes",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "*Angela Biola was the manufacturing director for the American edition of this title, Karyn Browne was the managing editor and Cheryl Klein was the continuity editor. *In the long running series Doctor Who, the 10th Doctor played by David Tennant said that he had cried when he read book 7 which had not yet come out at the time. Coincidentally, David Tennant portrayed Barty Crouch Jnr, a main antagonist, in . In another Harry Potter reference in the same episode, William Shakespeare used Expeliarmus as the end of a formula to defeat the bad guys at the suggestion of protagonist Martha Jones, causing the Doctor to quip \"good old J.K.\" with a smile. *The contents of the book were treated with the utmost secrecy prior to its release, such that not even a basic preview summary was released, unlike past Harry Potter titles. The book was marketed with the simple phrase \"We now present the seventh and final instalment in the epic tale of Harry Potter.\" The text was present on the inside cover of all library-edition releases of the novel, as opposed to the brief premise of the book that was present in the previous 6 novels. *Rowling introduced her favourite scene from Harry Potter and the Deathly Hallows in The Birthday Book with illustrations by Quentin Blake. *The chapters of which the two pages connecting Lily's letter are called Kreacher's Tale and The Prince's Tale. It is unknown if this is intentional or not.",
    "section": "Behind the scenes",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "*\n*\n*\n*\n*Harry Potter and the Deathly Hallows (character index)\n*Seventh year",
    "section": "See also",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  },
  {
    "text": "de:Harry Potter und die Heiligtümer des Todes\nde2:Harry Potter und die Heiligtümer des Todes\nfr:Harry Potter et les Reliques de la Mort\nes:Harry Potter y las Reliquias de la Muerte\nit:Harry Potter e i Doni della Morte\nnl:Harry Potter en de Relieken van de Dood\npl:Harry Potter i Insygnia Śmierci\npt:Harry Potter e as Relíquias da Morte\nru:Гарри Поттер и Дары Смерти\ntr:Harry Potter Ve Ölüm Yadigarları\nfi:Harry Potter ja kuoleman varjelukset\nvi:Harry Potter và Bảo bối Tử thần\nzh:哈利·波特与死亡圣器\nno:Harry Potter og Dødstalismanene\n7\nCategory:Canon",
    "section": "Notes and references",
    "name": "Deathly Hallows",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 7,
    "source_book": "Deathly Hallows"
  }
]