[
  {
    "text": "}}\n\n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Olly Moss (Pottermore eBook)\n|interior=*Mary GrandPré (US)\n|narrator=*Stephen Fry (UK)\n*Jim Dale (US)\n|publisher=*Bloomsbury (UK, Canada)\n*Scholastic (US)\n*Raincoast Books (Canada (formerly))\n*Yapı Kredi Yayınları (Turkey)\n|release date=8 July 2000\n|pages=*636 (UK)\n*734 (US)\n*660 (Turkey)\n|preceded by=\n|followed by=\n}}\n\nHarry Potter and the Goblet of Fire is the fourth book in the Harry Potter'' series by J. K. Rowling, published in 2000. A film version of this book was released in November 2005. This book is seen by many fans as the beginning of darker times in the wizarding world, as it shows the return of Voldemort.",
    "section": "General",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "]]\n\"To Peter Rowling, in memory of Mr Ridley and to Susan Sladden, who helped Harry out of his cupboard\"\n\nPeter Rowling is JK Rowling's father. Mr Ridley refers to Ronald Ridley, an old family friend of the Rowlings. This man's name was the inspiration for Ron Weasley's name. It is not certain who exactly Susan Sladden is, but she could be the Susan Jo once referred to in an interview as the woman who used to look after Jessica (Jo's daughter) while Jo worked on the Harry Potter books.",
    "section": "Dedication",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "\"Harry Potter is in his fourth year at Hogwarts. Harry wants to get away from the pernicious Dursleys and go to the Quidditch World Cup with Hermione, Ron, and the Weasleys. He wants to find out about the mysterious event to take place at Hogwarts this year, an event involving two other rival schools of magic, and a competition that hasn't happened for hundreds of years. He wants to be a normal, fourteen-year-old wizard. But unfortunately for Harry Potter, he's not normal - not even by Wizarding standards. And in his case, different can be deadly.\"",
    "section": "Book description",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "In August of 1943, an absurd tragedy occurred inside the Riddle House, and nobody was able to find out how it happened. When the Riddles' maid went to work that day, she discovered all three Riddles dead in the drawing room, \"still in their dinner things\". The police found no evidence of murder or suicide, claiming to be in perfect health except for the fact that they were dead. They arrested the Riddles' gardener Frank Bryce for questioning, since the door and windows were not forced open or shattered on the night of their murder, and the Riddles' cook testified that he was the only one with a key to the house. Frank, however, said the only person he saw that night was a mysterious dark-haired boy, and was released due to lack of evidence, but many still believed he committed the murders.\n\nHalf a century later on the night of 16 August, 1994, an elderly Frank is still working as the groundskeeper at the Riddle house. He sees a fire flickering in one of the rooms and goes over to investigate, thinking it is a couple boys who regularly disturb him. Inside, he overhears the same boy he saw on the night of the Riddles' murder, now grown up as Lord Voldemort (who, still unknown to him, was Tom Riddle Senior's unwanted son), and his servant Peter Pettigrew planning to capture Harry Potter with the aid of a reliable servant. Voldemort, Frank learns, also plans to reward Pettigrew for his help in capturing Bertha Jorkins, a Ministry of Magic employee who Voldemort extracted information from before killing. Frank is then discovered by Voldemort's snake Nagini, who reports his presence to her master via Parseltongue. When Pettigrew beckons him in as a guest, Frank stands up to Voldemort, who is unhappy that Muggles like the elderly gardener would be spying on him. Frank doesn't know what a Muggle is, and despite being offended that Voldemort called him one when it is explained that term means he's not a wizard, he is still determined to inform the police about the intruders' plot but becomes horrified upon seeing Voldemort's weak form. Voldemort then casts the Avada Kedavra curse, ending Frank's life before the book can describe what Voldemort looks like. Simultaneously, about 200 miles away in the Surrey town of Little Whinging, Harry Potter wakes up from a nightmare at the Dursleys' house in Privet Drive.",
    "section": "Chapter 1: The Riddle House",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The experience is shown to be a dream that Harry had and he wakes up with his scar hurting. Harry considers writing to his best friends Ron Weasley and Hermione Granger, as well as the Hogwarts Headmaster, Albus Dumbledore, but eventually decides to write a letter to his godfather Sirius Black, an escaped convict. Sirius was actually framed for his crimes by Peter Pettigrew, but, as the entire wizarding world except for Harry, Ron, Hermione, Remus Lupin, and Dumbledore believes him to be guilty, Sirius is in hiding. Harry does not mention the dream, only his scar hurting, and plans to send the letter once his owl, Hedwig, gets back.",
    "section": "Chapter 2: The Scar",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The next day, it is revealed that Aunt Petunia has put the entire family on a diet, which Harry's not following. Suddenly a letter from Molly Weasley addressed to the Dursleys arrives. She asks if Harry can join Hermione and the Weasley family to go to the Quidditch World Cup final between Ireland and Bulgaria. Unfortunately, the letter upsets Vernon Dursley because there are so many stamps on the envelope that the postman actually rang the doorbell to laugh about it. However, one mention of Sirius Black is enough to convince Vernon Dursley to let Harry go. Harry writes back to Ron (after a letter from Ron was delivered by Ron's owl Pigwidgeon) confirming that they can come pick him up. Harry writes an extra sentence or two to Sirius's letter explaining that he will be heading to The Burrow before sending the letter via Hedwig.",
    "section": "Chapter 3: The Invitation",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "On Sunday afternoon, the Weasleys attempt to use Floo Powder to access the Dursley household, unaware that they have an electric fireplace. The Dursleys are shocked after Mr Weasley destroys half the sitting room. Mr Weasley sends the boys back, but not before Fred purposely drops a Ton-Tongue Toffee on the floor. Dudley Dursley, unable to resist due to the diet the family has been following and his fondness for sweets of all sorts, attempts to eat it and experiences the magical effects of a bigger tongue. Harry exits for The Burrow as Uncle Vernon starts throwing china figurines at Mr Weasley.",
    "section": "Chapter 4: Back to The Burrow",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Upon arriving at The Burrow, Harry meets Ron's older brothers Bill and Charlie. Before they have a chance to talk, Mr Weasley arrives back home and angrily explains that Dudley's tongue grew to be four feet long and turned purple before he was allowed to fix it. He points out that this incident could undermine the Muggle-wizard relations he has been working so hard to improve even after the twins tell him they did it because Dudley bullies Harry. Mrs Weasley learns what happened and joins in the scolding of the twins.\n\nMeanwhile, Harry leaves the room and learns that Molly is upset about Weasleys' Wizard Wheezes, a business enterprise Ron's brothers Fred and George set up to sell their self-invented sweets and prank objects. Mrs Weasley forced them to stop, since she wanted them to have a more reputable career in the Ministry after graduation.\n\nAfter the spat, the Weasleys, Harry, and Hermione enjoy a lovely dinner in the garden. At the table a lot of topics are discussed: the upcoming Quidditch World Cup, Bill's personal appearance, Sirius Black's whereabouts (a private conversation by Harry, Ron, and Hermione), a missing Ministry Witch named Bertha Jorkins. Percy (who has joined the Ministry following his recent graduation) mentions a top-secret event that he is up to in the Ministry, which will take place after the Quidditch World Cup.",
    "section": "Chapter 5: Weasley's Wizard Wheezes",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Harry, Hermione, and the Weasleys (excluding Bill, Charlie, and Percy, who would apparate later, and Mrs Weasley, who would not be attending) travel early the next morning to the site of the Quidditch World Cup Final via a Portkey, an enchanted object that can transport large groups of people across large distances in a short time. Mr Weasley explains that two hundred Portkeys have been placed around Britain to transport thousands of wizards and that they will be using the one at Stoatshead Hill. There they meet Cedric Diggory, captain of the Hufflepuff Quidditch team, and his father, Amos. Fred and George are not too keen to see Cedric due to his team beating Gryffindor last year, and Mr Diggory makes a big deal of it despite Cedric himself stating it was a fluke. They then gather around and use Portkey on Mr Weasley's signal, transporting to the Quidditch World Cup Final.",
    "section": "Chapter 6: The Portkey",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After arriving and setting up their tents at a wizard campsite, Harry, Ron, and Hermione witness international members of the wizarding community while getting water. As the older Weasley children arrive and the group makes lunch, they meet Ludo Bagman, the match commentator and head of the Department of Magical Games and Sports and the man who got them their tickets. During their talk, against their father's wishes, Fred and George make a bet with Ludo: their entire life savings and a fake wand that Ireland will win, but the Bulgarian Seeker Viktor Krum will catch the Golden Snitch. Arthur also asks Bagman if they found Bertha Jorkins yet.\n\nPercy's boss, Barty Crouch, head of the Department of International Magical Co-operation then arrives looking for Bagman, though he has to shush Bagman when he starts to talk about a big event coming up at Hogwarts. Later that night, after getting some souvenirs, the group heads to the match.",
    "section": "Chapter 7: Bagman and Crouch",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "While at the Top Box in the World Cup stadium, Harry meets Winky the house-elf, a friend of Dobby's, who is saving a seat for Mr Crouch (who never shows up). The Minister for Magic, Cornelius Fudge, as well as Lucius Malfoy with his wife and Draco (though both the Weasleys and Malfoys have to restrain themselves out of respect for Fudge), are also in the box. After Bagman introduces both teams' mascots, the match is intense and exciting, with amazing skill displayed on both sides, particularly from Krum. A fight breaks out between the two team's mascots after Ireland is awarded many penalty shots, which angers the Veela.\n\nIreland quickly gains a massive lead and wins the match, despite Krum catching the Golden Snitch. After the match, both teams head to the Top Box and Fudge awards Ireland the Quidditch World Cup, while Fred and George rejoice about winning their bet with Bagman.",
    "section": "Chapter 8: The Quidditch World Cup",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After the wizards around the campsite celebrate before going to sleep, that night, a group of masked wizards attack the camp and torment some local Muggles. While Mr Weasley heads out with his older children to face them, the rest of the group hides in the woods. When Ron trips on a tree branch, he, Harry, and Hermione, lose Fred, George, and Ginny. They run into Draco Malfoy, who goads them about the riot and tells them to keep Hermione, the \"mudblood\", safe. Shortly afterwards, Harry realises his wand is missing, and they find Winky behaving strangely, as if she were to trying to restrain something. After finding a place to hide, they hear someone nearby incant \"Morsmordre\", and they watch the Dark Mark float into the sky.\n\nThe Ministry is quickly at the scene, stunning anything that moves. After determining that Harry, Ron, and Hermione had nothing to do with the Dark Mark, they search nearby to find Winky holding Harry's wand. A quick spell proves that Harry's wand conjured the Dark Mark. Even though no one thinks Winky did it, Barty Crouch publicly fires her, leaving Hermione incensed. Mr Weasley is forced to take the group back to their tents where the others are.\n\nAfter the attack, Mr Weasley mentions that the Dark Mark is the sign that Voldemort's supporters leave whenever they murder someone. The group also learns that the hooded wizards were Death Eaters, followers of Voldemort. Bill mentions that the ones from tonight strangely fled the scene when the Dark Mark was cast in the sky, likely because they were afraid Voldemort would punish them for failing to stay loyal to him after his downfall. Mr Weasley then insists they go back to bed, since they would be leaving by Portkey in a few hours. Harry can't sleep due to taking this as a sign that Voldemort's making another plan to get his powers back.",
    "section": "Chapter 9: The Dark Mark",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The next morning, the group quickly departs the campsite and arrives at The Burrow, where a worried Mrs Weasley greets them. Mrs Weasley shows them the Daily Prophet article covering last night's attack, which is filled with some inaccurate details penned by Rita Skeeter, a journalist well known for her heavily negative stories. This forces Mr Weasley to head to the Ministry with Percy to straighten things out, as he is indirectly mentioned in the article.\n\nHeading into Ron's room, Harry tells Ron and Hermione about his scar hurting and his letter to Sirius, as well as the dream. The three remark on how strange it is that Harry's scar hurt so soon before the Dark Mark appeared for the first time in thirteen years. \n\nOn the final day before they are to return to Hogwarts, Harry hears that the Ministry of Magic has come under heavy fire for failing to stop the riot at the Quidditch World Cup or arrest any of the culprits because of Rita Skeeter's article. Mr Weasley mentions that Rita is also attacking the Ministry because of the disappearance of Bertha Jorkins. Meanwhile, Ron is dismayed by his hideous hand-me-down dress robes, which he will need to wear at Hogwarts for a formal occasion later in the year.",
    "section": "Chapter 10: Mayhem at the Ministry",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The next morning, Harry overhears a conversation between Mr Weasley and Amos Diggory (who is communicating through the Floo Network) about an ex-Auror named Alastor \"Mad-Eye\" Moody, who was attacked in his home the previous night. Amos needs Mr Weasley's help in clearing things up before the situation gets worse. Charlie informs Harry that an Auror is basically an evil wizard catcher.\n\nAfter Mr Weasley leaves, Percy, who needs to get back to work, departs. This leaves the rest of the adults to take the children to King's Cross Station by Muggle taxi. At the station, the kids say good-bye to Mrs Weasley, Bill, and Charlie, and the adults suggest that the year ahead would be an exciting one for all of the Hogwarts students, as well as other wizards and witches.\n\nIn the Hogwarts Express, after chatting about other wizarding schools across Europe and the Quidditch World Cup, Draco Malfoy also speaks about the mysterious upcoming event, that Mrs Weasley, Charlie and Bill were talking about earlier and says that there's glory and money involved.",
    "section": "Chapter 11: Aboard the Hogwarts Express",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After arriving at the castle and dealing with one of Peeves' pranks, the trio heads to the Gryffindor Table for the Sorting Ceremony, the first in three years for Harry. Here they meet Colin Creevey, who reveals his younger brother Dennis is one of the new students. During the ceremony, Dennis is placed in Gryffindor. The Start-of-Term Feast then begins. After Nearly Headless Nick brings up the subject of Peeves causing problems in the kitchen, Hermione learns that house-elves work there. This makes her even more angry about the way house-elves are treated, especially since house-elves do not get any benefits (which the house-elves themselves do not want). She then refuses to eat any more food in protest.\n\nAfter making a few start-of-term notices, Professor Dumbledore announces that instead of having Quidditch this year (which created lots of mayhem, especially from the Weasley twins), a very special event is going to take place at Hogwarts. Before he goes on, a mysterious man with a bizarre appearance appears in the Great Hall. Dumbledore identifies him as Mad-Eye Moody, the new Defence Against the Dark Arts teacher. Afterwards, Dumbledore states this event is the Triwizard Tournament, which will start at the end of October on Hallowe'en. The Tournament calls for a single champion from each of the three largest wizarding schools in Europe to compete in a series of three trials for the prize of one thousand Galleons. Though it wasn't in play in the past due to the vast number of student deaths, Dumbledore reveals that both Crouch (Department of International Co-operation) and Bagman's (Department of Games and Sports) departments at the British Ministry of Magic have decided to reinstate the tournament under the condition that new safety rules are used, including that no student under the age of seventeen will submit their name for consideration. The students are then sent to bed, though Fred and George plot to find a way to bypass Dumbledore's safety measures so they can enter the tournament, to get fame and glory, as well as money.",
    "section": "Chapter 12: The Triwizard Tournament",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "On the morning of their first day back, Harry, Ron, and Hermione prepare to begin the classes in their school schedule, though Harry is concerned about why Hedwig had not returned with a reply from Sirius. Hermione has also ended her hunger strike, deciding to stand up for house-elf rights in a different manner. First the Gryffindor fourth-years have lessons for Herbology, then Care of Magical Creatures, where Hagrid teaches about monstrous creatures known as Blast-Ended Skrewts. Lastly, Harry and Ron have Divination, where Sybill Trelawney assigns the class extra homework after Ron makes a rude comment to Lavender Brown.\n\nAt dinner, Draco Malfoy insults Ron by showing Ron a Daily Prophet article that casts Ron's father Arthur Weasley (identified in the article as Arnold Weasley) in a bad light by Rita Skeeter, who somehow found out about the attack on Alastor Moody's home, even after the Ministry of Magic tried to keep it secret. While Harry and Hermione restrain an angry Ron, Draco makes some rude comments about Mrs Weasley. After Harry counters this by making a rude comment about Draco's mother and starts walking away, an angry Draco attempts to curse Harry from behind. Moody quickly intervenes, transfiguring Draco into a white ferret and bouncing him around until Professor McGonagall appears. After seeing what he's doing and putting two and two together, McGonagall undoes the spell. She then proceeds to tell Moody off by stating they never punish the students by hexing them. Moody defends his actions by explaining he thought a good sharp shock would be sufficient. Professor McGonagall tells him they punish the students by giving them detentions or speaking with the offender's Head of House. With that, Moody takes Draco Malfoy to see Professor Snape. \n\nAfter Hermione leaves to do some extracurricular work (even with no homework given out to her), Fred, George, and their friend Lee Jordan show up and tell Harry and Ron how cool Moody's (Defence Against the Dark Arts) class is. Ron finds out it will be a few days before Ron and Harry will have their first lesson with Moody.",
    "section": "Chapter 13: Mad-Eye Moody",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "In their first lesson with Moody on Thursday, Moody, after revealing he will only be staying for the year, decides to show the fourth-year Gryffindors the Unforgivable Curses. Despite some fear amongst the students (especially Neville, who needs comfort from both the trio and Moody after the lesson; Moody later lends Neville a Herbology book to cheer him up), Moody shows the entire class the three curses using spiders as his test subjects: the Imperius Curse, a mind-control spell, the Cruciatus Curse, a pain-inflicting spell, and the Killing Curse, a spell that causes instant death to any living thing it hits. He also reveals the the use of these spells gain the user a one-way ticket to Azkaban.\n\nLater that night after dinner in their Common Room, Harry and Ron fake their Divination homework after finding it too difficult. Harry notices Fred and George plotting something, though he is unable to figure out what. Later on, Hermione shows up and reveals that she has started SPEW, a club for fighting for house-elf rights and has just spent time in the library researching house-elf history. She wants Harry and Ron to join, but before the conversation is carried out further, Hedwig returns with a letter from Sirius.\n\nSirius says there are rumours about Harry's scar hurting and he is returning to Britain. Harry feels worried about Sirius coming back and possibly getting caught by the Ministry, all because he hastily sent the letter. He goes to bed unsettled.",
    "section": "Chapter 14: The Unforgivable Curses",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Early the next day, a concerned Harry sends a letter to Sirius claiming he is fine and that Sirius won't have to return to Britain. Over the next couple of weeks, Harry fights off his concerns for Sirius while waiting for Hedwig to get back. In Defence Against the Dark Arts, Moody has his students practise resisting the Imperius Curse. Only Harry is able to resist it, despite slightly bruising his knees in the process; it takes him a couple more tries before he can completely resist it. During Transfiguration, Professor McGonagall explains to her fourth-year students, as she assigns them extra homework, that this is the time for them to start preparing for the O.W.L. examinations, which will occur at the end of their next year.\n\nFollowing Care of Magical Creatures, the group returns to the castle and sees a crowd of students looking at a sign posted to the wall. The sign reveals that in about a week, on 30 October, lessons will end early due to the delegations from the two other schools, the Beauxbatons Academy of Magic and the Durmstrang Institute, arriving that evening. The lesson cut off, for Gryffindors was Potions, and the Trio felt lucky, especially when Snape hinted of a poisoning, to find out if their antidotes work or not. Over the next week, Hogwarts Castle undergoes a major refit: the castle is redecorated and the nervous staff members prepare for the delegates to arrive.\n\nOn 30 October, Harry again hears Fred and George Weasley talking: this time, he hears that they are talking about sending a letter to a certain person. The trio talk with the twins about the Triwizard Tournament, and Hermione brings up house-elves. Fred and George suggest she should visit the Hogwarts Kitchen just to see for herself how happy they are, despite Hermione's insistence that they are being brainwashed.\n\nThe owls then arrive, including Hedwig. Sirius mentions that he has seen through Harry's ruse and asks Harry not to worry about him, but rather to watch out for himself and keep him posted on the recent events at Hogwarts. Sirius also asks that Harry use a different owl next time when sending him a message, as Hedwig, a snowy owl, would attract too much attention.\n\nThat night, each of the Houses are assembled in a line in the Great Hall while waiting for the delegates to arrive. The first comes by flying carriage, the second shortly afterwards via submerged ship, with their respective heads: Madame Maxime (Headmistress of Beauxbatons), a woman as big as Hagrid, and Igor Karkaroff (Headmaster of Durmstrang). Viktor Krum is revealed to be among the Durmstrang students, which makes Ron, a little excited.",
    "section": "Chapter 15: Beauxbatons and Durmstrang",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The students sit down at their tables (with the Beauxbatons students at the Ravenclaw table and Durmstrang at Slytherin), and the Welcoming Feast begins. Hagrid, Ludo Bagman, and Barty Crouch all arrive late. After the feast, Dumbledore announces that Bagman and Crouch, who helped organise the tournament, will also serve as judges alongside the three headmasters to evaluate the Champions' performances. Dumbledore then announces that the three champions will be chosen by the Goblet of Fire, an enchanted artefact. Students must drop their names into the Goblet, and the Goblet chooses the most worthy entrants to compete in three dangerous tasks. Dumbledore finishes by stating the champions will be selected the following night during Hallowe'en. On the way out, the Durmstrang headmaster Karkaroff gives Harry a look of displeasure before Moody forces him to move along. The Goblet is placed in the Great Hall and an Age Line is drawn around the Goblet to prevent underage students from submitting their names.\n\nThe next day, predictably, Fred and George attempt to cross the line through the use of an Ageing Potion, but they are repelled by the line. The pair has to be sent to the Hospital Wing to have their long grey beards removed, much to everyone's amusement, while Dumbledore states that their beards are finer than those of the other students who tried to enter. That afternoon, Harry, Ron, and Hermione visit Hagrid at his cabin and find that he has gotten dressed up for Madame Maxime. He refuses Hermione's offer to join S.P.E.W., pointing out that the house-elves enjoy their work.\n\nThat night, during the Hallowe'en feast, the champions are announced: Viktor Krum, the Seeker for the Bulgarian National Quidditch team, representing Durmstrang; Fleur Delacour, a beautiful girl Harry and Ron met the night before, representing Beauxbatons; and Cedric Diggory of Hufflepuff representing Hogwarts. Unexpectedly, a fourth name is thrown from the Goblet of Fire: Harry Potter, much to the suprise of everyone and dismay of some.",
    "section": "Chapter 16: The Goblet of Fire",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Since Harry neither submitted his name nor asked an older student to do so, the assembly is dumbfounded. Harry himself is feeling very confused as he heads into the room where the champions are waiting. Although protests issue from the heads of the other schools, it is decided that the Goblet of Fire has spoken and that changes must be made accordingly. While many think Harry has somehow circumvented Dumbledore's age-restricting barrier, Moody suggests that perhaps someone entered Harry's name under a fourth school to ensure he would be included in the competition, hoping he might not survive the perilous tasks.\n\nCrouch reveals that the First Task is on 24 November and the champions have until then to figure out what it is and to prepare for it. The champions are forbidden to receive any help from anyone else. They are told that they will learn the details of the Second Task after completing the First Task. They will also be exempt from the end-of-year exams due to the tournament.\n\nThe group disbands and Cedric talks with Harry briefly as they are heading back to their respective dormitories. Harry tries to tell him that he did not put his name nor ask for it, but his efforts are wasted. At the Gryffindor Common Room, most of the other Gryffindor students throw a party to celebrate, despite Harry's displeasure. Afterwards he returns to his dormitory, where Ron refuses to believe Harry's story about not entering the tournament.",
    "section": "Chapter 17: The Four Champions",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Hermione explains to Harry the next morning that his entry into the competition strained his relationship with Ron, who feels once again left in the shadow of his friend. Harry reluctantly accepts Hermione's advice to send a letter to Sirius to update him on what happened. He sends a letter with a school barn owl, much to Hedwig's chagrin.\n\nRon is not alone in shunning Harry; a great many of the students from all three schools assume he somehow cheated his way into the tournament. This makes Harry's life miserable, even though his fellow Gryffindors (excluding Ron) are proud that Harry will be in the tournament. The stress makes it difficult for Harry to concentrate on his lessons over the next week.\n\nIn Potions, the Slytherin students wear insulting badges that cause an angry Harry to attempt to curse Malfoy. Goyle and Hermione end up cursed instead, and both head to the Hospital Wing. Though Harry and Ron reconnect when Snape takes 50 points away from Gryffindor and gives them detention for yelling at him, Ron refuses to reconcile with Harry.\n\nDuring a Potions lesson with Snape, Colin Creevey arrives to pick up Harry, as Mr Bagman requires him for a photo session. Rita Skeeter interviews Harry in a closet for a piece she is writing on the Triwizard Tournament, before the much important Wand weighing ceremony begins. Harry tells her he doesn't know how he entered the tournament, but she manages to twist his words before Dumbledore interrupts, stating the ceremony is about to begin.\n\nHere Harry sees the Wand Creator Mr Ollivander again. After examining the other champion's wands, he examines Harry's and deems it in perfect condition. After the champions and judges go through a long photoshoot, Harry goes to dinner and then returns to Gryffindor Tower. Ron tells Harry that he has an owl and that their detention starts later. Going to where the school barn owl is with Sirius's letter, Harry reads that Sirius thinks it is too risky to communicate by letter and that he will contact Harry on 22 November at 1:00 a.m. Harry must be alone at the fireplace in the Gryffindor common room at that time.",
    "section": "Chapter 18: The Weighing of the Wands",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Harry's impending talk with Sirius helps him through his embarrassment about Rita Skeeter's news article, which told a highly inaccurate version of his life story. This further deepens the rift with Ron, who thinks Harry is trying to get attention. Ravenclaw Cho Chang is the only person outside of Gryffindor who wishes Harry good luck with the first task that is coming up on that Tuesday. Harry finds himself infatuated with her.\n\nOn the Saturday prior to the first task, the students visit Hogsmeade village. Harry goes with Hermione under his Invisibility Cloak so he can relax and avoid dealing with anymore criticism. While they are at the Three Broomsticks Inn drinking Butterbeer, Moody spots Harry through the guise of his cloak and tells Hagrid. Hagrid asks Harry to meet him at midnight, one hour before his meeting with Sirius.\n\nThe Gamekeeper sneaks Harry into a meeting with Maxime; she does not know Harry, who is again hidden under his cloak, is there. Hagrid leads Maxime and Harry to a spot in the woods where dragons are being kept for the first task. Charlie Weasley and other dragon keepers are working to get the dragons ready for the First Task and keep them under control. Charlie talks with Hagrid and identifies the species of each of the four dragon breeds. He reveals that one is for each champion and that each must get past their assigned beast, though he and the other keepers are also there to keep things under control. Harry leaves for the castle, bumping into Karkaroff but managing to keep hidden. He realises that if Karkaroff followed Hagrid and Maxime, it was likely that Cedric will be the only champion not aware of what he would be facing.\n\nJust as Harry returns to his common room, Sirius contacts Harry via the Floo Network. Harry starts by filling him in on what has happened. Sirius then speaks and warns him that Karkaroff was once a Death Eater; he was released only after identifying other Death Eaters, and could have put Harry's name in the Goblet of Fire. Sirius then mentions Rita Skeeter's article from last month regarding the attack on Moody; he suspects it was no accident and that someone may have tried to keep Moody from going to Hogwarts. Sirius also brings up the Death Eater disturbance at the Quidditch World Cup, as well as Bertha Jorkins. Jorkins, he says, disappeared in Albania, where Voldemort was last reported to be. Sirius reveals he knew Jorkins personally while they were in school and mentions that she wasn't very bright and could have easily fallen into a trap. She also would have known about the Triwizard Tournament beforehand.\n\nSirius finishes by stating that Karkaroff betrayed the Death Eaters long ago and might not be the guilty party, especially since whoever put Harry's name in the Goblet had a reason for doing so. Before he can give Harry any advice on getting past his dragon, he is interrupted by Ron and disappears from the fire. Ron demands to know whom he was talking to but Harry tells him it's none of his business and goes to bed.",
    "section": "Chapter 19: The Hungarian Horntail",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After Harry tells Hermione everything he learned recently, they try to research ways to get past a dragon in the library without success. On Monday, realising the other schools' champions know about the dragons, Harry tips off Cedric to make sure the contest is fair. Moody then appears and gives Harry some general advice on how to beat his Dragon: play to his strengths and use a simple spell to get what he needs. With Hermione's help, Harry manages to master the Summoning Charm after working on it until 2 a.m. On Tuesday, the day of the task, Mr Bagman reveals that their task is to get the Golden egg each dragon is guarding. The model dragons each champion would draw out of a small bag would determine the order they'll be going in and which dragon they'll face.\n\nHarry finds himself slated to go last. He gets the most violent of the four dragons, the Hungarian Horntail, though he declines Mr Bagman's offer for advice. Once his turn comes up, Harry manages to summon his Firebolt and fly. He uses the flying strategies he learned as a Quidditch player to lure the dragon off the eggs long enough for him to zoom in and snatch the golden egg, despite taking a minor shoulder injury during the task. Ron, realising the true danger of the Tournament, and realising that Harry was telling the truth about not putting his name in the Goblet of Fire, tries to apologise to Harry feeling terrible about how he treated him. Harry forgives him and they become best friends again, with most of Hogwarts (excluding Slytherin) backing him as well.\n\nAfter seeing his score, Harry learns from Charlie Weasley that he is currently tied with Viktor Krum for first place and that Mr Bagman needs to see him. Mr Bagman reveals to the champions that the Second Task will take place on 24 February at 9:30am and that their Golden Eggs contain a clue as to what it will be. On his way back to the castle with Ron, Rita Skeeter shows up for an interview, but Harry brushes her off.",
    "section": "Chapter 20: The First Task",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After Ron is brought up to speed on what Harry has learned, he allows Harry to borrow Pigwidgeon to send Sirius a new letter updating him on the completion of the first task. Gryffindor celebrates Harry's success that night, but when Harry opens up his golden egg during the party, a horrible screech comes out. Meanwhile, Hermione learns from Fred Weasley how to get into the kitchen where the house-elves are.\n\nIn December, Rita Skeeter arrives at Hagrid's during a Care of Magical Creatures lesson with the fourth years to try to get an interview with Hagrid. Hagrid is surprised to see her there, as Dumbledore had banned her from Hogwarts Castle.\n\nThat night, Hermione does not show up to dinner. She surprises Harry and Ron as they are about to enter Gryffindor Tower and takes them to the kitchens. There they see a lot of domestic elves, and Harry is reunited with Dobby and learns that Winky is there too. Dobby reveals that it is difficult for a free house-elf to find actual work. After he spent two years failing to find work and found Winky, Dobby came to Hogwarts and had been there for a week so far; Dumbledore even agreed to pay Dobby a small wage. Winky is very sad and ashamed about being fired by her old master. Hermione tries to cheer her up, with no luck, though Winky does become slightly happier when she learns that Mr Crouch has been at Hogwarts.",
    "section": "Chapter 21: The House-Elf Liberation Front",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After a Transfiguration class, McGonagall tells her students about the Yule Ball, a formal event that is scheduled for 25 December and is open to fourth years and above (though a younger student can still attend if invited by an older student as their date). She tells Harry privately that he and his dance partner will start off the event alongside the other champions and their dates as a traditional part of the Triwizard Tournament.\n\nOver the next few weeks, both Ron and Harry unsuccessfully attempt to find dates as they get through the final classes of the term. Fred and George are also acting suspiciously again; they want to borrow Pigwidgeon to deliver a letter to someone, but Pigwidgeon is not back yet (from delivering Sirius' letter). Harry later works up his courage and asks Cho to go to the dance with him, but learns that she had already agreed to go with Cedric. This information sours Harry's relationship with Cedric.\n\nAfter Harry returns to the Gryffindor common room, he sees Ginny comforting Ron and learns that Ron foolishly tried to ask Fleur out. Ron then tactlessly asks Hermione out, but she is going with someone else. Harry can't ask Ginny out either, since she is going with Neville. Finally, Harry manages to secure dates for both himself and Ron.",
    "section": "Chapter 22: The Unexpected Task",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "As the holidays begin, Hermione refuses to tell Ron who her date for the Yule Ball is, stating he'll make fun of her. She also reveals that after Malfoy put the curse on her that made her already large front teeth grow to a huge size, she let Madam Pomfrey shrink them to a more normal size when she healed her. Draco Malfoy tries to taunt Hermione, saying no one in their right mind would take her to the ball, but the mere mention of Mad-Eye Moody is enough to drive him back. Pigwidgeon returns with Sirius' reply. Sirius congratulates Harry for completing the first task and reminds him to stay on guard.\n\nOn Christmas Day, Dobby wakes Harry up and gives Harry his present: a pair of mismatched socks he made himself from wool he purchased with his wages. Harry then opens the presents he got from his other friends for Christmas, which include a hand-knit jumper with the image of a dragon from Mrs Weasley and a magical penknife from Sirius. After spending the day relaxing, Harry and his dorm mates get ready for the ball, then head to the Great Hall, where the event is to take place. At the start of the ball, it is revealed that Hermione is going with none other than Viktor Krum.\n\nWhen the champions reach the judges' table, Crouch is nowhere to be seen. Percy Weasley, who was promoted to Crouch's assistant, says Crouch is ill. After the entire room has their meal, the Weird Sisters start their performance for the dance. Neither Harry nor Ron have any interest in dancing (though Harry does participate in the opening dance) and their dates, the Patil sisters, soon abandon them. Ron also gets into an embarrassing argument with Hermione; he claims that Viktor Krum is the enemy and that going to the ball with him is treason.\n\nPercy sees Fred and George bothering Ludo Bagman and tries to intervene, and Mr Bagman comes over to have a chat with Harry. Harry and Ron then decide to go for a walk on the grounds to get away from the ruckus. They encounter Karkaroff having a worried discussion with Snape, and Hagrid and Maxime enjoying a tender moment. The moment is ruined when Hagrid insinuates Maxime is a Half-giant, like him. Ron naturally has to inform Harry about how serious this information is, given the nasty reputation giants have in the wizarding world. Shortly after the ball, Cedric gives Harry a hint about the egg: have a bath with it. He gives Harry the password to enter the Prefects' bathroom, and thanks him for warning him about the dragons.",
    "section": "Chapter 23: The Yule Ball",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Ron and Hermione decide to put last night's argument behind them. Hermione isn't too surprised when she learns that Hagrid is a half-giant, as she suspected this all along. Meanwhile, Harry is reluctant to take Cedric's advice due to his jealousy about Cho.\n\nA substitute teacher, Professor Grubbly-Plank, teaches the first Care of Magical Creatures of the year. Draco Malfoy shows Harry that Rita Skeeter had published a nasty story about Hagrid and his giant heritage (which also used a quote from Draco); this has apparently driven Hagrid into hiding. This raises some questions between the trio, as nobody else heard Hagrid talking privately with Madam Maxime that night and Rita is supposed to be banned from Hogwarts.\n\nSeveral weeks pass and during another Hogsmeade visit, while hoping to find Hagrid at the Three Broomsticks Inn, the trio instead finds Ludo Bagman meeting with some goblins. During a private conversation with Mr Bagman, Harry learns that Barty Crouch has stopped coming to work and is sending Percy instructions by owl. Also, after a search, they still haven't found Bertha Jorkins. Bagman then again offers his help for the tournament, which Harry immediately declines. Fred and George's sudden appearance forces Mr Bagman to leave. Hermione then questions why Mr Bagman is trying to help Harry cheat, along with why he was meeting with goblins. Rita Skeeter, who also encountered Bagman and the goblins, then shows up to investigate. Harry and Hermione start an argument with her about her article on Hagrid.\n\nThe trio go to Hagrid's cabin and, along with Dumbledore, try to persuade him to return. They point out that not everyone has abandoned Hagrid, and that everyone has secrets in their pasts. After Dumbledore leaves, Hagrid remembers his late father telling him never to be ashamed of what he is and gets over his depression. He gives his support to Harry in the Tournament, believing that if Harry wins, he could show everyone they do not have to be ashamed of what they are. This is enough to convince Harry to put aside his pride and take Cedric's advice.",
    "section": "Chapter 24: Rita Skeeter's Scoop",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Harry sneaks into the Prefect's bathroom at night so he could have all the time he will need to figure out the clue, taking only the golden egg, his Invisibility Cloak, and the Marauder's Map with him. Harry initially has trouble figuring out how to open the egg properly, but with a little help from Moaning Myrtle, who had been spying on him, Harry opens the egg under water. This time, Harry hears voices singing and can understand them when he puts his head underwater. Harry realises that he must save something he cares about from merpeople who live in the depths of the Black Lake.\n\nOn the way back to Gryffindor tower, Harry sees Barty Crouch in Snape's office on the Marauder's Map and goes to investigate. When he falls through a trick stair and traps his leg, he accidentally drops the egg and map, attracting the attention of Filch. Filch finds the egg, and Snape soon arrives and demands Filch's help in catching someone who broke into his office. Moody then shows up, angering Snape by suggesting Snape had something to hide in his office. Snape points out that Moody searched his office after his arrival at Hogwarts. Moody then saves Harry from detection by claiming that the Marauder's Map is his own (after an invisible Harry warns him not to give it to Snape). However, Snape suspects Harry's involvement because he recognises the Marauder's Map before Moody confiscates the egg from Filch and forces the pair away.\n\nAs Moody frees Harry's leg, Harry tells Moody about how the map works and that he saw Mr Crouch on it. After Moody spends time looking over the Marauder's Map, Harry asks what Crouch was doing in Snape's office, and Moody suggests that Crouch was trying to find evidence of Snape being a Dark wizard. Moody then asks to borrow the map, and after learning what Harry was up to that night, says that Harry might consider becoming an Auror for a career.",
    "section": "Chapter 25: The Egg and the Eye",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Harry explains what happened the previous night to Ron and Hermione. Even though Harry and Ron suspect Snape might have put Harry's name in the Goblet of Fire, Hermione doubts this. Harry also sends a school owl to Sirius to update him on what happened.\n\nOver the coming weeks, even with help from Hermione and Ron as well as the library's resources (including getting McGonagall's permission for the Restricted Section), Harry struggles to think of a way to breathe underwater for an hour. Two days before the second task is to start, Sirius's response comes in. Sirius wants to know when their next trip to Hogsmeade is.\n\nOn the last night before the task, the trio are continuing their research in the school library when Fred and George appear to inform them that Professor McGonagall has summoned Ron and Hermione. Harry later sneaks back into the library after hours with his Invisibility Cloak, but can't find anything else.\n\nThe next morning, with a little help from Dobby, Harry discovers gillyweed, a plant that, when eaten, gives him fish-like qualities such as gills and fins. He quickly makes his way to the lake just as the task is about to start and finds that, once again, Percy is taking Mr Crouch's place. While swimming through the lake and fighting off a swarm of Grindylows, Moaning Myrtle points Harry in the right direction and Harry discovers a town of Merpeople, where Ron (the thing Harry would miss the most) is being held, along with Hermione (for Krum), Cho (for Cedric), and Fleur's sister.\n\nHarry frees Ron, but refuses to leave the others, despite the insistence of the Merpeople. Cedric and Krum appear and rescue their loved ones, but Fleur never arrives. With little other choice, Harry drags her sister to the surface as well, narrowly avoiding drowning as the gillyweed wears off. Although he was wrong to think the other hostages would be left to die (they would have simply returned to the surface unharmed), his bravery and valour earn him extra points from the judges, who state that he showed great \"moral fibre.\" This puts both Harry and Cedric in first place in the overall points. Ludo Bagman then reveals the third and final task is on 24 June and the champions will learn more about it a month beforehand.",
    "section": "Chapter 26: The Second Task",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "In March, Sirius' reply states that the trio are to meet up with him during their next Hogsmeade trip and asks them to bring food. Before Potions, Slytherin Pansy Parkinson gleefully gives Hermione a copy of Witch Weekly; Rita had published an article on Hermione Granger, saying that she is toying with both Harry and Krum's feelings. Pansy, who is quoted in the article, suggested Hermione was making illegal Love Potions. Hermione realises that Skeeter must have eavesdropped on her and Krum's conversation on the shores of the lake, and begins wondering how Rita is getting her information. After Snape gets a hold of the article, he reads it aloud, creating further laughter from the Slytherins. He then breaks the trio up and sends them to different tables. Snape also confronts Harry over the recent theft of boomslang skin and gillyweed from his office, who has no idea what he's talking about. He threatens Harry with Veritaserum, a potion that will cause Harry to tell the truth when consumed. Karkaroff then shows up to talk to Snape and sticks around until after class. Snape blows him off, but not before Harry, who purposely stayed behind, noticed that Karkaroff had tried to show Snape something on his arm. Sirius meets Harry, Ron, and Hermione secretly in Hogsmeade and directs them to a mountain cave where Buckbeak and some old Daily Prophet articles are waiting (Sirius had been stealing discarded newspapers to keep up on current events). They first discuss Winky and what happened at the World Cup. Sirius suggests that whoever stole Harry's wand must have done so while they were watching the game in the Top Box, and is suspicious that Barty Crouch was looking around for something before he sacked Winky. He then finds it odd that not only did Crouch not show up during the game, but also that he is suddenly indisposed. Sirius explains that Crouch was the one who sent him to Azkaban without a trial, as Crouch used to be the Head of the Department of Magical Law Enforcement and was once poised to become the next Minister for Magic. During Voldemort's previous reign, Crouch took extreme measures against the Death Eaters, including allowing the Aurors to use the Unforgivable Curses against them.",
    "section": "Chapter 27: Padfoot Returns",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "While this greatly boosted Crouch's popularity and ensured that Crouch would become the next Minister, Crouch's son had been caught with a group of Death Eaters just after Voldemort's downfall. The Death Eaters in question were trying to find Voldemort and help him get his strength back. The youth was given a show trial by his father before being locked up in Azkaban; he died a year later. Shortly after Barty Crouch Jnr died, Crouch's wife died as well. Crouch's popularity dropped heavily after that, as people suspected that Crouch was a bad father. As a result, with Crouch's reputation outside the Ministry destroyed, the Minister for Magic's post went instead to Cornelius Fudge, who immediately reassigned Barty Crouch Snr to the Department of International Magical Co-operation. Ron brings up Crouch's appearance in Snape's office. Sirius states that doesn't make sense, since Crouch would have kept an eye on Snape as a tournament judge. When Ron and Hermione bicker about whether Snape can be trusted, Sirius says they both have a point, as it is questionable why Dumbledore would trust Snape. Snape was interested in the Dark Arts as a child and hung out with some Slytherin students that became Death Eaters, though he also knows Snape is smart enough to not get caught by the Ministry. Harry then remembers Karkaroff's sudden appearance in their class, though Sirius can't figure out what that was about. Sirius then brings all the questions of these mysterious circumstances together, including why Moody was also searching Snape's office. He asks Ron to send a letter to Percy to find out if there is any news about Crouch. Before they leave, Sirius reminds them not to wander outside Hogwarts at all for safety reasons. On the way back, the trio conclude that the scandal involving his son is the reason Crouch overreacted to seeing Winky being accused of conjuring the Dark Mark. Ron voices how he and Percy are similar. Hermione states Percy would never do what his boss did, but Ron is unconvinced.",
    "section": "Chapter 27: Padfoot Returns",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After sending Hedwig with the letter to Percy, the trio heads to the kitchen to give Dobby the socks Harry bought for him. They find that Winky has become intoxicated from consuming a large amount of butterbeer (which works like alcohol on house-elves). It doesn't help when Harry mentions that Mr Crouch has disappeared.\n\nHate mail soon starts popping up for Hermione in regards to Rita Skeeter's article. She has to go to the Hospital Wing due to a curse and doesn't turn up until a Care of Magical Creatures lesson, where Hagrid is having them use Nifflers to find gold coins (which is actually Leprechaun gold) he buried. Hagrid encourages Hermione to ignore the hate mail, citing the hate mail he received after Skeeter released the article about him. Hermione decides to discover how Skeeter has been getting her information when she is already banned from school grounds.\n\nIt is around Easter that Percy's response comes, along with Easter eggs from Mrs Weasley (Hermione's is smaller than Harry and Ron's because Mrs Weasley read Skeeter's article). His irradiated response doesn't help. On the night of 24 May, Harry and the other champions are called to the Quidditch pitch by Ludo Bagman and informed that a magical maze will be grown there and filled with magical obstacles. Their job is to head to the centre of the maze and touch the Triwizard Cup. Before Mr Bagman can offer Harry advice again, Krum takes Harry aside to the Forbidden Forest and questions him about his relationship with Hermione. Harry assures Krum that he and Hermione are just friends.\n\nMoments later, a rather crazy-looking Barty Crouch emerges from the forest asking for Dumbledore. He mentions that Voldemort is getting stronger and that he himself was responsible for something bad. He also mentions his son, as well as Bertha Jorkins, who is now dead. Harry goes to retrieve Dumbledore, but when he returns, they find that Krum has been stunned and Crouch has disappeared. Karkaroff accuses Mr Crouch's apparent attack on his student as a secret conspiracy by Dumbledore. Hagrid angrily demands that he apologise but Dumbledore restrains him. Dumbledore has Hagrid take Harry back to Gryffindor Tower to rest. He hints in his message not to contact Sirius until the next morning. On the way back, Hagrid scolds Harry for being out alone with Viktor Krum.",
    "section": "Chapter 28: The Madness of Mr Crouch",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The trio debate last night's events the following morning. Harry thinks the strange things Mr Crouch said were important, especially if Voldemort is getting stronger. The group go to the Owlery to send a letter to Sirius Black, and overhear Fred and George, who are talking about blackmailing someone that they've tried to reason with. Ron asks whom they are blackmailing, but they make it look like they are joking. After they leave, Ron points out that it is obvious Fred and George are serious about starting a Joke Shop. They are close to graduating, with only one full year left, and they have to make enough money on their own to start one. Hermione suggests telling Percy, but Ron refuses, both because of what Sirius said about Barty Crouch Snr and Percy's similarities to him. Later, they meet up with Moody. Moody reveals that he couldn't find him. He also tells them that there's nothing they can do about Crouch and that the Ministry is investigating the matter, and urges Harry to instead prepare for the final task.\n\nSirius's response arrives the following day: he scolds Harry for being out with Krum alone and late at night and says he is lucky he wasn't attacked, since it is clear to him that someone did not want Barty Crouch to reach Dumbledore, and he was probably feet away from them in the dark. He instructs Harry to stay safe and practise defensive spells for the Third Task, and demands that Harry give him his word that he won't go out of bounds again, especially not after hours. At Hermione's urging, he sends an owl back doing so.\n\nNot long later, during Divination, Harry passes out and has a vision. He sees Voldemort being informed of someone's death and torturing Wormtail for failing to prevent that person from escaping. Harry awakens with his scar hurting badly and pretends he has to go to the Hospital Wing. Harry actually goes to see Dumbledore. After spending time trying to get the password to Dumbledore's office right, Harry overhears an argument between Dumbledore, Moody, and Cornelius Fudge regarding the Barty Crouch situation. Fudge refuses to believe the words that Crouch said about Bertha Jorkins being dead, and while debating what happened to Crouch, Fudge suggests that Madame Maxime is the likely culprit given her half-giant physiology. Dumbledore accuses Fudge of acting on personal prejudice, which Fudge ignores due to Dumbledore's friendship with Hagrid. Moody interrupts the debate to explain that Harry Potter has arrived.",
    "section": "Chapter 29: The Dream",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Dumbledore, Fudge, and Moody leave to examine the school grounds, and Harry is alone in Dumbledore's office. While looking around, notices Dumbledore's Pensieve, a device that stores memories. Through curiosity, Harry peers in and ends up looking into three of Dumbledore's memories. The first is the trial of Igor Karkaroff, in which he renounces his support of the Death Eaters and gives the names of existing Death Eaters, including Snape. Dumbledore (in the memory) states that Snape is a spy against Voldemort and is no longer a threat. The second memory shows the trial of Ludo Bagman, who was accused of passing information to Voldemort, even though he wasn't aware the person he gave the information to was a Death Eater; his popularity quickly clears him. The third is a trial for the Lestrange family, a group of three, and Crouch's son, Barty Crouch Jnr, for the use of the Cruciatus Curse on Alice and Frank Longbottom. Crouch sentences them all to a lifetime in Azkaban. By then Dumbledore (from the present) arrives and brings Harry back.\n\nAfter Dumbledore explains what happened and shows Harry another of his memories regarding a teenage Bertha Jorkins during her Hogwarts years, Harry explains what happened in Divination. Dumbledore finds Harry's scar pains to be an odd concept and brings up that this is the second time it has hurt, the first being during the summer. This shows Harry that Dumbledore has been talking to Sirius Black, and Dumbledore reveals that it was his idea for Black to hide in the cave outside Hogsmeade.\n\nDumbledore suspects that the reason why Harry's scar hurts is due to the connection that Voldemort's failed curse had created with him. He believes the scar would only hurt when Voldemort were close or was feeling a strong emotion. Dumbledore also explains to Harry that, unlike the Ministry, he believes that the disappearances of Bertha Jorkins, Barty Crouch, and a Muggle by the name of Frank Bryce may be connected to Voldemort.\n\nDumbledore also explains that Frank and Alice Longbottom are Neville's parents and they went insane due to the Lestranges' attack and that this is the reason why Neville was brought up by his grandmother and why he has such an aversion to the Cruciatus Curse. Dumbledore doesn't know if Crouch Jnr was involved, but he personally requests that Harry does not disclose this information to anyone, saying that Neville himself will share it when he is ready.",
    "section": "Chapter 30: The Pensieve",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Harry passes on the information he learned from the Pensieve to Ron and Hermione, excluding the details about Neville's parents. Hermione realises this is what Rita Skeeter and Winky meant about Ludo Bagman being a Dark wizard. That same night, Harry's hatred of Voldemort reaches a new height because of what he learned from the Pensieve. As the task approaches, Ron and Hermione find time when they are not studying for their final exams to help Harry. Even McGonagall helps by allowing him to practise in her empty classroom during lunchtime. During one practice session, Ron notices Malfoy outside the castle sitting by a tree and doing something odd. Harry and Hermione also see him before they return to practice. Sirius sends Harry messages by owl each day, reminding Harry to focus on what is ahead.\n\nOn the day of the third task, Rita Skeeter releases an article claiming Harry is demented and dangerous. She uses a quote from Draco Malfoy in the article. This raises some questions between the trio, since the article mentions Harry's scar hurting during Divination. The class takes place in the North Tower and Skeeter is not allowed inside Hogwarts, so she shouldn't have had that information. Hermione finally figures out how Skeeter may be getting her information and leaves to put her theory to the test.\n\nMcGonagall tells the champions that their families have come to watch them complete. Harry doesn't want to meet them, expecting the Dursleys, but instead finds Molly and Bill Weasley. While they give Harry a tour of their knowledge of Hogwarts, Mrs Weasley gets into an argument with Amos Diggory regarding Harry's popularity in the tournament, before Mrs Diggory asks him to stop. They then mention to Harry that Percy will not be coming this time. After the Barty Crouch incident, which is being kept secret, Percy was hauled in for questioning regarding that the instructions he was receiving, which may not have actually been sent by Barty Crouch. Instead, Cornelius Fudge will be serving as the fifth Triwizard judge in his place.\n\nAfter the rest of the Weasley children and Hermione show up, Harry tells Mrs Weasley that everything Skeeter wrote on Hermione was a lie. After dinner, Mr Bagman takes the champions to the maze and Harry and Cedric, who are tied for first place, are sent in first.\n\nHarry successfully navigates the maze with the aid of the Four-Point Spell. He gets past both a Blast-Ended-Skrewt and a Boggart disguised as a Dementor. Along the way, he hears Fleur scream. Harry rescues Cedric, who has been attacked by a mind-controlled Krum; Harry manages to stun Krum and sends out a signal for Krum to be rescued before he and Cedric move on. Harry manages to pass a sphinx and, as he approaches the Cup, is attacked by an Acromantula. Aided by Cedric, he defeats it, though one of Harry's legs is injured in the process. After taking the monster out, they decide to grab the Cup simultaneously. Unbeknownst to them, the Cup is actually a Portkey that transports them to an old cemetery in the Muggle village of Little Hangleton.",
    "section": "Chapter 31: The Third Task",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "for Lord Voldemort]]\n\nJust as Harry and Cedric are trying to figure out what happened, a hooded stranger appears and Harry's scar begins hurting again. A second voice orders the stranger to kill Cedric, which he does, leaving Harry frozen with shock and horror. Harry is then dragged to a large marble tombstone with the name Tom Riddle engraved upon it. The stranger then tightly binds Harry to it with thick black cords from arm, wrists, legs, neck to ankle, and gags him by stuffing black cloth in his mouth to muffle his cries for help. \n\nUnable to escape, Harry recognises the stranger as Peter Pettigrew due to the missing finger on his right hand. He also notes that Pettigrew is carrying what appears to be a deformed infant. Pettigrew takes some of Harry's blood, bone dust from Tom Riddle Snr's grave, and puts them in a cauldron. He then cuts off his own right hand, at the orders of the strange creature, and places it in a cauldron. The creature is revealed to be none other than Lord Voldemort himself, and the potion made by Pettigrew returns a physical form and restores his powers stronger than before; therefore fulfilling Sybill Trelawney's second prophecy from the previous year in its entirety.",
    "section": "Chapter 32: Flesh, Blood and Bone",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Voldemort forces Wormtail to take out his bleeding arm to activate the Dark Mark and summon the Death Eaters. While in wait, Voldemort tells Harry that after his father abandoned him and his mother upon finding out that his mother was a witch, Voldemort's mother died giving birth to him and he was raised in a Muggle orphanage. He later sought revenge by murdering his father.\n\nAfter his Death Eaters arrive, Voldemort spends time criticising them for failing to seek him out during these last thirteen years, even though they knew that he had found a way to escape mortal death. He believes they feared a power greater than his, like that of Albus Dumbledore, which is why they slipped back into normal wizarding society and claimed they were never loyal to Voldemort. Voldemort then rewards Wormtail for aiding with his rebirth by creating a new silver hand for him.\n\nVoldemort identifies more Death Eaters, including Lucius Malfoy, and announces his plans for rebuilding his army and punish the Death Eaters that have deserted him. Voldemort answers Lucius's question about how he had returned by explaining the protection spell that Lily Potter provided Harry when she died. That is what originally caused his downfall and provided Harry with protection from him, but now that they share the same blood, Voldemort is free to touch Harry. Voldemort then reveals that he fled deep into an Albanian forest, barely alive and without a proper body, surviving by possessing animals until Quirinus Quirrell showed up and let Voldemort share his body. Following his failure to obtain the Philosopher's Stone, Voldemort returned to Albania with little hope of getting a corporeal body again.\n\nAfter fleeing the country following the events of Harry's third year, Wormtail learned of Voldemort's continued existence from other rats. Wormtail went to seek Voldemort, and during his journey, he ran into Bertha Jorkins. He delivered her to Voldemort and, through torturing her, Voldemort found out about the Triwizard Tournament. He also discovered that a faithful Death Eater servant was still alive after breaking a memory charm that had been placed on Jorkins.\n\nWith Wormtail's help, Voldemort was able to regain a body of his own and some of his powers and return to Britain. There, he plotted Harry's abduction and kidnapping, knowing that Harry's blood would remove his own mother's protection. Voldemort reveals that this servant who is at Hogwarts has ensured that Harry would win the tournament and be brought to the graveyard. Voldemort then frees the injured and weakened Harry and orders him to face him in a duel, wishing to prove who among the two is stronger in front of his minions now that there is no one around to protect Harry.",
    "section": "Chapter 33: The Death Eaters",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Voldemort challenges Harry to a duel. After Harry refuses to bow to the Dark Lord, Voldemort uses the Imperius Curse on Harry to force him to. Though Harry gives in the first time, the second time he manages to shake the curse off, much to the astonishment of the Death Eaters present.\n\nWhen the duel begins, something miraculous happens. Voldemort and Harry's wands are \"brothers\", due to the fact that their wands' cores are both feathers from the same phoenix. As the wands spells meet in the air and interlock, a Priori Incantatem effect occurs. This causes the spirit echoes of Voldemort's victims, including Harry's parents, to spill out from his wand. The echoes momentarily protect Harry, allowing him to grab the Portkey and escape to Hogwarts with Cedric's body.",
    "section": "Chapter 34: Priori Incantatem",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "When he arrives back at the school, many of the students begin to scream when they see Cedric's body. During the confusion, where an exhausted Harry tries to tell Dumbledore what happened, Harry is ushered away by Moody while Dumbledore and Fudge are busy with Cedric's parents. Moody takes Harry to his office, where Harry sits in shock and Moody gives him a potion to bring him around. As Moody probes Harry for information, Harry says he believes that Karkaroff is the faithful servant that Voldemort mentioned. Moody reveals that when the Dark Mark was activated, Karkaroff fled Hogwarts, since he had betrayed the Death Eaters and could never go back to them. After Moody reveals he knows that Harry was taken to the graveyard and that he is angry that Voldemort did not try to torture the Death Eaters that had abandoned him, he tells Harry that he was responsible for putting Harry's name in the Goblet of Fire under a different school. He purposely tipped off Hagrid about the dragons so Hagrid could show Harry and gave Harry a hint for beating the first task. He gave Cedric the clue to the egg for the second task, knowing that Cedric would tell Harry. Moody's original plan was to have Harry use Neville's Herbology book to learn about the gillyweed, but since Harry would not ask for help, Moody purposely set up the conversation with McGonagall about gillyweed so Dobby would get it from Snape's office. Moody also reveals that he was responsible for helping Harry in the third task by dealing with the obstacles, stunning Fleur, and bewitching Krum to take out Cedric. Moody attempts to kill Harry to please his master, but before he has the chance, Dumbledore, Snape, and McGonagall burst in and Dumbledore stuns him. Dumbledore tells Harry this man is not Alastor Moody, which Dumbledore realised when Moody took Harry from Dumbledore, something the real Moody would never do. Dumbledore sends Snape to get a potion and fetch Winky; he also sends McGonagall to tell a large black dog she would find at the pumpkin patch to go to his office. He then opens Moody's trunk and finds the real Alastor Moody inside the seventh compartment.",
    "section": "Chapter 35: Veritaserum",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Dumbledore discovers that the impostor has been using the Polyjuice Potion to disguise himself as Alastor Moody all year, keeping the real Moody alive so he could use his hair as an ingredient, though he suspects in the excitement of tonight the impostor forgot to take his most recent dosage. They wait until the effects wear off, revealing that the impostor is Barty Crouch Jnr, just as Snape, McGonagall, and Winky arrive. Under the effects of Snape's Veritaserum, Crouch Jnr is asked by Dumbledore how he escaped Azkaban. Crouch Jnr confesses that his father, Barty Crouch Snr and his mother helped him escape Azkaban. His mother was dying, and it was his mother's wish that he could escape, so Barty Crouch Jnr and his mother switched places using the Polyjuice Potion. Mrs Crouch died and was buried disguised as him, while Crouch Snr had a private funeral for her to conceal the truth. Barty Crouch Snr put the Imperius Curse on his son to make sure he was controlled and out of sight. Bertha Jorkins found out when she came to their house on business while Crouch Snr was not home, forcing Crouch Snr to place a Memory Charm on her; this permanently damaged her memory. After Winky persuaded her master to let his son go to the Quidditch World Cup, they arranged to use an Invisibility Cloak to hide Crouch Jnr as he sat in the Top Box. During this event, Crouch Jnr secretly fought the curse and stole Harry's wand when Winky wasn't looking. When the Death Eaters showed up and disrupted the tournament, Barty Crouch Jnr was angry that they weren't loyal to Voldemort. After regaining control he used Harry's wand to summon the Dark Mark, which scared the Death Eaters away. His father fired Winky for failing to watch him and almost letting him escape. He then found him and took him home. Eventually, thanks to Bertha's information, Voldemort and Wormtail were able to find Crouch Jnr and release him from his father's imprisonment. Learning from Bertha about Alastor Moody becoming a teacher at Hogwarts, he and Wormtail captured Moody, allowing Crouch Jnr to be planted at Hogwarts as Moody, with Wormtail keeping an eye on Crouch. He kept Moody alive not only to maintain his disguise, but also learned about his habits so he could fool Dumbledore.",
    "section": "Chapter 35: Veritaserum",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "It is revealed that Crouch Jnr was the Barty Crouch Harry saw on the Marauder's Map, stealing potions ingredients from Snape's office to continue making the Polyjuice Potion. Eventually, Crouch started to fight off the Imperius curse placed upon him and was then kept under home imprisonment by Wormtail under the pretence of being unwell. He managed to escape and travel to Hogwarts to warn Dumbledore of his son's existence. However, using the Marauder's Map, Crouch Jnr was able to intercept and kill him. He then transfigured his father's body into a bone and buried it in Hagrid's yard. Crouch Jnr, as Moody, then offered to take the Triwizard Cup into the maze so he could turn it into a Portkey and complete his master's plan.",
    "section": "Chapter 35: Veritaserum",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Dumbledore takes Harry to his office to meet Sirius, but not before placing McGonagall in charge of Crouch Jnr. He also sends Snape to take Moody to the Hospital Wing and bring Cornelius Fudge up to Moody's office.\n\nOnce in Dumbledore's office, Harry tells Dumbledore and Sirius everything. Dumbledore explains the Priori Incantatem effect and says that the spirits that appeared were echoes of Voldemort's most recent victims. After Sirius transforms back into a dog they head to the Hospital Wing, where Harry is given a Sleeping Potion to help him relax.\n\nUpon waking up, he, along with Molly and Bill Weasley, hear a large argument. Fudge summoned a Dementor as protection when he went to confront Crouch Jnr, which sucked out Crouch Jnr's soul before he, McGonagall, Snape, and Dumbledore entered the Hospital Wing. Dumbledore is upset that they lost a key piece of evidence on Voldemort's return, while Fudge believes the man was a lunatic and that his testimony would not have been useful.\n\nDue to reading Rita Skeeter's last article about Harry being dangerous, Fudge cannot accept Harry's testimony, nor does he believe Dumbledore's information about Harry's scar. Harry gets up and tries to identify the Death Eaters whose names he heard earlier, but Fudge points out they were cleared long ago and he might have read this out of an old Daily Prophet article. Fudge is offended by Dumbledore's suggestions of removing the Dementors from Azkaban and sending an envoy to make an agreement with the giants. Even after Snape reveals his Dark Mark and explains that Voldemort had summoned him, Fudge thinks it is some kind of a ploy and makes it clear that he is going to have a serious talk with Dumbledore about his position before he leaves. He then exits the room, but not before he gives Harry his winnings from the Tournament.\n\nBill Weasley leaves at Dumbledore's request to inform his father of the situation and have him discreetly contact those within the Ministry that can be convinced of the truth. McGonagall is sent to retrieve Hagrid and Madame Maxime for a mission. After Madam Pomfrey is sent to look after Winky, Dumbledore has Sirius revert to his true form. Both Mrs Weasley and Snape are surprised by his presence, but are quickly convinced of his innocence. Dumbledore dispatches Sirius to reinstate the Order of the Phoenix by gathering known wizards and witches who would support their side. Harry then regrets asking Cedric to grab the Triwizard cup with him, and then uses the last of the potion to return to sleep.",
    "section": "Chapter 36: The Parting of the Ways",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "After a few days of rest, Harry meets with Cedric's parents. They do not blame him for what happened and are thankful to have his body, but decline Harry's offer of the winnings. Harry is able to have a relaxing time, due to Dumbledore having made a formal request for the students to not talk about what happened that night, though some students are still unsettled due to Rita Skeeter's article. Hagrid gives the trio a good lecture on how Voldemort's return was inevitable and all they can do now is fight. Hagrid mentions that what Dumbledore has assigned for him is top secret and that Madam Maxime might be accompanying him. During the Leaving Feast, a memorial feast for Cedric is held, where Dumbledore tells the school what has happened in the graveyard despite the Ministry's wishes that he keep it secret. Afterwards, everyone is packed and ready to leave. Fleur and Krum both say good-bye to the trio before they head back to their schools, while the trio take their carriage to the Hogwarts Express. As Harry, Ron, and Hermione ride to King's Cross Station, they learn that the Daily Prophet is not reporting Cedric Diggory's death, likely due to the Ministry's interference. Hermione reveals that she has discovered that Rita Skeeter is an unregistered animagus who can turn into a beetle. Hermione caught Skeeter in a jar in the Hospital Wing after the third task. As the three think back, they realise that there was a bug on the statue the night of the Yule Ball where Hagrid told Madame Maxime his secret, that Krum found a bug in Hermione's hair after the Second Task, and that there was a bug on the window that day in Divination when Harry's scar hurt. They also realise that the reason why Rita got those interviews from Draco Malfoy and Pansy Parkinson undetected was that they knew she was an animagus; Harry recalled Draco sitting by a tree that day talking while holding a bug. Hermione assures Harry and Ron that her stories will trouble them no longer, since she told Rita that if the stories continued, she would tell the Ministry about her secret. Just as Malfoy, Crabbe, and Goyle arrive and taunt Harry over Voldemort's return, they are rendered unconscious from hexes used by both the trio and Fred and George Weasley.",
    "section": "Chapter 37: The Beginning",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Harry, Ron, and George then began kicking, rolling, and pushing the unconscious Malfoy, Crabbe, and Goyle into a spot where they will be out of the way. Soon another mystery is solved: The person that Fred and George were hinted to have been blackmailing was Ludo Bagman. When the twins won their bet, he paid them their winnings at the Quidditch World Cup in Leprechaun gold and wouldn't even return their original wager. This is also why he tried to avoid them in public when they confronted him. The twins reveal that Bagman has a long-time problem with gambling and he was also in debt to the goblins, who took his money after the World Cup and followed him to Hogwarts. Bagman made a bet that Harry would win the tournament to get his money back, which is why he was trying to help Harry cheat. However, since Harry and Cedric actually \"tied\" for first place, Bagman has gone on the run. As they get off the train and step and leave the Malfoy and his gang, Harry gives the twins his Triwizard Winnings to help them with their dream of running a joke shop. Everyone then say their good-byes as Harry prepares to leave with Vernon Dursley.",
    "section": "Chapter 37: The Beginning",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"4\" border=\"2\"\n! width=\"22%\" |Character\n! width=\"22%\" |Killed by\n! width=\"17%\" |Cause of death\n! width=\"27%\" |Circumstances\n|-\n|Tom Riddle Snr\n| rowspan=\"3\" |Lord Voldemort\n| rowspan=\"3\" |Killing Curse\n|(Mentioned only)\nRevenge for abandonment of his son; baffled Muggle Police.\n|-\n|Thomas Riddle\n| rowspan=\"2\" |(Mentioned only)\nMurdered along with Tom Riddle Snr; baffled Muggle Police.\n|-\n|Mary Riddle\n|-\n|Mrs Crouch\n|None\n|Broken heart (possibly)\n|(Mentioned only)\nTook Polyjuice Potion and posed as her son, Barty Crouch Jnr and took his place in Azkaban. Buried at the burial ground by the prison, under her son's name.\n|-\n|Evan Rosier\n|Alastor Moody\n| rowspan=\"2\" |Unknown\n| rowspan=\"2\" |(Mentioned only)\nResisted capture before Lord Voldemort's downfall and refused to come quietly.\n|-\n|Wilkes\n|Unidentified Aurors\n|-\n|Bertha Jorkins\n| rowspan=\"2\" |Lord Voldemort\n| rowspan=\"2\" |Killing Curse\n|(Mentioned only)\nDisposed of after passing on the information about the Triwizard Tournament and Barty Crouch Jnr's continuing existence to Voldemort.\n|-\n|Frank Bryce\n|Caught by Nagini eavesdropping on Voldemort's and Pettigrew's plan to capture Harry Potter in the Riddle House.\n|-\n|A spider\n| rowspan=\"2\" |Barty Crouch Jnr (impersonating Alastor Moody)\n|Killing Curse\n|Used as a demonstration in the D.A.D.A. class.\n|-\n|Barty Crouch Snr\n|Unknown, presumably Killing Curse (Barty Crouch Jnr simply said, \"I killed my father\")\n|Caught by his own son in the Forbidden Forest on the way to Hogwarts Castle to attempt a confession of smuggling him out of Azkaban. Body later transfigured into a bone and buried in Rubeus Hagrid's garden.\n|-\n|Cedric Diggory\n|Peter Pettigrew (using Voldemort's wand, on Voldemort's orders)\n|Killing Curse\n|Tried to interfere with Harry Potter's use in Voldemort`s rebirth at the Little Hangleton graveyard after accidentally getting Portkeyed there alongside Harry.\n|}",
    "section": "List of deaths",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Gobletoffirecover.jpg|British Children's Edition, published by Bloomsbury\nBloomsbury Celebratory Edition .jpg|British Celebratory Edition\nGoblet Special Edition.jpg|British Special Edition\nGoblet Original.jpg|British original Adult Edition\nHP the Goblet of Fire adult edition.jpg|British Adult Edition\nNormal GOF Signature.jpg|British Signature Edition\nHarry Potter and the Goblet of Fire new adult edition.jpeg|British 2013 adult edition\nGoblet of Fire New Cover.jpg|British 2014 Children's Edition\nGoblet fire cover.jpg|American, published by Scholastic\nNormal kkhp4.jpg|American 15th anniversary edition\nUS 2018 paperback 04 GOF.jpg|American 20th anniversary edition",
    "section": "English-language",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "GOF-Arabic cover.jpg|Arabic (Egyptian), هاري بوتر و كاس النار, published by Nahdet Misr\nCzech original 04 GOF.jpg|Czech, Harry Potter a Ohnivý pohár, published by Albatros\n-Files-Images-Bokadeildin-permur-bokarodir-potter4.jpg|Faroese, Harry Potter og eldbikarið, published by Bókadeild Føroya Lærarafelags\n250px-הארי פוטר 4.jpg|Hebrew edition\nJsdsdsd.jpg|Lithuanian, Haris Poteris ir Ugnies Taurė,published by Alma Littera\nHarry Potter Cover 4 Serbian.jpg|Serbian, Hari Poter i Vatreni Pehar, published by Evro Giunti\nHarry potter in ognjeni kelih.jpg|Slovenian, Harry Potter in ognjeni kelih\n2153-Harry-Potter-ve-Ates-Kadehi.jpg|Turkish, Harry Potter ve Ateş Kadehi",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Bosnian 04 GOF.png|Bosnian, Harry Potter i plameni pehar, published by Buybook\nBulgarian 2019 hardback 04 GOF.png|Bulgarian 20th anniversary edition, Хари Потър и Огненият бокал, published by Egmont Bulgaria\nSimplified Chinese 2008 Collector's Edition 04 GOF.png|Simplified Chinese (China) 2008 Collector's Edition, 哈利·波特与火焰杯, published by People's Literature\nDanish cover vol4.jpg|Danish, Harry Potter og Flammernes Pokal, published by Gyldendal\nDanish adult cover 4.jpg|Danish adult edition\nDanish 2012 paperback 04 GOF.jpg|Danish 2012 paperback\nDutch Book 4 cover.jpg|Dutch, Harry Potter en de Vuurbeker, published by De Harmonie and Standaard\nDutch Goblet of Fire book cover.jpeg|Dutch (the Netherlands) 2010 pocket edition, published by Uitgeverij De Harmonie\nFinnish Book 4 cover.jpg|Finnish, Harry Potter ja liekehtivä pikari, published by Tammi\nFrench Book 4 Cover.jpg|French hardback, Harry Potter et la Coupe de Feu, published by Éditions Gallimand\nFrench T4 (2011 new edition).png|French 2011 paperback\nFrench T4 (2016 new edition).jpg|French 2016 edition\nGerman 04 GOF.png|German, Harry Potter und der Feuerkelch, published by Carlsen Verlag\nGerman Adult Edition 04 GOF.png|German Adult Edition\nGerman 2013 Pocket 04 GOF.png|German 2013 Anniversary Pocket Edition\nGerman 2018 hardback 04 GOF.png|German 20th anniversary edition\n1499934525802.jpeg|Indonesian, Harry Potter dan Piala Api, published by Gramedia Pustaka Utama\nHarry-Potter-e-il-calice-di-fuoco.jpg|Italian, Harry Potter e il calice di fuoco, published by Adriano Salani Editore\nItalian 2021 redesign 04 GOF.png|Italian 2021 redesign\nLithuanian 2020 hardback 04 GOF.png|Lithuanian 20th anniversary edition\nHP4BOX.png|Brazilian Portuguese collector's edition, Harry Potter e o Cálice de Fogo, published by Rocco\nRussian 2008 Black Deluxe Edition 04 GOF.png|Russian 2008 Black Deluxe Edition, Гарри Поттер и Кубок Огня, published by Росмэн\nSlovak 2020 exclusive box set 04 GOF.png|Slovak 20th anniversary edition, Harry Potter a Ohnivá čaša, published by IKAR\nSpanish 04 GOF.jpg|Spanish, Harry Potter y el cáliz de fuego, published by Salamandra\nSpanish 15th anniversary 04 GOF.jpg|Spanish 15th anniversary edition\nSwedish 04 GOF.jpg|Swedish, Harry Potter och Den flammande bägaren, published by Tiden\nThai 2020 hardback 04 GOF.jpg|Thai 20th anniversary edition, แฮร์รี่ พอตเตอร์กับถ้วยอัคนี, published by Nanmeebooks\nGOF Turkish cover.jpg|Turkish edition\nGOF Ukrainian edition.jpg|Ukrainian, Гаррі Поттер і келих вогню, published by А-БА-БА-ГА-ЛА-МА-ГА\n\n}}",
    "section": "Translations (alternative covers)",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "Bloomsbury 04 GOFIE cover - Jim Kay.jpg|UK Illustrated Edition (Bloomsbury)\nBloomsbury 04 GOFIE full jacket - Jim Kay.jpg|UK Illustrated Edition, full jacket (Bloomsbury)\nScholastic 04 GOFIE cover - Jim Kay.jpg|US Illustrated Edition (Arthur A. Levine Books)\nA1+oFGwqPtL.jpg|French Edition",
    "section": "Illustrated Editions",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "UK House Edition hardback Gryffindor 04 GOF.png\nUK House Edition hardback Hufflepuff 04 GOF.png\nUK House Edition hardback Ravenclaw 04 GOF.png\nUK House Edition hardback Slytherin 04 GOF.png",
    "section": "Hogwarts House Edition",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "*The book presents the second out of five instances in which the opening narrative is not delivered through a point of view close to Harry: The first instance is in which is told from the perspective of Vernon Dursley. The second instance is , from the perspective of the Muggle caretaker, Frank Bryce. The third instance is in told from the perspective of the British Minister. The fourth instance is in told from the perspective of Narcissa Malfoy and Bellatrix Lestrange. The final instance is in told from the perspective of nearly all of the Death Eaters. *The book presents a greater international aspect to the wizarding community: the Quidditch World Cup; the Triwizard Tournament and two other European wizarding schools, Beauxbatons and Durmstrang; an unnamed wizarding school in Brazil; and an American wizarding institute, are either shown or mentioned. *Due to the uncertainty over what the book's title would be, the American audiobook by Jim Dale simply calls it \"the fourth volume in the Harry Potter series\". *The book mentions the name of a real person - Natalie McDonald, a nine-year-old girl from Toronto, Canada, who was dying of leukaemia. She wrote to Rowling asking what was going to happen in the next Harry Potter book as she would not live long enough to read it. The former emailed back, but Natalie had died a day earlier. In tribute, she became a first-year student at Hogwarts named by the Sorting Hat in Gryffindor - the house for the brave at heart - in the fourth book. When Rowling was later in Canada for a promotional tour she visited the McDonald family. With the exception of historical people such as Nicolas Flamel, this is the only Harry Potter book to so honour an individual. *Dumbledore was said to have a \"gleam of triumph\" in his eyes when told that Voldemort had restored his body using Harry's blood, at the end of Goblet of Fire (Ch. 36). Rowling has confirmed that this is \"still enormously significant\". It turned out that this was very significant because when Voldemort used Harry's blood to revive himself he made it so that as long as he lived Harry could not die, as revealed in . *In Hogsmeade, Sirius implied that at a certain point, Snape's attendance at Hogwarts overlapped with Lestrange's.",
    "section": "Behind the scenes",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "It could have meant Rodolphus or Rabastan Lestrange, Bellatrix's husband and brother-in-law respectively, as Bellatrix would have left school about two years before Snape started. *In the film version, it was heavily implied by the sheer number of students that everyone from Beauxbatons and Durmstrang made the trip to Hogwarts. However, in the book, it was mentioned that after the Durmstrang and Beauxbatons students entered the school and the Hallowe'en feast began, there were only about twenty extra students in the Great Hall. Igor Karkaroff also said in the book (during the argument about letting Harry Potter participate in the Triwizard Tournament) that he would have brought more students to Hogwarts if he had known younger students could enter the Tournament. *At the end of Prisoner of Azkaban, Cornelius Fudge mentioned possibly bringing a dragon to Hogwarts to guard the school. Ironically, the Ministry does bring dragons to Hogwarts, although for a different purpose. *In the chapter entitled \"The Unforgivable Curses\" when Harry and Ron are doing their Divination homework, some of their fake prophecies could be considered as coming true throughout the book. For example, \"stabbed in the back by someone you thought was a friend,\" may refer to Ron feeling betrayed by Harry becoming a Triwizard Champion since he thought Harry really did put his name in the Goblet without telling him. And possibly feeling slightly jealous at Harry's many achievements (whether deserved or not) and when Hermione points out Ron's apparent double drowning, it could be interpreted as foreshadowing her and Ron being placed at the bottom of the lake during the second task. **Also, Ron wrote down that he would lose a bet after betting Harry would win in a fight. This is a reference to Ludovic Bagman betting with the goblins that Harry would win the Triwizard Tournament, and losing the bet. *Cedric's death marked the first occasion in the series where a protagonist is killed off (excluding minor characters such as Frank Bryce, and deaths that occurred outside of the action, such as Lily and James.) In every book after this, at least one main character dies. In , Sirius Black is murdered by his cousin Bellatrix Lestrange. In Harry Potter and the Half-Blood Prince, Albus Dumbledore is murdered by Severus Snape. Finally, in , a number of protagonists are killed.",
    "section": "Behind the scenes",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "These deaths include Alastor \"Mad-Eye\" Moody, Fred Weasley, Severus Snape, Dobby, Remus Lupin, Nymphadora Tonks, Lavender Brown, and Colin Creevey. *This book is also very significant as it is not only the very middle book in the series, but it is the one in which Lord Voldemort comes back into power after gaining his own body. Therefore, this book is instrumental in changing not only the tone, but also the story structure for the remainder of the series.",
    "section": "Behind the scenes",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "The book was also adapted into a film, the fourth Harry Potter film of the series. The movie Harry Potter and the Goblet of Fire was released on November 18, 2005. It was directed by Mike Newell and the trio was portrayed by Daniel Radcliffe, Rupert Grint and Emma Watson.",
    "section": "Film adaptation",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  },
  {
    "text": "*\n*\n*\n*Harry Potter and the Goblet of Fire (character index)\n*1994–1995 school year\n\nde:Harry Potter und der Feuerkelch\nde2:Harry Potter und der Feuerkelch\nel:Ο Χάρι Πότερ και το Κύπελλο της Φωτιάς\nes:Harry Potter y el cáliz de fuego\nfi:Harry Potter ja liekehtivä pikari\nit:Harry Potter e il Calice di Fuoco\nfr:Harry Potter et la Coupe de Feu\nnl:Harry Potter en de Vuurbeker\nno:Harry Potter Ildbegeret\npl:Harry Potter i Czara Ognia\npt:Harry Potter e o Cálice de Fogo\nru:Гарри Поттер и Кубок Огня\ntr:Harry Potter ve Ateş Kadehi\nvi:Harry Potter và Chiếc cốc Lửa\nzh:哈利·波特与火焰杯\n\n__FORCETOC__\n4\nCategory:Canon",
    "section": "See also",
    "name": "Goblet of Fire",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 4,
    "source_book": "Goblet of Fire"
  }
]