[
  {
    "text": "}}\n\n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Olly Moss (Pottermore eBook)\n|interior=*Mary GrandPré (US)\n|narrator=*Stephen Fry (UK)\n*Jim Dale (US)\n|publisher=*Bloomsbury (UK, Canada)\n*Scholastic (US)\n*Raincoast Books (Canada (formerly))\n*Yapı Kredi Yayınları (Turkey)\n|release date=16 July 2005\n|pages=*607 (UK)\n*799 (US) \n*594 (Turkey)\n|preceded by=\n|followed by=\n}}\n\nHarry Potter and the Half-Blood Prince'' is the sixth novel in J. K. Rowling's . Set during Harry Potter's sixth year at Hogwarts, Lord Voldemort is definitely back, and with a vengeance. Harry finds his world is yet again changing: wizards and witches and Muggles alike are dying, despite the efforts of the Ministry of Magic and the Order of the Phoenix. Despite the danger, Harry and his best friends, Ron and Hermione, return to the familiar life of Hogwarts for their sixth year. They find yet another Defence Against the Dark Arts teacher: Professor Snape. They begin their N.E.W.T. classes in preparation for life after Hogwarts, and Harry gets some much needed Potions help from the mysterious Half-Blood Prince. Quidditch is as popular as ever, Harry is nominated as Gryffindor Quidditch Captain.\n\nAs well, this book sees the re-introduction of the Slug Club, along with the appointment of a new Potions teacher, Horace Slughorn. Romance again comes to Hogwarts and is a welcome balance to the grim happenings elsewhere. Harry deeply questions his own feelings for Ginny Weasley, who is Ron's younger sister, while trying to understand the effect it is having on his friends. Yet, while life at Hogwarts continues, the deaths also continue, with several near-fatal incidents occurring at Hogwarts. Danger seems to lurk around every corner, and Harry is as determined as ever to unmask it. Albus Dumbledore takes Harry under his guidance and together they explore Lord Voldemort's past, to find a way to stop him before it is too late. Ultimately, Harry realises he must accept his role as The Chosen One, and his destiny to either kill or be killed by Voldemort, as neither can live while the other survives. They all must choose between what is right and what is easy.\n\nWhen released on 16 July 2005, Harry Potter and the Half-Blood Prince was the first book in the United Kingdom to have a simultaneous standard print, large print, and Braille edition release. Within the first 24 hours, it sold 6.9 million copies in the U.S. alone, roughly moving 250,000 an hour, making it the fastest selling book in history. It generated more than $100 million in sales out of the gate, outpacing even the combined take of the top films at the box office. Bookseller Barnes and Noble reported sales averaging 105 copies per second in the first hour of sales. It is also the first book in the series to be shorter than the book preceding it.",
    "section": "General",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "]]\n''It is Harry Potter 's sixth year at Hogwarts School of Witchcraft and Wizardry. As Voldemort's sinister forces amass and a spirit of gloom and fear sweeps the land, it becomes more and more clear to Harry that he will soon have to confront his destiny. But is he up to the challenges ahead of him?''",
    "section": "Book description",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "''It is the middle of the summer, but there is an unseasonal mist pressing against the window panes. Harry Potter is waiting nervously in his bedroom at the Dursleys' house in Privet Drive for a visit from Professor Dumbledore himself. One of the last times he saw the Headmaster was in a fierce one-to-one duel with Lord Voldemort, and Harry can't quite believe that Professor Dumbledore will actually appear at the Dursleys' of all places. Why is the Professor coming to visit him now? What is it that cannot wait until Harry returns to Hogwarts in a few weeks' time? Harry's sixth year at Hogwarts has already got off to an unusual start, as the worlds of Muggle and magic start to intertwine...''",
    "section": "Raincoast Bloomsbury edition",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Rowling became pregnant with her third child during the writing of this book and often joked about them racing each other into the world. For this reason, the book was dedicated to her:\n\n:To Mackenzie,\n:My beautiful daughter,\n:I dedicate\n:Her ink-and-paper twin.",
    "section": "Dedication",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "in the Prime Minister's office]]\n\nThe Muggle Prime Minister receives a notice that Cornelius Fudge is to meet him. He then recollects Fudge's earlier meetings with him: his first meeting with Fudge soon after he became the Prime Minister, Sirius Black's escape from Azkaban, the Quidditch World Cup, the Triwizard Tournament and the 1996 Azkaban mass breakout. When Fudge finally arrives, he reveals a number of incidents which had occurred in the Muggle world and for which the Prime Minister is forced to owe responsibility: the collapse of the Brockdale Bridge, a supposed hurricane in the West Country, the deaths of Amelia Bones and Emmeline Vance and the insanity of Junior Minister Herbert Chorley which have all been caused by Lord Voldemort, his followers the Death Eaters and their Giant allies. In short, the Second Wizarding War has begun. Fudge also reveals that he has been sacked and replaced by Rufus Scrimgeour as Minister for Magic. Scrimgeour too meets the Prime Minister and discusses security arrangements with him. He also reveals that Fudge will be a liaison between them.",
    "section": "Chapter 1: The Other Minister",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Narcissa Malfoy and her sister Bellatrix Lestrange visit Severus Snape at Spinner's End, a poverty-stricken neighbourhood in a northern mill town. Narcissa wants Snape to help her protect her son Draco, who has been made a Death Eater and has been assigned a mission by Lord Voldemort himself. Bellatrix advises against this, distrusting Snape for not taking part in the Battle of the Department of Mysteries at the Ministry of Magic, and for his many suspicious actions through the years which make her doubt whether Snape is actually on their side. Snape explains his behaviour: He was at Hogwarts when Voldemort fell to be a spy for him, he didn't seek him out for the same reason her brother in law and the other deserters didn't look for him, he stopped Voldemort from getting the Philosopher's Stone because he thought Quirrell wanted it for himself, he never tried to kill Harry Potter because Dumbledore would know about it, and he didn't take part in the Battle of the Department of Mysteries because Voldemort ordered him to stay at Hogwarts. Snape also tells Narcissa that he knows about Draco's mission. Bellatrix tells her sister she should be proud but Narcissa believes that Voldemort is sending him on a suicide mission as punishment for her husband's failure. Snape offers to help Draco. Narcissa asks him to make an Unbreakable Vow and he agrees. With Bellatrix as their Bonder, Narcissa asks Snape to agree to the following terms:\n#That he watch over Draco while he attempts to carry out his mission as a Death Eater.\n#That he protect him and make sure he comes to no harm.\n#That he do the job for Draco if he proves unable to do it himself.\nSnape agrees to all three terms and the vow is made.",
    "section": "Chapter 2: Spinner's End",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Albus Dumbledore comes to visit Harry Potter at 4 Privet Drive to take him to The Burrow, where he would spend the rest of his summer holidays. Dumbledore reads Sirius Black's will: Harry inherits his deceased godfather's wealth, the Black family house at 12 Grimmauld Place, which Harry lets the Order of the Phoenix continue to use as headquarters, and the House-elf Kreacher, whom Harry sends to work at the Hogwarts kitchens. Dumbledore then chastises the Dursleys for their neglect and mistreatment of Harry but asks that he be allowed to return to Privet Drive one final time, and he and Harry depart.",
    "section": "Chapter 3: Will and Won't",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry notices Dumbledore has received a serious injury to his right hand, but the Headmaster dismisses it as unimportant. Dumbledore then asks Harry's help in convincing an old Hogwarts teacher, Horace Slughorn, to come out of retirement. They pay him a visit, but Slughorn is reluctant to return to the school, fearing it may put his life in danger from Death Eaters. Harry tells him that no teachers have died since Dumbledore became Headmaster, except Professor Quirrell, who was working for Voldemort, and reassures him that teachers at the school do not have to be members of the Order of the Phoenix. This dubious comfort, and the opportunity to get Harry to join his Slug Club, persuades Slughorn to return to Hogwarts. Dumbledore then drops Harry off at The Burrow, praising him for the way he has handled his godfather's untimely death and reveals that he would take private classes for him in the forthcoming academic year.",
    "section": "Chapter 4: Horace Slughorn",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry is warmly received at The Burrow by the Weasley family, who offer him Fred and George's bedroom to sleep in. Harry meets his best friends Ron Weasley and Hermione Granger and Ron's younger sister Ginny Weasley the following morning. He also meets Triwizard Champion Fleur Delacour, who is now working at Gringotts and is engaged to Ron's oldest brother Bill Weasley, which is not liked by Hermione, Ginny, and the rest of the Weasleys (except Arthur and Ron). Later in the day, the trio receive their O.W.L. results; Harry and Ron receive 7 O.W.L.s while Hermione receives 10. However, Harry is slightly disappointed as he has only achieved 'Exceeds Expectations' in Potions, meaning he can no longer realise his ambition as an Auror as Snape only takes students who have achieved 'Outstanding' into his N.E.W.T. Potions class.",
    "section": "Chapter 5: An Excess of Phlegm",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "After spending the next few weeks at The Burrow, Harry and Hermione go with the Weasleys to Diagon Alley to get school supplies. Rubeus Hagrid is entrusted with providing security to the group. After a fight with Draco Malfoy and his mother at Madam Malkin's, the entire group go to Weasleys' Wizard Wheezes, Fred and George's successful joke shop. Harry insists on paying for the merchandise, but Fred and George refuse his money as he was the one who gave them the money to start the joke shop, and Ginny buys a Pygmy Puff as a pet. While still in the store, Harry, Ron, and Hermione spot Malfoy walking through Diagon Alley without his mother and follow him under the Invisibility Cloak to Knockturn Alley and see him enter Borgin and Burkes, a shop that sells dark artefacts. The trio wait outside, listening to Draco by Extendable Ears and watching him through a window. They hear Malfoy talking with the owner Borgin, about repairing an object and keeping another object safe. Malfoy also shows Borgin something which Harry suspects is the Dark Mark (a mark branded on the left forearm of each Death Eater) and threatens Borgin by referring to the werewolf Fenrir Greyback. Harry comes to the conclusion that Malfoy has become a Death Eater and is up to no good, a theory which is dismissed by Ron and Hermione.",
    "section": "Chapter 6: Draco's Detour",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "On the Hogwarts Express, Harry meets his other friends Neville Longbottom and Luna Lovegood and shares a compartment with them, as Ron and Hermione are in the Prefect Carriage. By now, Harry finds himself attracted to Ginny, although she appears to have long given up on her crush on him and is currently dating Harry's classmate Dean Thomas. Harry and Neville are invited for lunch to Slughorn's compartment on the train along with Ginny and some other students with connections to well known or influential people. Before reaching Hogsmeade station, Harry enters Malfoy's compartment using his Invisibility Cloak to prove his suspicions about Malfoy. His suspicions are proven correct: Malfoy tells his friends Vincent Crabbe, Gregory Goyle, Pansy Parkinson and Blaise Zabini that he has become a Death Eater and he may not return to Hogwarts for his final year if the mission he was assigned by Voldemort is successful. Unfortunately for Harry, Malfoy notices Harry spying on him and once his friends have alighted from the train, he paralyses Harry, breaks his nose, covers him with the Invisibility Cloak and leaves him on the train.",
    "section": "Chapter 7: The Slug Club",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Nymphadora Tonks, who is assigned by the Ministry of Magic to guard Hogsmeade, comes to Harry's rescue. She takes him to the school, where he is received by Snape. At the Start-of-Term Feast, Dumbledore announces, to Harry's shock, that Snape is taking over the post of Defence Against the Dark Arts teacher, while Slughorn will be taking Snape's vacated job as Potions Master. This allows Harry and Ron to continue with Potions, as Slughorn takes students who have received 'Exceeds Expectations' in their Potions O.W.L.",
    "section": "Chapter 8: Snape Victorious",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry and Ron take Charms, Defence Against the Dark Arts, Herbology, Potions and Transfiguration as their N.E.W.T. subjects. During the first Defence Against the Arts class of the year, Harry receives a detention from Snape as he had talked back to him following Snape trying to use him as a guinea pig to show how a nonverbal spell works. Later that day, they attend Potions, where Harry and Ron receive old copies of Advanced Potion-Making from Slughorn as they did not buy the book. Harry's book, previously owned by someone named The Half-Blood Prince, contains a large number of shortcuts on making various potions, which prove useful in brewing the Draught of Living Death. To everyone's surprise, Harry's potion is judged the best by Slughorn and is awarded a bottle of Felix Felicis as a prize. When Harry tells Ron and Hermione about the book, Ginny overhears them and angrily confronts Harry about following the directions of this mysterious book in fear that it may be cursed like Tom Riddle's diary. A jealous Hermione then tries various spells to reveal the true nature of the book, but the book proves to be a normal one, allaying Ginny and Hermione's fears.",
    "section": "Chapter 9: The Half-Blood Prince",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "As promised at The Burrow, Albus Dumbledore begins the private series of lessons with Harry concerning Lord Voldemort. In the first lesson, Dumbledore shows Harry the first of a number of memories he has collected concerning Voldemort's past using The Pensieve. It shows a former Head of the Magical Law Enforcement Patrol, Bob Ogden visiting a man named Marvolo Gaunt in order to summon his son Morfin to a Ministry hearing in connection with an attack on a Muggle named Tom Riddle. A huge commotion occurs: Morfin attacks Ogden, with Marvolo stoutly defending his son's actions. Marvolo also tries to attack his daughter Merope after finding out that she has a crush on Riddle. After viewing this memory, Dumbledore tells Harry that both Marvolo and Morfin were sentenced to six months and three years' imprisonment respectively in Azkaban due to their behaviour to Ogden and other Ministry officials. He also reveals that Merope Gaunt was Voldemort's mother and Riddle was his father, thus making Marvolo Voldemort's maternal grandfather and Morfin his maternal uncle. He then speculates that following Marvolo and Morfin's arrest, Merope may have offered a love potion to Riddle or used the Imperius Curse, as a result of which they fell in love and got married. Later, when Merope was pregnant, she may have stopped giving the potion to Riddle, which may have led to Riddle, who had no love for Merope, leaving her and returning to his village.",
    "section": "Chapter 10: The House of Gaunt",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry, the new Gryffindor Quidditch Captain, holds trials to select the team for the annual Quidditch Cup. Due to Harry's popularity, it proves to be extremely taxing and difficult, with even first-years, Ravenclaws and Hufflepuffs turning up for the trials. In the end, Harry selects a team which includes among others, seventh-year Katie Bell, the only member remaining from the Quidditch team Harry joined in his first year, Ginny, who returned as a chaser, and Ron, who returned to his position as Keeper, staving off competition from another seventh-year and Slug Club member Cormac McLaggen. Later Harry, Ron and Hermione go visit Hagrid, who is upset at them as they had dropped his subject, Care of Magical Creatures. After lying to Hagrid that they had dropped Care of Magical Creatures as they could not fit it into their timetables, Hagrid reconciles with them. When the trio return to the Great Hall for dinner, Harry finds out that Hermione had used the Confundus Charm on McLaggen so that Ron would become Keeper, but he does not tell Ron this. Slughorn then invites Harry and Hermione for dinner with the other Slug Club members in his office, which Harry declines as he has to do his detention with Snape.",
    "section": "Chapter 11: Hermione's Helping Hand",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry finds a couple of spells scribbled on the Half-Blood Prince's textbook. He tries one of them (Levicorpus) in his dormitory, but points his wand at Ron by mistake, which results in Ron hanging by his ankle from the ceiling. Later that day, Harry, Ron and Hermione go to Hogsmeade, where they witness Katie being cursed after touching a strange necklace. Remembering seeing the same necklace in Borgin's shop, Harry voices his suspicions of Malfoy to Professor McGonagall, but she, like Ron and Hermione, rubbishes his theory, stating that Malfoy did not go to Hogsmeade as he had a detention with her, and that there is no proof that he bought the necklace.",
    "section": "Chapter 12: Silver and Opals",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "In his second lesson with Dumbledore, Harry first sees Caractacus Burke talking about a locket of Salazar Slytherin's that a pregnant and desperate Merope Gaunt had sold him, Riddle having abandoned her when she stopped bewitching him, then goes into a memory of Dumbledore's to the orphanage that Riddle had grown up in. Harry learns that Merope had later died in childbirth, and that even at an early age, Riddle had developed his powers, which he used to punish people who annoyed him and had a sadistic, cruel and independent nature, just like the adult Voldemort. Dumbledore also reveals to Harry that Voldemort likes to collect trophies.",
    "section": "Chapter 13: The Secret Riddle",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "During a Herbology lesson, Ron expresses his jealousy of not being invited to Slughorn's upcoming Christmas party, to the point of teasing Hermione about it. When she tells him that she was planning to invite him, however, his attitude changes, and they begin to show signs of attraction to each other. Harry is unsure how he feels about this, remembering his unsuccessful relationship with Cho Chang during his fifth year. With Katie unable to play, Harry recruits Dean Thomas onto the Quidditch team, which continues to improve. On their way back from practice however, Harry and Ron come across Dean and Ginny kissing behind a tapestry. Harry feels a huge surge of jealousy toward Dean, while Ron and Ginny have a heated argument. Ron states that he doesn't want to see his sister \"snogging\" (kissing) people in public, while Ginny tells him that her love life is none of his business, and that he's only upset because he's never kissed anyone, referencing Harry and Cho's relationship and revealing that Hermione had once kissed Viktor Krum. This piece of information wrecks Ron's relationship with Hermione, as well as his Quidditch skills, and badly alters his personality. Harry meanwhile tries to convince himself that his feelings for Ginny are entirely elder brotherly but eventually realises that he has fallen in love with her. To improve Ron's Quidditch and mend his friendship with Hermione, Harry pretends to slip Ron some Felix Felicis on the day of the match between Gryffindor and Slytherin. Feeling lucky, Ron goes on to save everything the Slytherin chasers throw at him, and Gryffindor hammers Slytherin. However, the plan backfires. After the match, Ron accuses Hermione of not having faith in his Quidditch abilities, because she thought he really had taken Felix Felicis and starts going out with Lavender Brown to spite her, and Hermione in response, uses the Oppugno Jinx to have a flock of conjured birds viciously attack him.",
    "section": "Chapter 14: Felix Felicis",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "As Slughorn's Christmas party approaches, Hermione warns Harry that a number of girls, particularly Romilda Vane, plan to slip him a love potion, to get him to invite them. Harry gets around this by going to the party with Luna, while Hermione goes with Cormac McLaggen to get back at Ron (which she regrets very much later). During the party, Malfoy is dragged in, in trouble for lurking in a certain deserted corridor and claiming to be gatecrashing; Slughorn lets him off the hook. Snape, however, takes Malfoy out of the party and into a deserted classroom. Harry follows them both and overhears Snape offering to help Malfoy with his mission, which Malfoy flatly refuses, accusing Snape of trying to interfere and steal his glory.",
    "section": "Chapter 15: The Unbreakable Vow",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "During the Christmas holidays at The Burrow, Harry tells Ron, his father Arthur Weasley and Remus Lupin what he overheard, but they believe that Snape was trying to find out Malfoy's plan so he could tell Dumbledore. Later, Rufus Scrimgeour visits The Burrow, and requests that Harry appear to work alongside the Ministry, to boost the morale of the public. Harry turns it down, knowing that the Ministry is arresting and imprisoning innocent people and remembering how they persecuted him last year.",
    "section": "Chapter 16: A Very Frosty Christmas",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "On their return to Hogwarts, Harry notices Ginny is not enthusiastic about meeting Dean, and tells Hermione about what he heard between Malfoy and Snape, but she also believes Snape was working on Dumbledore's orders. When Harry mentions Fenrir Greyback, a werewolf Lupin had told him about during the holidays and the werewolf that bit him, she recalls Malfoy threatening Borgin with him, and Harry states that this proves Malfoy's a Death Eater. Hermione, however, got past this one, saying that it might have been \"an empty threat.\" In his third lesson with Dumbledore, Harry learns that during his time at Hogwarts, Voldemort had gathered a mixture of friends who became the forerunners of the Death Eaters and researched his family. He first investigated his father, and later assumed the name Lord Voldemort upon discovering his father was a Muggle and never attended Hogwarts. Dumbledore and Harry then go into Morfin Gaunt's memory, where he reveals to his nephew, Voldemort how he was conceived. After hearing this, Voldemort went on to murder his Muggle ancestors, taking revenge on them for abandoning him, eliminating the last of the \"unworthy\" Riddle line, stealing Morfin's father's ring and implanted false memories into Morfin, framing him for the murders. In the next memory, Voldemort asks Slughorn about Horcruxes, which results in Slughorn yelling that he knows nothing about them. Dumbledore is confident that the memory has been tampered with, however, noting patches of grey fog that came up when Slughorn was shouting, and asks Harry to retrieve the true memory. Realising Harry is on to him after a botched attempt from Harry to get the memory, Slughorn starts avoiding him, and Harry instead chooses to focus on investigating Malfoy, using the Marauder's Map, noticing that Malfoy disappears off it at certain times.",
    "section": "Chapter 17: A Sluggish Memory",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry is still doing the Apparition lessons and has no luck of apparating. Here Wilkie Twycross, Ministry of Magic official and Apparition Instructor, tries the sixth year batch to teach Apparition and according to him, one has but to recall '''The Three D's'': Destination, Determination and Deliberation'. One must be completely determined to reach one's destination, and move without haste, but with deliberation.\n\nMarch has arrived and on Ron's seventeenth birthday (first of March) he consumes a number of Chocolate Cauldrons containing a love potion (courtesy of Romilda and intended for Harry). Harry takes him down to Slughorn for an antidote, and the three of them decide to have some of Rosmerta's Mulled Mead, originally meant for Dumbledore. However, Ron drinks it and discovers (too late, of course) that it is poisoned. Thankfully, Harry manages to save him with a Bezoar.",
    "section": "Chapter 18: Birthday Surprises",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Ron reconciles with Hermione and Ginny. Some time afterwards, Hagrid tells Harry that he overheard Dumbledore and Snape arguing, and Cormac McLaggen confronts Harry to ensure he can play in Ron's place in the upcoming Quidditch match. Harry also finds out that Ron has been avoiding Lavender. Later, at the Quidditch match, with Luna commentating, McLaggen grabs a beater's bat to show the beater how to hit the bludgers, and accidentally cracks Harry's skull. Finally, in the hospital wing, Harry summons Kreacher and Dobby and orders them to tail Malfoy.",
    "section": "Chapter 19: Elf Tails",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "In their fourth lesson, Dumbledore is disappointed that Harry failed to obtain Slughorn's true memory. Harry apologises and promises to try harder, which Dumbledore is happier about. Dumbledore shows him two memories: one of Tom Riddle being shown Salazar Slytherin's Locket and Helga Hufflepuff's Cup by a wealthy woman named Hepzibah Smith, the other of Riddle applying for the Defence Against the Dark Arts teaching post at Hogwarts, which Dumbledore rejects as he felt that it was an attempt by Riddle to further search the school for secrets and recruit followers. Dumbledore explains that Smith was murdered by Riddle and stole the locket and cup. The post for Defence Against the Dark Arts was jinxed by Riddle out of spite; teachers never held the post for more than a year, suffering some terrible fate or humiliation which caused them to leave the position.",
    "section": "Chapter 20: Lord Voldemort's Request",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Ron wants to break up with Lavender but doesn't know how. Harry learns from Kreacher and Dobby that Malfoy is regularly visiting the Room of Requirement (which doesn't appear on the Marauder's Map) and spends the next few days trying to get inside. Not knowing what Malfoy is using it for, he has no success. Ron and Hermione come back from the Hogsmeade Apparition test, in which Hermione is successful but not Ron, who will take the exam with Harry again.",
    "section": "Chapter 21: The Unknowable Room",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry again fails to convince Slughorn to share his true memory, and Ron suggests he use the Felix Felicis. Harry takes the Felix Felicis and goes down to Hagrid's hut because Aragog died, and Hagrid wanted Harry to go to the burial. On the way to Hagrid's hut, Harry luckily meets Professor Slughorn on the way and goes with Harry to Hagrid's because he wants to collect Aragog's venom (Acromantula venom is very rare and expensive). Aragog is buried and the adults get drunk, so Harry has a good opportunity to get the memory. As a result of the Felix Felicis, Harry is able to get the memory with ease.",
    "section": "Chapter 22: After the Burial",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "It turns out that in reality, Slughorn told Riddle everything he wanted to know about Horcruxes. He reluctantly explains that Horcruxes are extremely dark objects which a person conceals a piece of soul in, to achieve immortality. Riddle questions Slughorn if it was possible to have multiple Horcruxes, something that horrifies Slughorn. This explains how Voldemort was able to survive his rebounding killing curse. Dumbledore believed that Voldemort made six Horcruxes: his diary (which Harry destroyed four years earlier), the Gaunt's ring (which Dumbledore destroyed the previous year, greatly injuring his hand in the process), he theorises that the other four are important artefacts to Voldemort; the locket, the cup, an object pertaining to Rowena Ravenclaw's and the snake Nagini.",
    "section": "Chapter 23: Horcruxes",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry learns the next day that Ginny and Dean have split up. He is unwilling to ask her out though, fearing Ron's reaction. Meanwhile, a recovered Katie Bell has returned to the school, and Harry asks who gave her the necklace. She states that someone Imperiused her in the girl's bathroom at Rosmerta's Pub in Hogsmeade. Shortly before the final Quidditch match of the year, Harry finds Malfoy crying over how his mission is failing. When he sees Harry, he attacks him. During the ensuing duel, Harry uses a spell written in The Half Blood Prince's book, which badly injures Malfoy. Snape witnesses the event, heals Malfoy, and gives Harry a large number of detentions that cause him to miss the match. Upon returning to the Gryffindor common room after his first detention, he discovers that the team had won the Quidditch Cup in his absence, and Ginny runs up and hugs him. At this point, Harry finally reveals his feelings for Ginny and kisses her. Both of them are ecstatic and start dating.",
    "section": "Chapter 24: Sectumsempra",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Sometime later, Dumbledore asks Harry to come to his office. On the way, he runs into his old Divination teacher Professor Trelawney, who was trying to hide sherry bottles in the Room of Requirement before being thrown out. She tells Harry that she heard a male voice (which Harry suspects to be Malfoy's) whooping before she was ejected and also reveals that Snape had told Voldemort about the prophecy concerning him and Harry, which caused him to murder Harry's parents. Harry expresses outrage that Dumbledore later gave Snape a job at Hogwarts, but Dumbledore states that Snape felt great remorse for what he had done. He then asks Harry to join him in finding a Horcrux, Slytherin's locket, which Harry agrees to. Before leaving, Harry tells Ron and Hermione that Malfoy's almost certainly going to try something tonight and gives them the remainder of the Felix Felicis.",
    "section": "Chapter 25: The Seer Overheard",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Dumbledore and Harry travel to a cave in which Voldemort had tormented two children in his youth. They proceed through the cave, coming to an island in the middle of a lake. On the island, they find a basin of emerald green potion, with the locket at the bottom. On Dumbledore's orders, Harry reluctantly force-feeds him the potion, which badly weakens him and causes extreme thirst. In an attempt to save him, Harry gives him water from the lake, awakening dozens of Inferi Voldemort had placed to guard his Horcrux. Harry attempts to fight, but there are too many of them. Just as he is about to be overwhelmed, Dumbledore creates a ring of fire around them, which fends off the Inferi, and allows them to escape with the locket to Hogsmeade, where they discover the Dark Mark above the astronomy tower at Hogwarts.",
    "section": "Chapter 26: The Cave",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Borrowing broomsticks, the pair fly to the tower. Upon hearing someone approaching them, Dumbledore uses a charm to paralyse Harry and hides him under his Invisibility Cloak, before being disarmed by Malfoy. Malfoy reveals that he had let Death Eaters into the school through a pair of vanishing cabinets, which were the objects Harry had overheard him questioning Borgin about. Malfoy also explains that he was behind the cursed necklace and poisoned mead incidents, which were really assassination attempts on Dumbledore. Dumbledore reveals that he had known Malfoy was attempting to kill him, but allowed him to remain at Hogwarts because he knew that Voldemort would have murdered Malfoy once his cover had been blown. Dumbledore tries to persuade him to change sides, but the other Death Eaters join the scene and urge Malfoy to finish his mission. Then Snape appears, and with Malfoy still reluctant to finish off the unarmed Dumbledore, Snape kills Dumbledore.",
    "section": "Chapter 27: The Lightning-Struck Tower",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Released from the spell after Dumbledore's death, Harry pursues Snape through battle in the halls of the school and out onto the grounds. Near the entrance to Hogwarts, Harry attempts to curse Snape, who repels his attacks with ease and reminds the other Death Eaters they are not to harm the boy. When Harry tries one of the Half-Blood Prince's spells, an enraged Snape reveals that the spell is his own. He is the Half-Blood Prince, having taken the title when he was a student as a pun on his mother's maiden name. (Hermione's research later reveals that Snape's father was a Muggle named Tobias Snape and his mother a pureblood witch named Eileen Prince.) Buckbeak the Hippogriff attacks Snape, who leaves Harry behind and escapes with Draco Malfoy. When he returns to Dumbledore's body, Harry finds that the locket was a fake: the real horcrux was already stolen by someone with the initials R.A.B.",
    "section": "Chapter 28: Flight of the Prince",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "After the battle, Ginny accompanies Harry to the hospital wing, where he learns that the only other person who died was a Death Eater. None of Harry's friends are badly hurt, apart from Bill Weasley, the Weasleys' oldest child who was attacked by an untransformed Greyback, although the only side effects are permanent scars across his face and a liking for rare steaks. Fleur expresses her desire to marry Bill despite his potential transformations, and she and Mrs. Weasley reconcile. Tonks reveals her love for Lupin, who had refused her because he was a werewolf and felt that she deserved someone young and whole, unlike himself. Professor McGonagall questions Harry about what he and Dumbledore were doing, but Harry, under orders from Dumbledore not to tell anyone except Ron and Hermione, refuses. The teachers then discuss the future of Hogwarts, and plans for Dumbledore's funeral. Harry turns his back on the Half-Blood Prince's book, and regrets ever possessing it, although Hermione and Ron comfort him, stating that while the Prince may have had a mean sense of humour, nothing in the book ever indicated that he was evil, or capable of murder.",
    "section": "Chapter 29: The Phoenix Lament",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "The funeral is attended by many witches and wizards, including a number of minor characters in the series. During the funeral, Harry ends his relationship with Ginny to protect her from Voldemort. She reveals that she had never given up on him; Hermione had advised her to go out with other people so she could relax around Harry, as previously she had trouble talking to him. As a result, he fell in love with her upon seeing who she really was and regrets not asking her out sooner. Harry then meets Scrimgeour, who again makes the offer he'd made to Harry at Christmas, which Harry again turns down. He then tells Ron and Hermione of his intention to leave Hogwarts to destroy the Horcruxes and then Voldemort himself. His two best friends agree to travel with him on his quest, and Harry happily acknowledges that there is \"still one last golden day of peace left to enjoy with Ron and Hermione\".",
    "section": "Chapter 30: The White Tomb",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"4\" border=\"2\"\n! width=\"20%\" |Character\n! width=\"20%\" |Killed by\n! width=\"15%\" |Cause of death\n! width=\"25%\" |Circumstances\n|-\n|Amelia Bones\n|Voldemort\n| rowspan=\"3\" |Possibly the Killing Curse\n|Murdered in a room locked from the inside; baffled Muggle police\n|-\n|Emmeline Vance\n| rowspan=\"2\" |Death Eaters\n|Murdered a short distance from the Muggle Prime Minister's office\n|-\n|Igor Karkaroff\n|Body found in a shack \"up north\"; Dark Mark cast overhead\n|-\n|Marvolo Gaunt\n| rowspan=\"4\" |None\n|Natural causes, shock, or starvation\n|Distraught at identity of Merope's Muggle spouse; possibly never learned to cook\n|-\n|Morfin Gaunt\n|Went out of his mind\n|Imprisoned in Azkaban\n|-\n|Merope Gaunt-Riddle\n|Childbirth or depression\n|Voldemort's birth\n|-\n|Aragog\n|Illness\n|Old age\n|-\n|Tom Riddle Snr\n| rowspan=\"4\" |Voldemort\n| rowspan=\"3\" |Killing Curse\n|Revenge for abandonment; baffled Muggle Police\n|-\n|Thomas Riddle\n| rowspan=\"2\" |Murdered along with Tom Riddle, Snr; baffled Muggle Police\n|-\n|Mary Riddle\n|-\n|Hepzibah Smith\n|Poisoned cocoa \"sugar\" or Killing Curse with memory changing\n|Voldemort's search for Hufflepuff's Cup and Slytherin's Locket\n|-\n|Albus Dumbledore\n|Severus Snape\n| rowspan=\"2\" |Killing Curse\n|On his own orders, both to make his death painless and to spare Draco from the influence of Voldemort and the Death Eaters, and possibly to control the next owner of The Elder Wand (although this is unknown to everyone except Snape until the next book)\n|-\n|Gibbon\n|Thorfinn Rowle\n|Hit by a stray Killing Curse\n|}",
    "section": "List of deaths",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "In May, 2005, bookmakers in the UK suspended bets on which main character would die in the book amid fears of insider knowledge. A number of high value bets were made on the death of Albus Dumbledore, many coming from the town of Bungay where, it was believed, the books were being printed at the time. Betting was later reopened. \n\nIn early July, The Real Canadian Superstore, a big-box grocery chain in Coquitlam, British Columbia, Canada, accidentally sold fifteen copies of The Half-Blood Prince before the authorised release date. The Canadian publisher, , obtained an injunction from the Supreme Court of British Columbia prohibiting the purchasers from reading the books before the official release date or of discussing the contents. Purchasers were offered a Harry Potter T-shirt and an autographed copy of the book if they returned their copies before 16 July.\n\nOn 15 July, less than twelve hours before the book went on sale in the Eastern time zone, Raincoast warned '''' newspaper that publishing a review from a Canada-based writer at midnight, as the paper had promised, would be seen as a violation of the anti-reading injunction. The injunction sparked a number of news articles questioning the injunction's restriction on fundamental rights. Canadian law professor ] has posted commentary on his weblog. has posted on his weblog calling for a boycott until the publisher issues an apology. The Globe and Mail published a review from two UK-based writers in its 16 July edition and posted the Canadian writer's review on its website at 9 am that morning. \n\nIn the same week, a Chicago Walgreens mistakenly sold a copy of the book. When the purchaser read about the Canadian incident on the Internet she said she would not turn herself in, but that she would not read the novel until the U.S. release date.",
    "section": "Controversies",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry Potter and the Half-Blood Prince.jpg|British (and Canadian) Children's Edition, published by Bloomsbury (and Raincoast)\nHarry-potter-and-the-half-blood-prince-celebratory-edition.jpg|British Celebratory Edition\nHalf-Blood Special Edition.jpg|British Special Edition\nNormal HBP Signature.jpg|British Signature Edition\nHbp adult bloomsberry.jpg|British (and Canadian) Adult Edition\nHarry Potter and the Half-Blood Prince new adult edition.jpeg|British 2013 Adult Edition\nHalf-Blood Prince new cover.jpg|British 2014 Children's Edition\nHarry potter HBP Scholastic edition.jpg|American, published by Scholastic\nBackcover.jpg|American back cover\nHBPdeluxe.jpg|American Deluxe Edition\nHbp 15 anniversary.jpg|American 15th anniversary edition\nUS 2018 paperback 06 HBP.jpg|American 20th anniversary edition",
    "section": "English-language",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Harry Potter 6 Arabic cover.jpg|Arabic edition\nCzech original 06 HBP.jpg|Czech, Harry Potter a Princ dvojí krve, published by Albatros\n-Files-Images-Bokadeildin-permur-bokarodir-halvblodsprinsmidi.JPG|Faroese, Harry Potter og Hálvblóðsprinsurin, published by Bókadeild Føroya Lærarafelags\n250px-Harrypotter6hebrew.jpg|Hebrew edition\nHbp hun.jpg|Hungarian, Harry Potter és a félvér herceg, published by Animus\nLithuanian original 06 HBP.jpg|Lithuanian, Haris Poteris ir Netikras Princas, published by Alma Litte\n61u37vnh26l- aa1024 .jpg|Brazilian Portuguese, Harry Potter e o Enigma do Príncipe, published by Rocco\nHarry Potter Cover 6 Serbian.jpg|Serbian, Hari Poter i Polukrvni Princ, published by Evro Giunti\nHarry potter in polkrvni princ.jpg|Slovenian first translation, Harry Potter in polkrvni princ\nHarry potter in princ mesane krvi 6.jpg|Slovenian second translation, Harry Potter in princ mešane krvi",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Bosnian 06 HBP.png|Bosnian, Harry Potter i princ poluplave krvi, published by Buybook\nBulgarian 2019 hardback 06 HBP.png|Bulgarian 20th anniversary edition, Хари Потър и Нечистокръвния принц, published by Egmont Bulgaria\nDanish cover vol6.jpg|Danish, Harry Potter og Halvblodsprinsen, published by Gyldendal\nDanish 2012 paperback 06 HBP.jpg|Danish 2012 paperback\nDutch Book 6 cover.jpg|Dutch, Harry Potter en de Halfbloed Prins, published by Standaard and De Harmonie\nDutch Half-Blood Prince book cover.jpeg|Dutch (the Netherlands) 2010 pocket edition, published by Uitgeverij De Harmonie\nFinHBPcover.jpg|Finnish, Harry Potter ja Puoliverinen prinssi, published by Tammi\nFrench Book 6 Cover.jpg|French hardback, Harry Potter et le Prince de Sang-Mêlé, published by Éditions Gallimard\nFrench T6 (2011 new edition).png|French 2011 paperback\nFrench T6 (2016 new edition).jpg|French 2016 edition\nHarry potter und der halbblutprinz.jpg|German, Harry Potter und der Halbblutprinz, published by Carlsen Verlag\nGerman Adult Edition 06 HBP.png|German adult edition (hardback)\nGerman 2013 Pocket 06 HBP.png|German 2013 Anniversary Pocket Edition (paperback)\nGerman 2018 hardback 06 HBP.png|German 20th anniversary edition\nIndonesian 06 HBP 9786020377414.png|Indonesian, Harry Potter dan Pangeran Berdarah Campuran, published by Gramedia Pustaka Utama\nLibro6 high.jpg|Italian, Harry Potter e il Principe mezzosangue, published by Adriano Salani Editore\nItalian 2021 redesign 06 HBP.png|Italian 2021 redesignra\nLithuanian 2020 hardback 06 HBP.png|Lithuanian 20th anniversary edition\nHP6BOX.png|Brazilian Portuguese collector's edition\nRussian 2008 Black Deluxe Edition 06 HBP.png|Russian 2008 Black Deluxe Edition, Гарри Поттер и Принц-Полукровка, published by Росмэн\nSlovak 2020 exclusive box set 06 HBP.png|Slovak 20th anniversary edition, Harry Potter a Polovičný princ, published by IKAR\nHarry-potter-y-el-misterio-del-principe.jpg|Spanish, Harry Potter y el misterio del príncipe, published by Salamandra\nSpanish 15th anniversary 06 HBP.jpg|Spanish 15th anniversary edition\nSwedish 06 HBP.jpg|Swedish, Harry Potter och Halvblodsprinsen, published by Tiden\nThai 2020 hardback 06 HBP.jpg|Thai 20th anniversary edition, แฮร์รี่ พอตเตอร์กับเจ้าชายเลือดผสม, published by Nanmeebooks\nUkrainian 06 HBP.jpg|Ukainian, Гаррі Поттер і Напівкровний Принц, published by А-БА-БА-ГА-ЛА-МА-ГА\n\n}}",
    "section": "Translations (alternative covers)",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "UK House Edition hardback Gryffindor 06 HBP.png\nUK House Edition hardback Hufflepuff 06 HBP.png\nUK House Edition hardback Ravenclaw 06 HBP.png\nUK House Edition hardback Slytherin 06 HBP.png\n\n;Bloomsbury (United Kingdom, Australia, and Canada etc.)\n*ISBN 0747581088 Hardcover\n*ISBN 074758110X Hardcover (adult edition)\n;Raincoast (Canada etc.)\n*ISBN 155192756X Hardcover\n*ISBN 1551927608 Hardcover (adult edition)\n*ISBN 0747581525 Hardcover (large print edition)\n;Scholastic (United States etc.)\n*ISBN 0439784549 US Hardcover\n*ISBN 0439791324 Deluxe Edition\n\nBefore and after the release of the book, the environmental organisations and the urged consumers in the United States who planned to buy Harry Potter and the Half-Blood Prince to do so from the book's Canadian publisher, Raincoast Books , which published on 100% recycled, chlorine-free, ancient forest-free paper. The American edition of the book, published by Scholastic Press, was printed with a percentage of recycled paper that Scholastic declined to make public.",
    "section": "Hogwarts House Edition",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "Various publishers have announced release dates for local translations of the book :\n\n{|\n|- style=\"vertical-align: top;\"\n|\n*Albania: 10 November 2005\n*Belgium: 19 November 2005\n*Braille (English): 19 July 2005\n*Brazil: 26 December, 2005 (by Lia Wyler)\n*Bulgaria: 13 December 2005\n*China: November, 2005\n*Croatia: 15 October 2005\n*Denmark: October, 2005\n*Estonia: November, 2005\n*Finland: 16 March 2006\n*France: 1 October 2005\n*Germany, Switzerland, Turkey and Austria: 1 October 2005\n*Greece: 2 December 2005\n*Hungary: February, 2006\n*Iceland: November, 2005\n*Israel: November, 2005\n*Italy: January, 2006\n*Japan: 17 May 2006\n*Lithuania: 1 October 2005\n*Montenegro: 24 December 2005\n*Netherlands: 19 November 2005\n*Norway: November, 2005\n*Poland: 28 January 2006\n*Portugal: September/October, 2005\n*Romania: 24 December 2005\n*Russia: 1 October 2005\n*Serbia: September, 2005\n*South Africa: 15 November 2005 (Afrikaans translation)\n*Slovenia: December, 2005\n*Spain: 16 March 2006\n*Sweden: 30 November 2005\n*Taiwan: 1 October 2005\n|}",
    "section": "Translations",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "*Along with , this is one of the books in the series where the cover art for the UK and US editions depicts the same subjects. *This, along with Chamber of Secrets, was the only book that did not end in King's Cross. (Chamber of Secrets ends in Platform nine and three quarters and the final sentence is going to King's Cross which does not count because no dialogue was shown in King's Cross). *Before its release, a rumour circulated a chapter was to be entitled, \"Lupin's Papers.\" Rowling responded that this was not the case, \"nor will there be chapters entitled 'Pettigrew's Pamphlets,' 'Sirius' Circulars' (which would make no sense anyway, as the character is dead during this book) or 'The Pocket Crosswords of Severus Snape'.\"\n*Between the release of Half-Blood Prince and Deathly Hallows, fans wondered who \"R.A.B.\" could be; many people believed it to be Regulus Black. J. K. Rowling would not explicitly say it was Regulus, but commented that he was a \"good guess.\" Between the releases of the two books, she would drop hints about R.A.B.'s identity; one such hint was that the final book would introduce no new characters: this led many fans to believe it had to be a character introduced in a previous book. *When Harry is hiding the Half-Blood Prince's book in the Room of Requirement, he opens a cupboard and inside is something in a cage that had long-since died; its skeleton had five legs; this could possibly be the skeleton of a Quintaped. *Many readers believed that Dumbledore was not actually dead, and postulated many theories to explain how his death had been faked. A website was even created entitled \"Dumbledoreisnotdead.com\". J.K. Rowling later stated in an interview that \"Dumbledore is definitely dead.\" This was definitively confirmed in . *In the Simpsons episode \"The Bob Next Door\", Sideshow Bob spoils the book's ending by revealing that Snape killed Dumbledore, to which Bart complains he hadn't gotten to that part yet and Sideshow Bob responds \"It's a four year old book!\". *Also, in the Big Bang Theory episode \"The Spoiler Alert Segmentation\", Sheldon reveals Dumbledore's death to Leonard while he reads it, much to his anger (though the book would have been seven years old at the time). *This is the first book in the series where Harry was right about who the enemy was.",
    "section": "Behind the scenes",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "In ''Philosopher's Stone they thought Snape was after the stone when it was Quirrell; in Chamber of Secrets they thought Malfoy opened the Chamber of Secrets, and that Hagrid opened it the first time, when it was really Riddle on both occasions; in Prisoner of Azkaban, everyone thought Sirius was a mass murderer and follower of Voldemort, when it was really Pettigrew; and in Harry Potter and the Goblet of Fire'', they thought Karkaroff put Harry's name in the Goblet of Fire when it was really Barty Crouch Jnr. *Snape is revealed to be the Half-Blood Prince. This marks the second time someone at Hogwarts is revealed to be a wizard under a different name. The first was Tom Riddle when he was revealed to be Voldemort in Chamber of Secrets. *This also marks the second time Harry Potter and Draco Malfoy duel. *This marks Draco Malfoy's first trip to Diagon Alley, and Knockturn Alley, since Chamber of Secrets (although it is very likely that he visited each year in between, but did not meet Harry there). *The Spanish version, the name is Harry Potter y el Misterio del Príncipe, which means Harry Potter and the Mystery of the Prince. Something similar happens in the second book. *Slughorn called Ron Rupert during Aragog's funeral, ironically, the actor that plays Ron in the films is called Rupert Grint. J.K Rowling may have intentionally done this, as she would obviously be aware that Rupert Grint played Ron Weasley in the film adaptations of the books. *Cheryl Klein served as the title's continuity editor. *The first chapter, \"The Other Minister,\" is a re-purpose of an early draft for the first chapter of the first title, ''Harry Potter and the Philosopher's Stone''. In this draft, Rubeus Hagrid visited Cornelius Fudge, who was the Prime Minister of muggles, to inform him of Voldemort being responsible for a number of disappearances and to ask him to alert the public of certain facts. Fudge fears that Vernon Dursley, his political opponent, will try to take his position, only to learn that Dursley is already aware of the existence of wizards. The chapter ends with Hagrid informing Dursley of Voldemort's disappearance, due to Voldemort's attempt to kill Harry. This draft can be read in Harry Potter: A Journey Through a History of Magic.",
    "section": "Behind the scenes",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "*Although Lord Voldemort (as well as the previous Tom Riddle) appear in numerous memories, he never appears in person. This makes it one of only two books, after the Prisoner of Azkaban, where he does not make an appearance. However, he is still the primary antagonist, unlike the Prisoner of Azkaban where he is almost completely irrelevant to the plot.",
    "section": "Behind the scenes",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "The book was also adapted into a film, the sixth Harry Potter film of the series. The film Harry Potter and the Half-Blood Prince was released on 15 July 2009. It was directed by David Yates and the trio was portrayed by Daniel Radcliffe, Rupert Grint and Emma Watson.",
    "section": "Film adaptation",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "*\n*\n*\n*Harry Potter and the Half-Blood Prince (character index)\n*1996–1997 school year\n*Sixth year",
    "section": "See also",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "#http://www.latimes.com/news/nationworld/nation/la-071805potter_lat,0,4363703.story?coll=la-home-headlines\n#http://web.archive.org/web/20050714043333/http://www.cbc.ca/story/arts/national/2005/07/12/Arts/potterrecycle050712.html\n#http://www.veritaserum.com/books/book6/releasedates.shtml\n#http://news.bbc.co.uk/1/hi/entertainment/arts/4578463.stm\n#http://www.canada.com/vancouver/story.html?id=9badf853-c1c3-4786-bf4f-75a5071e5c07\n#http://michaelgeist.ca/index.php?option=com_content&task=view&id=889\n#http://stallman.org/harry-potter.html http://stallman.org/harry-potter.html http://stallman.org/harry-potter.html\n#http://www.theglobeandmail.com/servlet/story/LAC.20050716.POTTERNOTE16/TPStory.\n# [HP2]'' by J. K. Rowling (1998), UK ISBN 0747538492/US ISBN 0439064864\n# [HP6]Harry Potter and the Half-Blood Prince by J. K. Rowling (2005), UK ISBN 0747581088/US ISBN 0439784549",
    "section": "Notes and references",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  },
  {
    "text": "*\n*Chapter-by-chapter analysis\n*Rowling's responses to various rumours\n*Veritaserum's \"HBP\" section: information and theories\n*Greenpeace's Save Muggle Forests Campaign\n*National Wildlife Federation's Harry Potter and the Half-Blood Prince campaign website\n*Press release on PRNewsWire\n*National Public Radio discusses Braille publication\n*New York Times review\n*Spoiler about character death\n\nde:Harry Potter und der Halbblutprinz\nde2:Harry Potter und der Halbblutprinz\nes:Harry Potter y el misterio del príncipe\nfi:Harry Potter ja puoliverinen prinssi\nit:Harry Potter e il Principe Mezzosangue\nfr:Harry Potter et le Prince de Sang-Mêlé\nja:ハリー・ポッターと謎のプリンス\nnl:Harry Potter en de Halfbloed Prins\npl:Harry Potter i Książę Półkrwi\npt:Harry Potter e o Enigma do Príncipe\nru:Гарри Поттер и Принц-полукровка\ntr:Harry Potter ve Melez Prens\nvi:Harry Potter và Hoàng tử Lai\nzh:哈利·波特与“混血王子”\nno:Harry Potter og Halvblodsprinsen\n6\nCategory:Canon",
    "section": "External links",
    "name": "Half-Blood Prince",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 6,
    "source_book": "Half-Blood Prince"
  }
]