[
  {
    "text": "}}\n\n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Olly Moss (Pottermore eBook)\n*Nicholas Filbert (Indonesia)\n|interior=*Mary GrandPré (US)\n|narrator=*Stephen Fry (UK)\n*Jim Dale (US)\n|publisher=*Bloomsbury (UK, Canada)\n*Scholastic (US)\n*Raincoast Books (Canada (formerly))\n*Salamandra (Mexico)\n*Yapı Kredi Yayınları (Turkey))\n*Penerbit Gramedia Pustaka Utama (Indonesia)\n|release date=21 June 2003\nJanuary 2004 (Indonesia)\n|pages=*800 (UK)\n*870 (US)\n*1001 (SWE)\n*893 (MX)\n*1050 (FIN)\n*990 (RO)\n*1114 (Turkey)\n*1203 (Indonesia)\n|preceded by=\n|followed by=\n}}\n\nHarry Potter and the Order of the Phoenix'' is the fifth book in J. K. Rowling's Harry Potter book series. It was one of the most widely-anticipated books of the series, since there was a wait of three years between it and the previous book, Goblet of Fire. At 38 chapters, it is also the longest book in the series, having jokingly been labelled as heavier than a refrigerator (by Stephen Fry at the Royal Albert Hall event) and used as a benchmark for the size of the next two books.",
    "section": "General",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "\"To Neil, Jessica and David, who make my world magical\"\n\nDr Neil Murray is Jo's husband, Jessica is her daughter, and David is her son.",
    "section": "Dedication",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "\"Harry Potter is in his fifth year at Hogwarts School as the adventures continue. There is a door at the end of a silent corridor. And it's haunting Harry Potter's dreams. Why else would he be waking in the middle of the night, screaming in terror? Harry has a lot on his mind for this, his fifth year at Hogwarts: a Defence Against the Dark Arts teacher with a personality like poisoned honey; a big surprise on the Gryffindor Quidditch team; and the looming terror of the Ordinary Wizarding Level exams. \n\nBut all these things pale next to the growing threat of He-Who-Must-Not-Be-Named, one that neither the magical government nor the authorities at Hogwarts can stop. As the grasp of darkness tightens, Harry must discover the true depth and strength of his friends, the importance of boundless loyalty, and the shocking price of unbearable sacrifice. His fate depends on them all. \n\nThe book that took the world by storm. In his fifth year at Hogwarts, Harry faces challenges at every turn, from the dark threat of He-Who-Must-Not-Be-Named and the unreliability of the government of the magical world to the rise of Ron Weasley as the Keeper of the Gryffindor Quidditch Team. Along the way he learns about the strength of his friends, the fierceness of his enemies, and the meaning of sacrifice.",
    "section": "Book description",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "On the hottest day of summer so far, Harry Potter remains at his house, 4 Privet Drive, living with his Muggle aunt, uncle and cousin and severely cut off from the rest of the wizarding world. The neighbourhood is suffering from an exhausting heat wave. Harry spends the majority of his summer out of the house, going on walks and avoiding his aunt and uncle. He doesn't want them to know why he is so interested in the news that summer. He is constantly rummaging through bins for old newspapers, searching for front-page news about the return of Lord Voldemort in the Daily Prophet. However, nothing unusual is reported, so Harry assumes that the Minister for Magic, Cornelius Fudge, is still as oblivious and in denial of Lord Voldemort's return as he was before.\n\nAfter running into his cousin Dudley Dursley and his street gang on a walk, Harry confronts Dudley after his gang leaves. This turns into an argument where Dudley mocks Harry about Cedric's death, having heard Harry use that name in his sleep. Harry immediately denies it, and when Harry takes out his wand and pretends to curse Dudley with it, a cold chill comes onto the duo and they are then attacked by Dementors. Harry attempts the Patronus Charm three times and is successful on the last try, and is surprised to find Mrs Figg, his old, cat-loving neighbour, storming up the road towards them. Harry tries to hide his wand, but Mrs Figg tells him to keep it out in case more of them show up. This comment makes Harry realise that Mrs Figg knows about the wizarding world. She is furious about Mundungus Fletcher, who was supposed to be watching Harry for the Order of the Phoenix, but had Disapparated from the front of 4 Privet Drive only moments earlier.",
    "section": "Chapter 1: Dudley Demented",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "While angry over the situation, Mrs Figg explains to a surprised Harry she is actually a Squib. The two take a Demented Dudley back to Privet Drive, where Mrs Figg mentions she was sent by Dumbledore to watch over Harry and also kept his visits to her house boring so the Dursleys would not send Harry elsewhere if he were happy. After Mundungus Fletcher shows up, Mrs Figg scolds him for his foolish actions before sending him to inform Dumbledore of this situation so he can act quickly. Just before they part, Harry learns that Dumbledore has been keeping him under observation in order to protect him after what had happened with Voldemort last month. When Aunt Petunia and Uncle Vernon notice Dudley in his sickly state they fawn over him and Harry attempts to slip away, but Dudley speaks and assumes that Harry attacked him with some sort of spell since Muggles cannot see Dementors.\n\nBefore Harry can explain himself, the Ministry of Magic sends Harry a letter telling him that he's been expelled from Hogwarts for underage magic. Before Harry attempts to run away before Ministry officials would come by to destroy his wand, another letter from Arthur Weasley arrives telling Harry that Dumbledore is trying to sort this out and to stay put in his house, not surrender his wand, and not to perform any more magic. As Harry is explaining that the Dementors are responsible, Petunia surprisingly shows she has some knowledge of the Dementors. A second letter from the Ministry arrives stating that Dumbledore has convinced them to set up a hearing on 12 August to decide whether or not to break Harry's wand and Harry is being placed on suspension instead of being expelled.\n\nAfter Harry explains to the Dursleys about the Dementor's abilities, Vernon is ready to throw Harry out, as he has always yearned to do so since receiving Harry, when Petunia receives a Howler. Before she has an opportunity to open the letter, it bursts into flames and a menacing voice says, \"Remember my last, Petunia\". Petunia then immediately convinces her husband to let Harry remain at Privet Drive and tells Harry that he needs to stay in his room. Harry has no idea of what's going on.",
    "section": "Chapter 2: A Peck of Owls",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry immediately writes letters to Sirius, Hermione, and Ron. After four days of being locked in his room, while dealing with his anger from the lack of response, Uncle Vernon, Aunt Petunia, and Dudley leave to attend an award ceremony for the best kept suburban lawn in England (which was a hoax set up by Tonks to lure the Dursleys away from their house) and a number of witches and wizards (auto denominated the \"Advance Guard\") come to rescue Harry from the Dursleys' home. They are members of the Order of the Phoenix, an elite group whose members fight Lord Voldemort and the Death Eaters. Among them were the real Mad-Eye Moody and Remus Lupin, along with some newcomers such as Nymphadora Tonks and Kingsley Shacklebolt. Lupin reveals that their destination is a hidden place that is much safer than The Burrow. Lupin leaves a note for the Dursleys, then the entire group begins a long flight on broomsticks. After flying through the cold night, they land at their destination and Moody gives Harry a piece of parchment that mentions their headquarters, 12 Grimmauld Place.",
    "section": "Chapter 3: The Advance Guard",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "They bring Harry to their headquarters, 12 Grimmauld Place (London). The Weasleys, Hermione Granger, and Harry’s godfather Sirius Black are there. While the Order of the Phoenix are having a meeting, Mrs Weasley takes Harry to the room where Ron and Hermione are before heading back. Harry converses with Hermione and Ron and learns to his ire that Dumbledore was the reason he had no contact from his friends all summer, though Ron and Hermione were uncomfortable with this, knowing how Harry would feel. They comfort Harry by explaining that they haven't been let in on everything that has been going on either since they are too young and have mostly been working on cleaning up the house as no one has lived there for years. Fred and George then appear magically through Apparition, revealing to Harry they passed their test, followed by Ginny walking into the room and tells the twins it is now pointless for them to spy on the meetings any more. The Weasley children reveal that—besides Severus Snape who has joined the Order—Bill and Charlie have also joined. Also that Bill has moved back to England to be closer to the family and has been teaching the former Triwizard champion Fleur Delacour who has also been working at Gringotts in order to improve her English, while Charlie has been given the task of recruiting foreign wizards to their cause.\n\nAs for Percy, the Weasley children sadly reveal he has deserted their family after he and Arthur had a fight over Percy's recent promotion to Cornelius Fudge's Junior Assistant. Having denied his father's claims that Fudge is using him, with his unwavering loyalty to the Ministry, Percy has moved away, breaking off contact in the process, even after a depressed Molly Weasley tried to straighten things out. Harry also learns that the Ministry has been using the Daily Prophet to build on what Rita Skeeter started and is portraying Harry as some \"attention-seeking liar\". Hermione also reveals there have been no articles on the Dementor attack or Harry's hearing, since the Ministry is likely waiting until the hearing is over before reporting on the likelihood of Harry being expelled. After being called down for dinner, Tonks accidentally trips on an umbrella stand, which causes too much noise, and the portrait of a woman responds with strong cursing. While helping on closing the curtains, Sirius shows up and reveals the woman in the portrait is his mother.",
    "section": "Chapter 4: Number Twelve Grimmauld Place",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Sirius explains to Harry that Number 12, Grimmauld Place is the Black family's ancestral home and that he inherited it upon his mother's death. While they are setting up for dinner, Sirius reveals that compared to Harry, he has been confined in the house for a month since he is still a wanted criminal and that Voldemort and the Death Eaters would know he is an Animagus by now due to Wormtail informing them, which makes him almost useless to the Order. Fred and George almost stab Sirius' hand when they send a cauldron of stew, an iron flagon of butterbeer and a breadboard with a knife to the table and the knife slips off, which infuriates their parents, as they have been using their magic irresponsibly ever since they came of age. They then have dinner, and numerous conversations go around, with Bill mentioning to his father and Lupin that the goblins won't join their side due to what happened with Ludo Bagman, and Mundungus Fletcher mentioning his business dealings before Molly asks him to stop. After dinner, Sirius tries to tell Harry about the latest events and about their plans, but Molly keeps saying that Harry is too young and that Dumbledore told them not to tell Harry \"more than he needs to know\". After the two argue about it, Molly reluctantly allows Harry and everyone else but Ginny to stay and listen.\n\nHarry learns that Voldemort is keeping a low profile and is building an army. Though Harry managed to escape during Voldemort's rebirth, allowing Dumbledore to reactivate the Order of the Phoenix, it is difficult for them to convince as many people what has happened because of the Ministry and Fudge's position, since Fudge believes that Dumbledore is after his job; his fears make it easier for him to believe that, rather than admit Voldemort is back, which would end the last fourteen years of peace. Another reason the Order is having trouble with finding allies is the issue of their credibility. Sirius is a wanted murderer, Lupin is a werewolf, and the members that work for the Ministry would lose their jobs since Fudge is willing to sack anyone just for disagreeing with him. Fudge has also been trying to discredit Dumbledore's reputation to prevent him from spreading the information, and is having the Daily Prophet cover up any news related to this. Sirius attempts to mention that Voldemort is trying to retrieve a \"weapon...something he didn't have last time\", before Molly and Lupin ask him to stop, and they then send the kids off to bed.",
    "section": "Chapter 5: The Order of the Phoenix",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "After Harry and Ron head into their room, Fred and George Apparate inside, where the four briefly discuss their speculation on what Voldemort might be seeking before their mother's footsteps convince the twins they have to get back to their own room. The next day while helping with the cleaning of the house with Mrs Weasley and the other children, Harry talks in secret with Fred and George and learns their joke shop plans are booming thanks to the money he gave them though they haven't got premises yet and their mother remains unaware of it due to the fact she had cancelled their subscription to the Daily Prophet out of disgust. While Molly is busy arguing with Mundungus Fletcher in another room, Harry meets Kreacher, the domestic-elf of the House of Black. He is always cursing and muttering bad words, on occasion calling Hermione a mudblood and then insulting Sirius for betraying his mother's trust after Sirius arrives before Kreacher heads to another room. Harry notices an old tapestry, that Sirius sarcastically explains is the family tree of the \"Noble and Most Ancient House of Black\". Sirius reveals that he was disowned by his family at the age of sixteen and lived with Harry's father James and his parents before his uncle, who was disowned as well, left Sirius some money to live on his own.\n\nSirius mentions to Harry that his younger brother Regulus Black, who was more obedient to their parents' wishes, had been a Death Eater. Sirius explains that his family was all for the purification of the wizarding race, getting rid of Muggle-borns and having pure-bloods in charge, and while not all of them were Death Eaters, they agreed with Voldemort's ideals. Sirius mentions that his brother was killed, presumably for attempting to abandon the Death Eaters. After Molly calls them down for lunch, Harry stays with Sirius and Sirius explains more about his family. Harry is then surprised to learn that Sirius is related to the Malfoys through Lucius's wife Narcissa. He also learns that Tonks' mother Andromeda is Sirius's cousin, and that she was also disowned. Both she and Narcissa had a sister, Bellatrix, who was sent to Azkaban. She is the woman Harry saw in Dumbledore's Pensieve during Barty Crouch Jnr's trial.\n\nSirius then mentions his parents' home is only being used as the Order of the Phoenix's headquarters due to the protective enchantments his father put on it years ago and the additional security measures that Dumbledore set up, which is why he had to put up with moving back in. After several more days of cleaning, on the night before Harry's hearing, Molly mentions that Arthur will be escorting him to the Ministry on his way to work.",
    "section": "Chapter 6: The Noble and Most Ancient House of Black",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The next day, Harry heads down to breakfast and learns that Amelia Bones will be in charge of his hearing, and Tonks assures him that she is fair. Sirius reminds Harry not to lose his temper during the hearing. Harry is nervous over the possibility of being expelled from Hogwarts, but Lupin assures Harry that underage wizards are allowed to use magic in life-threatening situations. Arthur Weasley then escorts Harry to the Ministry for his disciplinary hearing using the train in the London Underground to get there (since Harry can't Apparate). They access the Ministry through a dilapidated telephone booth. In the Atrium, Harry sees a fountain with statues of wizards, witches and magical creatures and several fireplaces where workers Apparate and Disapparate. After spending time on the lift getting to the Department of Magical Law Enforcement and then putting on an act with Kingsley about Sirius Black (due to the need to keep their affiliation secret), they arrive in Mr Weasley's office. Mr Weasley's co-worker, Perkins, runs in announcing that the hearing's time and location has been changed, and Harry is already late. The new location is in old Courtroom Ten in the Ministry's basement. Since the lift does not descend that far, Harry and Mr Weasley race down the stairs the rest of the way after getting off. Just outside the courtroom, Mr Weasley stops, telling Harry that he must face the hearing alone.",
    "section": "Chapter 7: The Ministry of Magic",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry recognises the courtroom is the same one he saw in Dumbledore's Pensieve during his last school year. Cornelius Fudge is acting as the head of the Wizengamot, and Harry is also surprised to see Percy Weasley acting as scribe, although Percy refuses to look at Harry. After Dumbledore arrives, Fudge starts the trial without giving Harry a chance to defend himself. Once Harry gets the chance to explain about the Dementors, Fudge labels his statement a convenient lie, but Dumbledore is able to produce a reliable witness: Mrs Figg, whom Percy brings in. Mrs Figg is able to describe the attack and confirms that the Dementors attacked Harry and Dudley.\n\nWhen Fudge points out the unlikelihood of Dementors in Little Whinging, Dumbledore suggests that someone within the Ministry ordered them there. Fudge, however, refuses to accept any of this as evidence and while Dumbledore reminds him that magic can be used in these extraordinary circumstances. Fudge dismisses this, given Harry's past issues, reminding them of the illegal use of a Hover Charm three years ago. While this was Dobby's fault, Fudge refuses Dumbledore's suggestion to bring him in and also brings up the fact that Harry inflated his aunt a year later, even though no charges were pressed.\n\nFudge also tries to bring up Harry's rule-breaking at Hogwarts, but Dumbledore reminds Fudge that the Ministry does not have the authority to punish students for what they do at school. He points out the irregularity of the hastiness for this trial and attempt to destroy Harry's wand without successfully proving these charges, and also the use of the full Wizengamot for a simple case of under-age magic. When the Wizengamot takes a vote, Harry is cleared of all charges with more than half of the Wizengamot raising their hands to clear him, though Fudge is slightly angry when he casts the verdict. Dumbledore leaves before Harry can thank him.",
    "section": "Chapter 8: The Hearing",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry is puzzled by Dumbledore's actions before he leaves the courtroom and tells Mr Weasley, who was waiting outside, that he had been cleared of all charges. Mr Weasley is surprised that Harry was tried before the entire Wizengamot, as they are also leaving the courtroom, with some showing them recognition, while others, like Fudge and Percy, completely ignore them. Arthur decides to take Harry back to Grimmauld Place before he heads out on an assignment. On their way they see Fudge meeting with Lucius Malfoy. While Harry believes that Fudge may have been put under the Imperius Curse, Mr Weasley states that Dumbledore has doubted this, believing Fudge is acting of his own accord. Back at Grimmauld Place, everybody celebrates Harry's acquittal.\n\nA few days later, on the last day of the holidays, the children receive their Hogwarts letters and Ron and Hermione are named prefects. Molly Weasley is so pleased with Ron's appointment as a prefect that she agrees to Ron's request to get a new broomstick (though an inexpensive one) when she goes to Diagon Alley to pick up their new books. Harry feels some resentment that Ron was chosen over him as prefect, given all he has done at Hogwarts over the years. Later that night, Mrs Weasley prepares a dinner party for the new prefects. During the party, Harry feels better when he learns from Sirius that he and Harry's father James were not made prefects either during their fifth year at Hogwarts, since Lupin was selected for that position instead.\n\nAfter the party, Mrs Weasley goes upstairs to get rid of the Boggart Alastor Moody identified for her earlier. Moody shows Harry an old photograph of the original Order of the Phoenix and identifies the people in the photograph, though hearing Moody describe the terrible fates of some of the members in the photograph makes Harry feel uncomfortable. After going upstairs, Harry finds that the sight of her worst fears (all her family members and Harry dead) was too much for Mrs Weasley; she started to cry before Lupin gets rid of the Boggart after arriving upstairs with Sirius and Moody. As they help calm her down, Mrs Weasley wonders about the future of her loved ones.",
    "section": "Chapter 9: The Woes of Mrs Weasley",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "On the day of departure to Platform Nine and Three-Quarters, the group is rushing to get ready as the children will be taken there under guard per Moody's recommendation. Mrs Weasley is angry with Fred and George for bewitching their trunks instead of trying to carry them downstairs and knocking Ginny off-balance. Harry is assigned to go with Molly and Tonks. Sirius accompanies them in his Animagus form. After the Hogwarts Express departs, with Ron and Hermione having to go to the prefects' carriage, Harry shares a compartment with Ginny, Neville Longbottom, and a girl from Ginny's year named Luna Lovegood, who is a Ravenclaw student. Later Ron and Hermione show up and tell them who the new prefects are for the other houses, including Draco Malfoy and Pansy Parkinson for Slytherin. Luna is reading a tabloid magazine called The Quibbler, of which, she tells them, her father is the editor, after Hermione makes an insensitive comment towards the magazine.\n\nDraco and his cronies then show up briefly and Draco makes fun of the fact that Ron was chosen over Harry for the position of prefect and his comment \"dogging around\" causes Harry to worry that Draco might know now that Sirius is an Animagus. After arriving at Hogsmeade station Harry notices that instead of Hagrid, Professor Grubbly-Plank, who previously substituted for Hagrid during their last school year, is there to direct the first years to their boats. When boarding their carriage Harry notices that the carriages are being pulled by some sort of winged horses. He points them out to Ron and Hermione, but they cannot see them, and act worried when he insists that they are right there. Luna says that she can see them, and in fact could see them ever since she first came to Hogwarts. Harry is mystified, since he couldn't see them when he first came, but he can see them now.",
    "section": "Chapter 10: Luna Lovegood",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The group arrives at the school, but not before Harry wonders about the winged horses, as well as Hagrid's whereabouts. Ron gets into an argument with Luna over Hagrid's disappearance. At the Start-of-Term Feast, the Sorting Hat gives a warning in its new song. After their meal, the students are surprised to hear that Dolores Umbridge, Senior Undersecretary to the Minister (who had been present at Harry's hearing) is the new Defence Against the Dark Arts teacher (besides the announcement that Grubbly-Plank is once again taking over Hagrid's teaching duties). Umbridge rudely interrupts Dumbledore's start-of-term notices and gives a speech which easily dulls the audience and Hermione realises through the hidden messages within the speech that the Ministry intends to meddle at Hogwarts. After the feast, Harry goes to Gryffindor Tower with Neville (who knew the new password) and when he goes to his dormitory, learns that not everyone believes that Voldemort is back. He argues with Seamus Finnigan and insults Seamus's mother for believing in the Daily Prophet, before Ron arrives and breaks it up. Afterwards, Dean Thomas reveals his mother doesn't get the Prophet since she's a Muggle, while Neville reveals that he and his grandmother cancelled their subscription since they support Harry and Dumbledore. Before going to sleep, Harry wonders how many fights he will have to have before people realise that Voldemort is truly back.",
    "section": "Chapter 11: The Sorting Hat's New Song",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The next morning the trio meet in the common room and, after taking down one of Fred and George's advertising posters, Hermione learns of the argument with Seamus and reveals that she was having the same problem with Lavender Brown about whether Harry was telling the truth about Voldemort's return. That morning at breakfast, Harry learns from Angelina Johnson that she has replaced Oliver Wood as the captain for their Quidditch team and will be holding tryouts on Friday to recruit a new player to fill Oliver's old position as Keeper. Harry reveals that he has cancelled his subscription to the Daily Prophet out of disgust. The trio then meet with Fred and George and Hermione insists they cannot advertise to test their joke products on students. The twins bring up the fact that this year is important for the three of them since they will be taking their O.W.L.s. When the twins reveal they weren't sure if they wanted to attend their seventh year for their N.E.W.T.s, George almost lets it slip on why they don't need to take them, though they and Harry cover this up as the twins leave.\n\nRon then remembers that besides their O.W.L.s, they will also have Career Advice sessions to help determine what classes they'll need to take next year for their N.E.W.T.s on what career they'll pursue. After going through most of their classes and getting a lot of homework, as well as Harry briefly meeting up with Cho Chang, they head to their first Defence Against the Dark Arts lesson. There they discover that Umbridge refuses to teach real defence methods and that they will not be performing any spells, only learning Ministry-approved theory (learning in a \"risk-free way\"). When various students start raising questions regarding this, Umbridge immediately contradicts them and also criticises the teachings of their previous two teachers, including identifying Lupin as a \"dangerous half-breed\".\n\nHarry disagrees with Umbridge about Voldemort, costing Gryffindor house points and getting him a detention. Harry then has an outburst after she rebuts his attempts to convince her that this is not a lie and sends Harry to McGonagall's office with a note. Upon learning what happened, McGonagall urges Harry to keep his temper under control because he could end up in even worse trouble due to Umbridge's position. McGonagall then reveals the note Umbridge sent to her states that Umbridge has assigned him detention for a week.",
    "section": "Chapter 12: Professor Umbridge",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Word quickly spreads amongst the students about Harry's behaviour in Umbridge's class that night at dinner, creating more snide remarks. After they leave the Great Hall, Hermione explains to an irritated Harry that despite Dumbledore's speech at the end of the last school term about Voldemort's return, the Ministry's interference over the last two months prevented the truth from sinking in. When they return to their common room, the trio talk about Umbridge and her class. Hermione points out Umbridge was obviously sent by Fudge as a spy. When the other students return from dinner, Hermione catches Fred and George once again testing their joke products on first year students. Though Fred and George mean no harm, as they tested their products on themselves first, Hermione threatens to write to their mother if they continue to test them on first years. Hermione then goes to bed and also mentions the woolly hats she brought are for the house-elves, confirming she is still doing her S.P.E.W. work.\n\nThe next day, teachers brief their fifth year students about their upcoming Ordinary Wizarding Level exams and give them a lot of homework. Hagrid is still missing, and his class is taken over by Professor Grubbly-Plank. During Care of Magical Creatures, Harry has difficulty keeping his temper under control when he hears Draco Malfoy make some rude comments about Hagrid, including that it is likely that Hagrid will be sacked even if he did return to Hogwarts based on what his father told him. Once he returns to Hogwarts Castle, Angelina Johnson mentions to Harry that she is unhappy that Harry's detention on Friday will prevent from attending the tryouts for their Quidditch team, as she wanted the whole team to be there.\n\nDue to Harry's telling the truth about Lord Voldemort's return in Professor Umbridge's first Defence Against the Dark Arts lesson, she gives him detention every day for a week. Umbridge refuses Harry's suggestion to modify the punishment so he could attend Quidditch tryouts on Friday, believing it is the most effective punishment to make him miss out on something he likes. She makes him write out \"I must not tell lies\" many times in his own blood, though Harry makes sure to keep his temper under control to avoid another outburst in front of Umbridge. With Umbridge's detentions and his busy schedule, Harry has difficulty with keeping up on his homework. Ron is busy with something, causing him to also fall behind in his homework. He later mentions to Harry that he wants to try out for the Quidditch team now that he has a decent broom. Ron becomes concerned when he learns about Harry's detentions, but Harry refuses to go to McGonagall or Dumbledore, knowing there is nothing they can do.\n\nAfter Harry's final detention on Friday, he learns that Ron was chosen as their team's new Keeper. Angelina Johnson also apologises for the cold way she criticised Harry earlier, due to the pressure of having to lead their Quidditch team. He then meets with Hermione who is exhausted after making more hats for the house-elves. When Harry mentions his scar recently hurting again, he refuses her advice to see Dumbledore. Harry decides to immediately write to Sirius, but Hermione talks him out of it by pointing out the chances his letter could be intercepted.",
    "section": "Chapter 13: Detention with Dolores",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "On Saturday morning, despite Hermione's warning, Harry decides to write a letter to Sirius. Harry writes about his detention and asks about Hagrid's whereabouts, though he carefully codes the words and phrases in case the letter is intercepted. After sending Hedwig with the letter, Harry notices the same mysterious winged horses he saw before outside. Cho Chang arrives and praises Harry for standing up to Umbridge in her class, before Argus Filch arrives. He claims that he heard from a source that Harry was sending an order for Dungbombs, but Harry states that he already sent his letter, which Cho confirms. After Harry arrives at breakfast, Hermione reads through the Daily Prophet. She discovers that the Ministry has received a tip that Sirius Black is hiding in London. Harry worries that Lucius Malfoy may be the source, as he may have recognised Sirius in his Animagus form at King's Cross Station. Harry also notices an article saying that Sturgis Podmore, secretly a member of the Order of the Phoenix, has been arrested for breaking into a top secret room at the Ministry. This causes some concern, as Harry recalls that Podmore did not show up for guard duty on the day they left for Platform Nine and Three-Quarters. Harry then helps Ron practise before their actual Quidditch training session begins. During the training session, Draco and his gang are there to insult the members of the Gryffindor team, and a nervous Ron isn't able to play at his best. When an accident Ron caused injures Katie Bell's nose, which Fred unintentionally makes worse, Katie has to be taken to the Hospital Wing. The remainder of the training session is then called off. After he and Harry spend the next day trying to catch up on homework, on Sunday evening, Ron receives a letter from Percy. His brother congratulates him on becoming a prefect and urges him to stop associating with Harry, who he feels is a bad influence, as well as believing that his family would one day realise their mistake for believing Dumbledore and apologise to him. He also mentions an important article is being released in the Daily Prophet tomorrow. Ron finds the letter extremely offensive, tears it up and throws it into the fire.",
    "section": "Chapter 14: Percy and Padfoot",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "After reading the letter, Harry thought he had never felt more like his godfather Sirius Black, whom the wizarding world at large still considered a mass murderer. Hermione then agrees to help Harry and Ron catch up on their homework. After midnight, they and Crookshanks are the only ones left in the Common Room. Sirius contacts them through the Floo Network, as he wishes to respond to Harry's letter this way in case his response was intercepted and the code was broken. After talking about Harry's scar, Sirius mentions that while Umbridge is no Death Eater, she possesses a strong racial hatred for half-breeds. Sirius reveals she is the reason why Lupin cannot find a job due to anti-werewolf legislation she proposed in the Ministry. Once the trio mentions Umbridge's classes only allow defensive theory and textbook reading, Sirius explains based on their information, Fudge does not want them trained in combat. Fudge believes Dumbledore intends to use the Defence Against the Dark Arts class to raise the students as an army to take on the Ministry, and wants to prevent this possibility with the new curriculum. Sirius knows that with Fudge's growing paranoia, it is only a matter of time before he finds an excuse to arrest Dumbledore. Sirius then asks Harry not to worry about Hagrid. Sirius reveals while Olympe Maxime mentioned in her message they got separated on the way home, he knows Hagrid's tough and asks Harry not to raise too many questions about Hagrid, or they will attract the Ministry's attention. When Sirius suggests about meeting them in disguise at their next Hogsmeade trip, Harry advises him not to, given the Daily Prophet article and that Draco might recognise him if Sirius were to show up. Sirius then leaves, but mentions he will send a letter when he feels it is safe to communicate by the Floo Network again.",
    "section": "Chapter 14: Percy and Padfoot",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "It becomes clear Umbridge is really there to spy on and take control of the school, and is soon appointed High Inquisitor, arbitrarily imposing rules and regulations (known as \"Educational Decrees\"). She also harbours racial hatred for \"half-breeds\", such as centaurs, werewolves, merpeople and similar creatures. Umbridge starts to observe the professors in class, where she apparently intends to evaluate all teachers.\n\nDuring lunch, Fred, George, and Lee Jordan discuss Ordinary Wizarding Level grades with Hermione and how Flitwick treated Umbridge like a guest while she inspected their class. In Divination, Harry finds Umbridge inspecting Trelawney, who is nervous while being done so. Umbridge demands that Trelawney make a prediction and is unimpressed with the result. In Defence Against the Dark Arts, Umbridge claims Quirinus Quirrell would've been the only D.A.D.A. teacher to pass a Ministry inspection, which Harry retorts saying that Quirrell had Voldemort on the back of his head, resulting in Umbridge giving him another week's worth of detentions.\n\nAngelina Johnson berates Harry for earning himself another week of detentions and Minerva McGonagall penalises Harry five house points for not heeding her warning about Umbridge. Later, in Transfiguration, McGonagall ignores Umbridge throughout the class' inspection and expresses her obvious disdain toward her when being questioned. Umbridge, however, is delighted and impressed with Wilhelmina Grubbly-Plank's teaching of Care of Magical Creatures. Harry loses his temper when Draco Malfoy mentions being injured by a Hippogriff during Rubeus Hagrid's class, earning himself another night of detention with Umbridge.\n\nAfter Harry's final detention, Hermione convinces Harry to secretly teach students Defence Against the Dark Arts based on all his past accomplishments, including escaping Voldemort. Though at first reluctant, Harry finally considers the proposition.",
    "section": "Chapter 15: The Hogwarts High Inquisitor",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The trio hold a meeting at the Hog's Head to discuss with other students the possibility of Harry giving them Defence lessons. Harry is stunned at how many there are: Neville, Dean, Lavender, Parvati and Padma Patil, Cho and her friend whom Harry does not recognise, Luna Lovegood, Katie Bell, Alicia Spinnet, Angelina Johnson, Colin and Dennis Creevey, Ernie Macmillan, Justin Finch-Fletchley, Hannah Abbott, Susan Bones, Anthony Goldstein, Michael Corner, Terry Boot, Ginny, a Hufflepuff Quidditch team member (later identified as Zacharias Smith), Fred and George, and Lee Jordan. Harry has only agreed to teach defensive magic. At the end of the meeting, Hermione has everyone sign a piece of parchment, which is an agreement to keep the group secret.",
    "section": "Chapter 16: In The Hog's Head",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "After hearing about the defensive magic organisation, Dolores Umbridge uses her power as Hogwarts High Inquisitor to pass the Educational Decree, which immediately disbands all existing clubs, teams, societies and groups and forbids further groups (defined as 'the regular meeting of three or more students') without the High Inquisitor's consent. Any student found to be in noncompliance of the Decree is to be expelled immediately. Harry worries that someone from the Hog's Head group might have betrayed them, but Hermione informs him that she enchanted the parchment they all signed to inform her if someone did. Harry also learns from Angelina that the Quidditch teams have also been disbanded under the new decree (although Umbridge unsurprisingly immediately gives the Slytherin team permission to reform) and asks Harry to promise her not to provoke Umbridge again out of fear she might not reinstate the Gryffindor team.\n\nDuring History of Magic, Hedwig turns up and appears injured while delivering a letter from Sirius. Harry leaves the class to have Grubbly-Plank tend to her while Professor McGonagall warns Harry that the Floo Network and Owl Postal Service are being closely monitored at Hogwarts. Before Potions, Draco Malfoy makes fun of people who go to St Mungo's Hospital for Magical Maladies and Injuries, which leads to Neville Longbottom trying to attack him, but is held back by Harry and Ron. During the class, Umbridge inspects Snape, which Harry becomes so interested in watching, that he gets extra homework on writing an essay on Strengthening Solution after messing up his potion. In Divination, Harry learns that Trelawney has been put on probation, based on her temperamental mood after getting the results of her inspection from Umbridge.\n\nThat night, in the Gryffindor common room, the trio chat with Sirius through the Floo Network, who finds out about the defence organisation, agrees it's an excellent idea, and encourages them to continue on with it. Their reunion is cut off when Sirius disappears from the fire and Umbridge's hand appears in the flames, groping to catch hold of Sirius.",
    "section": "Chapter 17: Educational Decree Number Twenty-Four",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Hermione becomes certain that Umbridge has been reading Harry's mail and had injured Hedwig. After classes, Angelina receives news that the Gryffindor Quidditch team has been given permission to continue playing. During the night, Dobby the house-elf returns Hedwig to Harry and suggests he use the Room of Requirement for secret defence meetings. Despite the prohibition, they name their clandestine group \"Dumbledore's Army\", or the D.A. for short, to mock the Ministry of Magic, which fears Dumbledore is creating a secret wizard army. Harry starts them off slowly, practising the Disarming Charm.",
    "section": "Chapter 18: Dumbledore's Army",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The class progresses at a fair rate, practising the Impediment Jinx, the Reductor Curse, and the Stunning Spell. For the safety of the group, Hermione bewitches some coins with a Protean Charm, one for each member of the D.A. When activated by Harry, the numbers on each coin change to inform the bearer of the time and date of the next meeting. \n\nThe Gryffindor Quidditch team begin their season with a victory against Slytherin, despite the fact that Ron was very nervous and didn't play well, and the Slytherins composed a song mocking his performance. Shortly after the match, Draco Malfoy insults and provokes Fred, George and Harry. Harry and George attack him, but all three have their broomsticks confiscated and are given lifetime bans by Umbridge. That night, they discover that Hagrid has returned.",
    "section": "Chapter 19: The Lion and the Serpent",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The trio goes to visit Hagrid in his cabin. They are shocked to find Hagrid dishevelled and badly injured, regularly applying a piece of dragon meat over some of his wounds to alleviate his pain. Hagrid, however, gives evasive answers when they ask what happened to him. When Ron asks if his injuries are related to giants, Hagrid explains he was in an expedition with Olympe Maxime to the last giant colony in the world, located in an isolated location in Eastern Europe, where they tried to recruit the powerful giants to Dumbledore's side. \n\nHagrid recounts that, although they were initially successful, managing to impress Karkus, the giant Gurg (leader of the tribe), luck suddenly turned against them when Karkus was murdered by another giant, Golgomath, who became the new Gurg and was allied with Death Eaters. Hagrid and Maxime then almost managed to recruit some dissident giants exiled from Golgomath's rule in nearby caves, but this group was attacked as well, so they had to finally give up, thus their mission to convince the giants to help the Order was ultimately unsuccessful.\n\nWhen Hagrid mentions that they will be studying an interesting creature in Care of Magical Creatures without naming it, the trio tries to discourage him from bringing dangerous creatures to his classes, fearing that Umbridge will sack him, but Hagrid guarantees that the creature they are going to see is harmless.",
    "section": "Chapter 20: Hagrid's Tale",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Hagrid returns to his class, and he is observed by Umbridge while teaching about Thestrals, which Harry recognises as the same winged skeletal horses he saw pulling the carriages, and which Hagrid explains can only be seen by those who have witnessed death. As Harry, Fred, and George are banned from Quidditch by Umbridge, Ginny Weasley replaces Harry as Gryffindor's Seeker, while Andrew Kirke and Jack Sloper replace Fred and George as Beaters. Dumbledore's Army meet again to review practising the Impediment Jinx and Stunning Spell before the Christmas holidays, and Harry and Cho share a kiss with each other under the mistletoe.\n\nOne night, Harry dreams that he is a snake attacking Ron's father, which actually occurred. He awakens in a panic and tells others, who indeed find Mr Weasley at the Ministry, suffering from severe venomous snake bites.",
    "section": "Chapter 21: The Eye of the Snake",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Arriving at Dumbledore's office with Ron and McGonagall, Harry tells the headmaster (with the latter barely looking at him) about the attack. Dumbledore calls for several portraits of old headmasters and headmistresses of Hogwarts to raise the alarm. Critically injured, Arthur is taken to St Mungo's. Dumbledore then sends Harry, Ron, Fred, George, and Ginny to 12 Grimmauld Place via Portkey. Mr Weasley survives the attack, and the Weasleys and Harry agree to stay at Grimmauld Place for the holidays. Harry tells Sirius about his vision being the snake, but Sirius tells him not to worry.\n\nHarry and the Weasleys, along with Mad-Eye and Tonks, go to visit Mr Weasley at St Mungo's, who is required to take a Blood-Replenishing Potion at regular intervals. He shares the ward with a man who had been bitten by a werewolf and a woman with a massive chunk out of her leg who refused to tell the Healers what had bitten her, arousing suspicions she had been handling something illegal. While the kids are outside the ward, they overhear Mad-Eye on the Extendable Ears suspecting that Harry could be possessed by Voldemort.",
    "section": "Chapter 22: St Mungo's Hospital for Magical Maladies and Injuries",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Fearing Voldemort is possessing him, Harry speculates this to be why Dumbledore is ignoring him and decides to seclude himself from the others for their safety. Hermione joins Harry and the Weasleys at Grimmauld Place for Christmas, and admonishes Harry for his behaviour. Ginny comforts Harry by pointing out she has been possessed by Voldemort, knows how it feels, and doesn't say Harry is being possessed. Relieved, Harry joins in the festivities. \n\nPercy sends back his Weasley jumper, which makes his mother very sad. Hermione, Ron and Ginny Weasley discover that Neville Longbottom's parents are insane and living at St Mungo's Hospital for Magical Maladies and Injuries. They also see their former Defence Against the Dark Arts professor Gilderoy Lockhart. Harry finally says that he knew what happened to Neville's parents.",
    "section": "Chapter 23: Christmas on the Closed Ward",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "After the holidays, Harry and the Weasleys return to Hogwarts on the Knight Bus. In response to Arthur Weasley's attack, Dumbledore has Snape teach Harry Occlumency to block his mind from intrusion. During the class, Harry sees the dark corridor in the Department of Mysteries that he often dreams about.\n\nthumb|left|Harry and Cho dating at Madam \nPuddifoot's",
    "section": "Chapter 24: Occlumency",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "A mass breakout from Azkaban occurs, Broderick Bode dies from a thicket of Devil's Snare while recovering in St Mungo's, and Hagrid is put on probation. Umbridge bans teachers from giving students information unrelating to their subjects. Harry goes out on a date with Cho Chang to Madam Puddifoot's Tea Shop, which goes nightmarishly wrong when Harry mentions (in a way that leads to a misunderstanding) that he has to meet up with Hermione, leading Cho to become jealous, cry, and leaving the shop. At the Three Broomsticks Inn, he see that Hermione blackmails journalist (and unregistered Animagus) Rita Skeeter into writing a favourable article about Harry witnessing Voldemort's return. Luna Lovegood arranges with her father to publish the story in his paper, The Quibbler.",
    "section": "Chapter 25: The Beetle at Bay",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Hermione gives Harry advice on his love life after he recounts his date with Cho. Harry has disturbing dreams about running down a hallway and attempting to open a door in the Ministry of Magic's Department of Mysteries, but being unable to do so. The article containing Harry's interview about Voldemort's return is published in The Quibbler. Furious, Umbridge bans the tabloid from the school and strips Harry of his Hogsmeade visitation rights, but the story spreads rapidly, gathering support for Harry. Many in the wizarding community also now begin to believe Harry. Harry has another dream where he is Voldemort discussing Broderick Bode's death with Augustus Rookwood on how and why Bode couldn't retrieve something Voldemort wanted and plans to punish Avery II for his failure in the plan. In one of Harry's Occlumency lessons, he briefly enters Snape's mind using a Shield Charm, but still makes very little progress. Umbridge sacks Trelawney for her inept performance during Umbridge's inspections. Although Dumbledore is unable to prevent Trelawney's dismissal, he invokes his authority to allow her to remain in the castle and appoints a new Divination teacher - a centaur, Firenze, much to Umbridge's disgust, due to her hatred for half-breeds.",
    "section": "Chapter 26: Seen and Unforeseen",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry and his friends have their first Divination class with Firenze, whose teaching methods are based on centaur wisdom and therefore very different from Trelawney's. For example, centaurs believe that Astrology may predict events that are significant to mankind, but not trivial events of human lives. The room in which Firenze gives his class was bewitched to resemble his natural habitat in the Forbidden Forest. When asked why he does not teach in the Forest itself, Firenze explains that he was banned from his colony because he agreed to teach at Hogwarts, which the centaurs consider treason because they do not wish to share their wisdom with humans.\n\nDuring another D.A. meeting where Harry is teaching the Patronus Charm, a desperate Dobby tells Harry that Umbridge has found out about the group. Harry immediately calls the meeting off and most members manage to escape, but he gets caught by Draco and turned over to Umbridge. Umbridge takes Harry with her to the Headmaster's office, where Dumbledore and McGonagall are with Fudge, who is accompanied by Aurors John Dawlish and Kingsley Shacklebolt, and Percy Weasley. Harry learns that the group was betrayed by Marietta Edgecombe, a friend of Cho Chang, but that the only information she gave so far was that a meeting was taking place at the Room of Requirement. However, Umbridge is unable to get more information from her because, due to a jinx, Marietta's face is covered in pimples forming the world \"SNEAK\", so she is too ashamed to speak, and her covering her face with her hands muffles her voice. Umbridge suggests that Marietta communicate only by nodding, but before she can begin, Kingsley (who is secretly loyal to Dumbledore and not to the Ministry) discreetly puts a charm on Marietta that prevents her from further incriminating the D.A. However, Umbridge produces the parchment containing the names of all involved students under the name \"Dumbledore's Army\". Dumbledore takes the blame on himself and claims that he was the one behind the group, citing its name as evidence, and that he planned to train students as his soldiers, to Umbridge's and Fudge's surprise. Fudge and his men try to arrest Dumbledore, but Dumbledore easily disables them and is spectacularly whisked away by his phoenix, Fawkes.",
    "section": "Chapter 27: The Centaur and the Sneak",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Umbridge is appointed Headmistress and imposes even tighter control by forming the Inquisitorial Squad. After going through an interrogation with Umbridge regarding Dumbledore and Sirius Black's whereabouts, Harry learns the Floo Network connection in her fireplace is not being monitored like the others are by the Ministry. Fed up, the Weasley twins instigate a revolt, causing mayhem throughout the school by setting off their Wildfire Whiz-bangs in protest against Umbridge's tyranny, while the staff pointedly do nothing to help Umbridge regain control. Umbridge is unable to get rid of the fireworks, which continue to explode all over the school for days. Harry ends his relationship with Cho after confronting her about Marietta's betrayal.\n\nDuring the next Occlumency lesson, Harry uncovers the source behind Snape's hatred for his father, when he went into Dumbledore's Pensieve (borrowed by Snape) and saw both Snape's memories of being bullied by James and the breaking up of Snape and his mother's friendship. Snape ends the lesson abruptly after pulling Harry out of the Pensieve and throwing him out.",
    "section": "Chapter 28: Snape's Worst Memory",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry and the other fifth years are getting ready to begin the sessions on the advice of what they'll need to do to prepare for the careers they'll pursue after graduation. During Harry Potter's career advice session with Professor McGonagall, he tells her that he wants to be an Auror. Suddenly they are rudely interrupted by the Headmistress, Dolores Umbridge; she remarks against Harry's ambition of being an Auror. The meeting ends up with Professor McGonagall supporting Harry, and having a screaming argument with Umbridge.\n\nUnder Fred and George's advice, Harry decides to sneak into Umbridge's office and use her fireplace while they distract her. Harry is able to talk briefly with Lupin and Sirius about his father's cruel treatment of Snape. They tell him that James, like many other people, stopped acting that way as he got older.\n\nAfter being deliberately caught by Umbridge for turning one of Hogwarts' corridors into a swamp, Fred and George summon their confiscated broomsticks before flying away from Hogwarts. This marks the end of the magical education of Fred and George, who now opt to move into their magical tricks and joke shop in Diagon Alley, Weasleys' Wizard Wheezes.",
    "section": "Chapter 29: Careers Advice",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Fred and George's departure from Hogwarts triggers a revolt among the students. During this, Harry finally reveals to Ron and Hermione that he gave the twins his Triwizard winnings, which is how they got the money to buy everything they need. As Ron Weasley is playing in Gryffindor's championship Quidditch match against Ravenclaw, Harry and Hermione are whisked away by Hagrid to introduce his half-brother Grawp. Reasoning that it is only a matter of time before he is driven out of Hogwarts by Umbridge now that Dumbledore is gone, Hagrid wants them to take care of Grawp in his stead once this happens. When the centaurs show up, Harry and Hermione learn that Firenze becoming the Divination teacher and Grawp's presence in the Forbidden Forest have angered them. The centaurs make it clear to Hagrid that their patience is running thin to where they wouldn't hesitate to attack any human that enters their forest. Emerging from the forest, Harry and Hermione see Ron being triumphantly carried out of the stands for helping Gryffindor scrape the Quidditch Cup, thanks to his superb goalkeeping.",
    "section": "Chapter 30: Grawp",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry and Hermione tell Ron about Grawp. The fifth years begin going through their O.W.L. examinations. During the night of Harry's Astronomy exam, Umbridge orders several Aurors to evict Hagrid from Hogwarts. She acts, this time, under the cover of darkness to avoid what happened with Sybill Trelawney. Hagrid resists their spells, and Minerva McGonagall is injured when protesting against the use of excessive force against Hagrid. Hagrid is able to escape and McGonagall is sent to St Mungo's. During Harry's History of Magic exam, he falls asleep and receives a vision that Sirius is being tortured by Voldemort at the Department of Mysteries.",
    "section": "Chapter 31: O.W.L.s",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry tells Ron and Hermione about Sirius, although Hermione suspects it may be a trap and suggests that he attempt to talk to Sirius first to confirm he is missing. With help from several of his friends to serve as lookouts and distractions, Harry uses Umbridge's fireplace once again, and is able to talk with Kreacher, who confirms that Sirius has indeed left for the Department of Mysteries. This time, however, Harry is caught by Umbridge and the Inquisitorial Squad, who captured his friends aiding him. Umbridge summons Snape to provide her with Veritaserum for the interrogation, but Snape says he has run out of it and will take a full month to brew more. When Snape is about to leave, Harry tries to pass on a coded message to him, but is unsure if the Potions Master understands or intends to deliver it. After Snape leaves, Umbridge is about to use the Cruciatus Curse on Harry, while also revealing it was her who sent the Dementors to attack Harry during the summer. Just before Umbridge can do so, Hermione claims that Dumbledore has hidden a powerful weapon in the Forbidden Forest.",
    "section": "Chapter 32: Out of the Fire",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Hermione leads Harry and Umbridge into the forest, where they encounter centaurs. The Skirmish in the Forbidden Forest ensues, and Umbridge foolishly insults them and an angry centaur picks up Umbridge and carries her off screaming into the woods. The centaurs contemplate taking Harry and Hermione as well, but when Hagrid's giant half-brother, Grawp crashes onto the scene, Hermione and Harry escape amid the chaos.\n\nDuring their escape, Harry, Ron and Hermione find Luna, Ginny and Neville, who outsmarted the Inquisitorial Squad and came after them. Harry tells them about Sirius and together they fly to the Ministry of Magic on the school's Thestrals.\n\n]]",
    "section": "Chapter 33: Fight and Flight",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The group arrive at the Ministry, which is empty. When they arrive at the Department of Mysteries, they pass through several cryptic chambers until they arrive at the Hall of Prophecy, where Harry picks up a prophecy contained in a glass sphere before they are ambushed by Death Eaters.",
    "section": "Chapter 34: The Department of Mysteries",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Lucius Malfoy reveals that Voldemort is seeking that prophecy and needs Harry to retrieve it for him. All of the six students heroically fight the many Death Eaters, but they are dangerously outmatched.\n\nThe group is nearly defeated, but when they reunite in the Death Chamber, Order members suddenly arrive to help them. During the ensuing battle, the glass sphere is shattered and the prophecy lost. Sirius is blasted with a spell by his Death Eater cousin, Bellatrix Lestrange, and, falling backwards, disappears through a mysterious veiled archway. Remus Lupin restrains Harry, who wants to follow and rescue Sirius, telling him that Sirius is dead.",
    "section": "Chapter 35: Beyond the Veil",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Dumbledore arrives and swiftly captures the Death Eaters, with only Bellatrix Lestrange managing to escape. Harry chases Bellatrix through the Ministry and tries to cast the Cruciatus Curse on her, but is unable to produce a lasting effect. Lord Voldemort appears as Harry is fighting Bellatrix and tries to kill him, but he is saved by Dumbledore and an intense duel erupts between the two mighty wizards, with Dumbledore visibly dominating the duel, as he calmly overcomes all of Voldemort's attempts before eventually imprisoning him in a cocoon of water, forcing him to Disapparate. Left with the realisation Dumbledore surpasses him, Voldemort, in desperation, attempts to possess Harry to cause him unbearable pain in the hope that Dumbledore will kill Harry both to spare him and to kill Voldemort. However, Dumbledore does not act on the bait and in an ironic twist of fate Harry's grief for Bellatrix's murder of Sirius, or love, allows him to cause Voldemort immeasurable pain and forces him out. Ministry of Magic employees arrive in time to see the Dark Lord before he Disapparates, taking Bellatrix with him. Cornelius Fudge finally admits Voldemort has returned after witnessing the latter's appearance. Dumbledore sends Harry back to Hogwarts via Portkey.",
    "section": "Chapter 36: The Only One He Ever Feared",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "In Dumbledore's office, Harry is furious at Dumbledore for his apparent insensitivity to Sirius's death. Later, Dumbledore apologises to Harry for withholding information over the past year and explains everything else to him: Why he was distant with him, why he arranged Occlumency with Snape and that he was trying to keep Sirius alive with him shut up inside his house. He also explains that when Harry spoke to Kreacher in the fire, Kreacher lied to him and that Sirius was upstairs tending to Buckbeak whom Kreacher had injured after being encouraged to do so by Narcissa Malfoy and Bellatrix Lestrange.\n\nHe reveals the lost prophecy, for it was to him that it was first told:\n\nThe one with the power to vanquish the Dark Lord approaches ... born to those who have thrice defied him, born as the seventh month dies ... and the Dark Lord will mark him as equal, but he will have power the Dark Lord knows not ... and either must die at the hand of the other for neither can live while the other survives ... the one with the power to vanquish the Dark Lord will be born as the seventh month dies ...\n\nDumbledore also reveals that, due to when the boy was predicted to be born, Neville Longbottom could also have been the child in the prophecy. Dumbledore believes Voldemort chose to attack Harry because he is a half-blood like himself; Neville is a pureblood. In doing so, the Dark Lord marked Harry as his equal; therefore, there is no doubt that the prophecy relates to anyone but Harry. Dumbledore also reveals to Harry that he never chose him as a prefect because Dumbledore thought that Harry \"had enough responsibility to be going on with.\"",
    "section": "Chapter 37: The Lost Prophecy",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Ron and Hermione recover from their injuries after the battle at the Ministry. Fudge publicly admits Voldemort's return while Harry's interview with Rita Skeeter is reprinted in the Daily Prophet. McGonagall makes a full recovery and returns from St Mungo's. After briefly visiting Hagrid, Harry sits by the edge of the lake and mourns for Sirius.\n\nThe day before term ends, Umbridge is removed from Hogwarts. While packing, Harry sees the two-way mirror that Sirius gave him, and tries to call his godfather, but he sees nothing. Then suddenly he has the idea to talk to Nearly Headless Nick, and ask him if Sirius could come back as a ghost. Nick says that Sirius is not the kind of wizard who would do that, which leaves Harry disappointed and sad. Running into Luna Lovegood, and remembering she can see Thestrals, Harry asks her if she had known anyone that died. Luna mentions her mother had died when she was nine and mentions that Harry had heard voices behind the Veil at the Ministry, and reassures him that the closest people they lose haven't truly left them for good. This cheers Harry up a bit.\n\nAfter boarding the Hogwarts Express, Malfoy, Crabbe, and Goyle attempted to ambush him, but members of Dumbledore's Army intervene using jinxes until Malfoy, Crabbe and Goyle resemble nothing more than slugs forced into Hogwarts robes. Harry learns from Hermione that Cho Chang is now dating Michael Corner after Ginny had ditched him due to Michael being upset that Gryffindor had beat Ravenclaw and went to comfort Cho. Ginny explains she's now going out with Dean Thomas.\n\nLater, at King's Cross Station, Harry is surprised to find that Mad-Eye Moody, Tonks and Lupin are there to greet him and to ask the Dursleys to treat him better this summer. Ron and Hermione say goodbye to Harry with the promise that they will meet very soon.",
    "section": "Chapter 38: The Second War Begins",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "{| class=\"wikitable\" border=\"2\" cellspacing=\"1\" cellpadding=\"4\"\n|-\n! width=\"25%\" |Character\n! width=\"20%\" |Killed by\n! width=\"15%\" |Cause of death\n! width=\"30%\" |Circumstances\n|-\n|Pandora Lovegood\n|Herself (accidentally)\n|Her own spell backfired\n|(Mentioned only)\nLuna Lovegood witnessed her death\n|-\n|Broderick Bode\n|Walden Macnair\n|Devil's Snare\n|St Mungo's Hospital for Magical Maladies and Injuries\n|-\n|Sirius Black\n|Bellatrix Lestrange\n|Falling through veil from an unidentified spell\n|Battle of the Department of Mysteries\n|}",
    "section": "List of deaths",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"4\" border=\"2\"\n! width=\"20%\" |Winners\n! width=\"20%\" |Defeated\n! width=\"15%\" |Outcome\n! width=\"25%\" | Location\n|-\n|Harry Potter\n|Dementors\n|Dementors are repelled\n|Little Whinging\n|-\n|Albus Dumbledore\n| Cornelius Fudge, Kingsley Shacklebolt, John Dawlish and Dolores Umbridge \n|Dumbledore easily defeats all four of them and escapes\n|Headmaster's office\n|-\n|Rubeus Hagrid and Minerva McGonagall\n| Dolores Umbridge and helpers\n|Hagrid defeats all his attackers except Umbridge and escapes with a stunned Fang; a heavily stunned McGonagall is taken to St Mungo's \n| Hogwarts grounds\n|-\n|Centaurs and Grawp\n|Dolores Umbridge\n| Umbridge is captured by centaurs\n|Forbidden Forest\n|-\n|Ginny Weasley, Ron Weasley, Luna Lovegood, and Neville Longbottom\n|Inquisitorial Squad\n|Squad is left in ruins\n|Umbridge's office\n|-\n|Death Eaters\n|Dumbledore's Army members at Ministry\n|Students forced to separate\n| rowspan=\"3\" |Ministry of Magic\n|-\n|Antonin Dolohov\n|Harry, Neville, and Hermione\n|Hermione is nearly killed, Neville's nose and wand are broken\n|-\n| rowspan=\"2\" |Death Eaters\n|Luna, Ron and Ginny\n|Luna and Ginny are nearly knocked out and Ron is attacked by the brains in the tank\n|-\n| Harry and Luna\n|Luna is knocked out and the Death Eaters get in\n| rowspan=\"12\" |Death Chamber \n|-\n|Order of the Phoenix\n|Death Eaters\n|Breaks down into single fights\n|-\n|Bellatrix Lestrange\n|Nymphadora Tonks\n|Tonks is nearly killed\n|-\n|Kingsley Shacklebolt\n|Two Death Eaters\n|Kingsley presumably won\n|-\n|Antonin Dolohov\n|Mad-Eye Moody\n|Moody is knocked out\n|-\n|Neville Longbottom and Harry Potter\n| Death Eater\n|Death Eater is knocked out\n|-\n| Harry Potter and Sirius Black\n|Antonin Dolohov\n|Harry and Sirius win\n|-\n|Remus Lupin\n|Lucius Malfoy\n| Remus presumably won as he is later unhurt and able to prevent Harry from running into the Veil of Death after Sirius\n|-\n|Albus Dumbledore\n|Death Eaters\n|Death Eaters are rounded up\n|-\n| rowspan=\"4\" |Bellatrix Lestrange\n|Sirius Black\n|Bellatrix kills Sirius\n|-\n|Kingsley Shacklebolt\n|Bellatrix causes Kingsley great pain\n|-\n|Albus Dumbledore \n|Bellatrix escapes out of the room\n|-\n|Harry Potter\n| Bellatrix taunts him then Voldemort arrives\n| rowspan=\"2\" |Atrium\n|-\n| Albus Dumbledore and Harry Potter \n|Lord Voldemort and Bellatrix Lestrange\n|Voldemort and Bellatrix flee\n|}",
    "section": "Fights/duels",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Ootp UK Children.jpg|British Children's Edition, published by Bloomsbury\n0747591261.jpg|British Celebratory Edition\nOrder Special Edition.jpg|British Special Edition\nOotp UK Adult.jpg|British Adult Edition\nNormal OOTP Signature.jpg|British Signature Edition\nHarry Potter and the Order of the Phoenix new adult edition.jpeg|British 2013 Adult Edition\nOrder of the Phoenix New Cover.jpg|British 2014 Children's Edition\nOothp.jpg|American, published by Scholastic\nNormal NY41373.jpg|American 15th anniversary edition\nUS 2018 paperback 05 OOTP.jpg|American 20th anniversary edition",
    "section": "English-language",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Harry Potter 5 Arabic cover.jpg|Arabic edition\nHP5.jpg|Czech, Harry Potter a Fénixův řád, published by Albatros\n-Files-Images-Bokadeildin-Permur-bokarodir-foniks.JPG|Faroese, Harry Potter og Føniksfylkingin, published by Bókadeild Føroya Lærarafelags\n200px-הארי פוטר 5.jpg|Hebrew edition\nLithuanian original 05 OOTP.jpg|Lithuanian, Haris Poteris ir Fenikso Brolija, published by Alma Littera\nHarry Potter Cover 5 Serbian.jpg|Serbian, Hari Poter i Red Feniksa, published by Evro Giunti\nHarry potter in feniksov red 5.jpg|Slovene, Harry Potter in feniksov red\nHarryPotter5-1745.jpg|Turkish, Harry Potter ve Zümrüdüanka Yoldaşlığı",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Bosnian 05 OOTP.png|Bosnian, Harry Potter i Red feniksa, published by Buybook\nBulgarian 2019 hardback 05 OOTP.png|Bulgarian 20th anniversary edition, Хари Потър и Орденът на феникса, published by Egmont Bulgaria\nDanish cover vol5.jpg|Danish, Harry Potter og Fønixordenen, published by Gyldendal\nDanish cover vol5 alternate.jpg|Danish alternate edition\nDanish 2012 paperback 05 OOTP.jpg|Danish 2012 paperback\nDutch Book 5 cover.jpg|Dutch, Harry Potter en de Orde van de Feniks, published by Standaard and De Harmonie\nDutch Order of the Phoenix book cover.jpeg|Dutch (the Netherlands) 2010 pocket edition, published by Uitgeverij De Harmonie\nFinnish Book 5 cover.jpg|Finnish, Harry Potter ja Feeniksin kilta, published by Tammi\nFrench Book 5 cover.jpg|French hardback, ''Harry Potter et l'Ordre du Phénix, published by Éditions Gallimard\nFrench T5 (2011 new edition).png|French 2011 paperback\nFrench T5 (2016 new edition).jpg|French 2016 edition\nGerman 05 OOTP.jpg|German, Harry Potter und der Orden des Phönix, published by Carlsen Verlag\nGerman Adult Edition 05 OOTP.png|German Adult Edition\nGerman 2013 Pocket 05 OOTP.png|German 2013 Anniversary Pocket Edition\nGerman 2018 hardback 05 OOTP.png|German 20th anniversary edition\n1499934579165.jpeg|Indonesian, Harry Potter dan Orde Phoenix, published by Gramedia Pustaka Utama\nItalian 05 OOTP.jpg|Italian, Harry Potter e l'Ordine della Fenice'', published by Adriano Salani Editore\nItalian 2021 redesign 05 OOTP.png|Italian 2021 redesign\nLithuanian 2020 hardback 05 OOTP.png|Lithuanian 20th anniversary edition\nHP5BOX.png|Brazilian Portuguese collector's edition, Harry Potter e a Ordem da Fênix, published by Rocco\nSlovak 2020 exclusive box set 05 OOTP.png|Slovak 20th anniversary edition, Harry Potter a Fénixov rád, published by IKAR\nSpanish 05 OOTP.jpg|Spanish, Harry Potter y la Orden de Fénix, published by Salamandra\nSpanish 15th anniversary 05 OOTP.jpg|Spanish 15th anniversary edition\nSwedish 05 OOTP.jpg|Swedish, Harry Potter och Fenixorden, published by Tiden\nThai 2020 hardback 05 OOTP.jpg|Thai 20th anniversary edition, แฮร์รี่ พอตเตอร์กับภาคีนกฟีนิกซ์, published by Nanmeebooks\nHarry-Potter 5-Zumruduanka-Yoldasligii-8264.jpg|Turkish edition\nUkrainian 05 OOTP.jpg|Ukrainian, Гаррі Поттер і Орден Фенікса, published by А-БА-БА-ГА-ЛА-МА-ГА\n\n}}",
    "section": "Translations (alternative covers)",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "Jim Kay was commissioned to do the full coloured illustrated edition. He brought in a guest collaborator, Neil Packer, to help complete the project. A cloth-bound Deluxe Illustrated Edition will be published too.\n\nBloomsbury 05 OOTPIE cover - Jim Kay and Neil Packer.png|Bloomsbury edition\nScholastic 05 OOTPIE cover - Jim Kay and Neil Packer.jpeg|Scholastic edition",
    "section": "Illustrated Editions",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "UK House Edition hardback Gryffindor 05 OOTP.png\nUK House Edition hardback Hufflepuff 05 OOTP.png\nUK House Edition hardback Ravenclaw 05 OOTP.png\nUK House Edition hardback Slytherin 05 OOTP.png",
    "section": "Hogwarts House Edition",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "*In Chapter 1, Harry hears about a high profile celebrity divorce. Based on timing it may be the divorce of Kenneth Branagh and Emma Thompson, who divorced in 1995 after Branagh cheated on Thompson with Helena Bonham Carter. All three appear in the film series as Gilderoy Lockhart, Sybil Trelawney, and Bellatrix Lestrange, respectively.\n*The phone number to get into the Ministry of Magic is 62442, which can be used to spell \"magic\" on a telephone keypad.\n*When the group of students arrive at the Hog's Head for the first D.A. meeting, Fred and George Weasley arrive last, but then Fred jumps to the front of the group to reach the barman first.\n*When Umbridge is inspecting Snape and Harry's potion is ruined, Snape gives him a zero and an essay to write on what he did wrong. Harry then says that he has Quidditch practice; but just that morning, Educational Decree Number Twenty-Four had been enforced and the Gryffindor Quidditch team had not been approved yet, although he hadn't realised that Quidditch teams were included in the Decree too.\n*It is the first book in the series to be released while the movies were being produced.\n*This is the biggest book in the series, being over 700 pages in the UK edition and over 800 pages in the US edition.\n*A new audiobook is in the works with a full cast for characters.",
    "section": "Behind the scenes",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "The book was also adapted into a film, the fifth Harry Potter film of the series. The film Harry Potter and the Order of the Phoenix was released on Wednesday, 11 July, 2007. It was directed by David Yates and the trio was portrayed by Daniel Radcliffe, Rupert Grint and Emma Watson. It was 2 hours and 18 minutes long and marked as one of the shortest Harry Potter films released, even though it is the longest book in the series.",
    "section": "Film adaptation",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "*\n*\n*\n*\n*Harry Potter and the Order of the Phoenix (character index)\n*Fifth year",
    "section": "See also",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  },
  {
    "text": "de:Harry Potter und der Orden des Phönix\nde2:Harry Potter und der Orden des Phönix\nes:Harry Potter y la Orden del Fénix\nfi:Harry Potter ja Feeniksin kilta\nit:Harry Potter e l'Ordine della Fenice\nfr:Harry Potter et l'Ordre du Phénix\nnl:Harry Potter en de Orde van de Feniks\npl:Harry Potter i Zakon Feniksa\npt:Harry Potter e a Ordem da Fênix\nru:Гарри Поттер и Орден Феникса\ntr:Harry Potter ve Zümrüdüanka Yoldaşlığı\nvi:Harry Potter và Hội Phượng hoàng\nzh:哈利·波特与凤凰社\nno:Harry Potter og Føniksordenen\n5\nCategory:Canon",
    "section": "Notes and references",
    "name": "Order of the Phoenix",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 5,
    "source_book": "Order of the Phoenix"
  }
]