[
  {
    "text": "}}\n\n|author=J. K. Rowling\n|cover artist=*Thomas Taylor (UK)\n*Jonny Duddle (UK) \n*Levi Pinfold (UK) \n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Jim Kay (UK, Illustrated Edition)\n*Olly Moss (Pottermore eBook)\n*Nicholas Filbert (Indonesia)\n|interior=*Mary GrandPré (US)\n*Levi Pinfold (UK) \n*Jim Kay (Illustrated Edition)\n|narrator=*Stephen Fry (UK)\n*Jim Dale (US)\n|publisher=*Bloomsbury (UK & Canada & India)\n*Scholastic (US)\n*Raincoast Books (Canada; formerly)\n*Carlsen Verlag (Germany)\n*Dost Kitabevi Yayınları (Turkey; formerly)\n*Yapı Kredi Yayınları (Turkey)\n*Penerbit PT Gramedia Pustaka Utama (Indonesia)\n|release date=*26 June 1997 (UK)\n*1 September 1998 (US)\n*1 April 2001 (Turkey)\n*September 2000 (Indonesia)\n|pages=*332 (UK)\n*309 (US)\n*274 (Turkey)\n*388 (Indonesia)\n|followed by=\n}}\n are, this time, justified.|The Sunday Times}}\n'''''Harry Potter and the Philosopher's Stone''' is the first novel in the Harry Potter series written by J. K. Rowling. The book was first published on 26 June 1997 by in London and was later made into a film of the same name.\n\nThe book was released in the United States under the name '''Harry Potter and the Sorcerer's Stone''''' because the publishers were concerned that most American readers would not be familiar enough with the term \"Philosopher's Stone\". However, this decision led to criticism by the British public who felt it shouldn't be changed due to the fact it was an English book.",
    "section": "General",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "\"For Jessica, who loves stories, for Anne, who loved them too, and for Di, who heard this one first\"\n\nThe book is dedicated to three female relatives of the author J. K. Rowling: Jessica, her eldest daughter, Anne, her late mother, and Di, her sister.",
    "section": "Dedication",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "\"Harry Potter has never played a sport while flying on a broomstick. He's never worn a Cloak of Invisibility, befriended a half-giant, or helped hatch a dragon. All Harry knows is a miserable life with the Dursleys: his horrible aunt and uncle and their abominable son, Dudley. Harry's room is a tiny Cupboard Under the Stairs, he hasn't had a birthday party in ten years, and his birthday present is his uncle's old socks.\n\nBut all that is about to change when a mysterious letter arrives by owl messenger. A letter with an invitation to a wonderful place he never dreamed existed. There he finds not only friends, aerial sports, and magic around every corner, but a great destiny that's been waiting for him... if Harry can survive the encounter.\"\n\n\"Until now there's been no magic for Harry Potter. He lives with the miserable Dursleys and their abominable son, Dudley. Harry's room is a tiny closet beneath the stairs, and he hasn't had a birthday party in ten years. Then a mysterious letter arrives by owl messenger. A letter with an invitation to an incredible place called Hogwarts School of Witchcraft and Wizardry. There he finds not only friends, flying sports on broomsticks, and magic in everything from classes to meals.\n\nHarry Potter thinks he is an ordinary boy - until he is rescued by a beetle-eyed giant of a man, enrols at Hogwarts School of Witchcraft and Wizardry, learns to play Quidditch, and does battle in a deadly duel. The Reason, Harry Potter is a wizard!\"",
    "section": "Book description",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Vernon and Petunia Dursley, of Number Four Privet Drive (in Little Whinging, Surrey), are proud to say they are perfectly normal. They are the last people you'd expect to be involved in anything strange or mysterious, because they just don't hold with such nonsense. Vernon is the director of a drill-making firm called Grunnings, and Petunia keeps house and raises their one-year-old son Dudley.\n\nOn Tuesday, 1 November 1981, the Dursleys begin the day by gossiping about their neighbours while Petunia wrestles the disagreeable Dudley into his high chair. None of them notice a large tawny owl flying past their window, but Vernon does see a tabby cat reading a map and a street sign outside their house. He forces himself to forget the cat, but upon arriving in town, he notices large groups of people wearing cloaks. He eavesdrops on them and hears them talking about \"the Potters and their son Harry.\" Vernon finds this horrifying because the Potters are his in-laws, and he and Petunia wouldn't want anyone to find out about them.\n\nWhen he leaves work at the end of the day, he bumps into a small man wearing a cloak, but when he tries to apologise, the man hugs him and tells him that even muggles like him should be celebrating today because \"You-Know-Who\" has been defeated.\n\nVernon returns home to find the cat still waiting there, and it only gives him a stern look when he tries to shoo it away. The news is full of unexplained owl sightings and fireworks displays, and Vernon nervously asks Petunia if she has heard from her sister recently. Petunia is upset but tells him that she hasn't heard from her sister and that their nephew's name is \"Harry.\" Vernon's heart sinks. He finds it difficult to fall asleep that night but eventually manages it.\n\nAfter the Dursleys fall asleep, Albus Dumbledore appears in the middle of Privet Drive and siphons away the light from the street lamps with his Deluminator. He greets the cat, who has spent all day waiting outside, as \"Professor McGonagall,\" and the cat turns into a human woman. They discuss the deaths of James and Lily Potter at the hands of Lord Voldemort at the Potter cottage in Godric's Hollow and how their infant son Harry Potter miraculously survived the attack while Voldemort has seemingly died.\n\nRubeus Hagrid arrives riding a flying motorbike and transporting Harry. He hands him over to Dumbledore, who leaves the sleeping baby and a letter to the Dursleys on the doorstep of Number Four. The three wizards are distraught about leaving the orphaned baby with his relatives, but they only give themselves a moment to mourn before they force themselves to leave. Hagrid says he will return the motorbike to its owner, young Sirius Black; McGonagall resumes her cat form and slinks around the corner at the other end of the street, and Dumbledore restores the lights to the streetlamps and bids Harry farewell before vanishing without a trace.\n\nHarry rolls over inside his bundle of blankets, and his tiny hand closes on the letter as he sleeps on. He does not know that he is special and famous, that he will be woken up the next morning by his aunt's scream when Petunia opens the front door to put out the milk bottles, that he will be spending the next few weeks being prodded and pinched by his cousin Dudley, or that at this very moment, people meeting in secret all over the country are toasting, \"To Harry Potter -- the boy who lived!\"",
    "section": "Chapter 1: The Boy Who Lived",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Almost ten years have passed since the Dursleys have awoken to find Harry Potter lying on their doorstep, and Privet Drive and the Dursleys' house have not changed since that day. The only difference is the vast number of pictures of Dudley Dursley throughout his life displayed on the walls. There is no sign that Harry Potter lives there, as he is forced to live in the cupboard under the stairs, a very cramped space with many spiders. Petunia comes to Harry's door one morning and wakes him with a shrill voice. Harry is trying to think about the dream he has been having. It was about a flying motorbike, and he believes he has had the same dream before. Aunt Petunia tells him to make some bacon; she wants everything perfect for Dudley's 11th birthday. Harry dresses into a pair of Dudley's old clothes and enters the kitchen, where the table is covered in Dudley's presents.\n\nHarry has jet-black hair and green eyes. Tape holds his glasses together because Dudley has smashed them many times. What distinguishes Harry from others the most is the lightning-shaped scar on his forehead. He often wonders how he got it, and the Dursleys have told him it was from the car crash that killed Harry's parents. Harry doesn't know much more about this accident because the Dursleys' first rule is not to ask questions. Dudley comes into the kitchen and begins to count his presents, only to find 36, which he angrily recalls is one fewer than the year before. Aunt Petunia states that they will buy him two new gifts while they are out. Vernon tells Petunia that their neighbour, Arabella Figg, has broken her leg and cannot take care of Harry while they are at the zoo. They can't think of anyone else who can take care of him, so Harry has to go with them.\n\nDudley is allowed to take a friend to the zoo and chooses his friend Piers Polkiss. Piers comes to the house with his mother. A half-hour later, Harry sits in the car with Dudley, Piers, Vernon, and Petunia. On the way, a motorbike overtakes them, and Vernon complains about them. Harry remarks that he has dreamed about a flying motorbike, and Vernon snappily reminds him that motorbikes do not fly. Harry thinks about all the strange things that have happened to him: he once jumped onto the school chimney and mysteriously grew all of his hair back the morning after a haircut. At the zoo, Dudley and Piers find the animals boring. Harry is left to watch a Boa constrictor as it sleeps, and when Dudley tries to make it move, it wakes up but still doesn't move. The snake begins to move after Dudley and Piers slink away. Moments later, Harry speaks to the snake and finds it miraculously understands him. Upon realising that it is now moving, Piers calls Dudley and Vernon back to the snake's exhibit. Dudley pushes Harry out of the way (he lands \"hard on the concrete floor\") and presses his face against the glass. Harry becomes angry, and somehow the glass vanishes, and the snake gets out, scaring Dudley and Piers. As the snake slithers away, Harry thinks he hears it speak back to him. Piers tattletales on Harry that he had been talking to the snake, and Uncle Vernon sends him to his cupboard –with no meals for a week as cruel punishment.",
    "section": "Chapter 2: The Vanishing Glass",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Since the boa constrictor escaped from the zoo, Harry was locked in his cupboard for the longest time ever. It's the beginning of the summer holidays when Harry is finally allowed out. Even though he is not at school, Harry still can't escape Dudley and his gang, who regularly visit the house. To keep out of their way, Harry usually wanders around Privet Drive. He is glad, however, that Dudley and Piers are going to Smeltings Academy while Harry will attend Stonewall High. One day during the summer, Harry is told to get the post for Uncle Vernon. When Harry goes to get the mail, there are three letters: a postcard from Uncle Vernon's sister, who is on holiday in the Isle of Wight, a letter that looks like a bill, and a letter for Harry. Harry takes the letter, studies the yellow parchment it is made of, and then reads the address:\n\nMr H. Potter\n\nThe Cupboard Under the Stairs\n\n4, Privet Drive\n\nLittle Whinging\n\nSurrey\n\nHarry can't believe it. He has never had a letter in his life. On the back is a wax seal with a Lion, a Snake, a Badger and an Eagle surrounding an H. Harry returns to the kitchen and gives Uncle Vernon the other two letters as he sits down and starts to open the letter. Dudley soon sees that Harry has a letter, and Uncle Vernon snatches it from him to read it with Aunt Petunia. Uncle Vernon tells Harry and Dudley to get out of the kitchen, so they both go and stand in the hall. The two fight over who gets to look through the keyhole. Dudley wins, so Harry resorts to looking through the gap between the floor and the door. Uncle Vernon and Aunt Petunia are discussing the seal on the back. Uncle Vernon says that they should just ignore it. Later, when Harry is in his cupboard, Uncle Vernon comes in and says that he has burned the letter and that they are moving him up to Dudley's second bedroom. Slightly surprised, Harry moves all of his things up to the bedroom, wishing he had his letter. The next morning at breakfast, Dudley is asked to get the post by Uncle Vernon.",
    "section": "Chapter 3: The Letters from No One",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "After banging things all the way down the hall with his Smeltings stick, Dudley calls out that another letter is addressed to Harry, this time in The Smallest Bedroom rather than The Cupboard Under the Stairs. Both Harry and Uncle Vernon rush to the hallway in an attempt to get the letter. After a minute of confused fighting, Uncle Vernon emerges, clutching the letter in his hand. Determined to see what his letter says, Harry creeps down the stairs early the following day and approaches the door. He is going to camp there until the post arrives, and then he will finally get to read his letter. When he reaches the door, however, he stands on Uncle Vernon - who has had the very same idea. Every day, letters appear addressed to Harry, doubling in number. Eventually, so many letters arrive that Uncle Vernon resorts to nailing shut the letterbox. But they begin to appear in the strangest places: under the door, squeezed through the window, and Aunt Petunia even finds some while cracking open eggs. Finally, they get attacked by thirty or forty letters being fired out of the fireplace. Despite the sender's efforts, Harry still does not manage to get his hands on one of the letters long enough to read it, and a furious Uncle Vernon states that they are leaving the house. They get into their car and leave ten minutes later. They travel for miles until they eventually stop in front of a gloomy hotel on the brink of the city. However, Vernon's attempts to shake the sender off are unsuccessful, as more letters come for Harry to the hotel the next morning. Again, they return to the car and finally stop to get on a boat that takes them to an island with a small hut. Harry remembers that the next day will be his eleventh birthday. Harry can't sleep with the raging storm outside when they get there, so he counts down the time until his birthday. When Dudley's watch turns to the next day, there is a loud knocking at the door - something wants to get in...",
    "section": "Chapter 3: The Letters from No One",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "There is another loud boom on the door, and Dudley wakes up, thinking it is a cannon. Uncle Vernon comes through with a rifle, with Aunt Petunia cowering behind him. The door is blasted off its hinges and hits the floor. A giant enters and fixes the door into its frame. The giant asks for coffee and sits on the couch beside Dudley, scaring him away to hide behind Aunt Petunia. The giant turns his eyes to Harry and greets him, saying he hasn't seen him since he was a baby. He says Harry looks like his father but has his mother's eyes. Uncle Vernon tells him to leave, but the giant merely grabs the gun, ties into a knot and throws it away. The giant presents Harry with a birthday cake. Harry asks the giant who he is, and he says he is Rubeus Hagrid, the Keeper of Keys and Grounds at Hogwarts School of Witchcraft and Wizardry. Hagrid makes a fire and cooks some sausages. He is shocked to discover that Harry knows nothing about Hogwarts. He gets angry at the Dursleys for not telling him anything about his parents' world, his world. Harry has no idea what's going on. Hagrid tells Harry his parents are famous and that he's a wizard, despite Uncle Vernon forbidding him. Hagrid gives Harry the letter that he has been craving. It tells him that he has been accepted into Hogwarts School of Witchcraft and Wizardry and that term begins on 1st September.\n\nHagrid takes out parchment and a quill and writes a letter to Hogwarts Headmaster Albus Dumbledore, explaining he has given Harry the letter. Uncle Vernon tells Hagrid that Harry won't be going, but the giant knows that a great Muggle like him can't stop Harry from going to Hogwarts. Uncle Vernon reveals he knew that Harry's a wizard, and Aunt Petunia tells Harry that her sister, Harry's mother, was a witch. Petunia said another wizard killed them, and Harry screams that Petunia said they got killed in a car crash. Hagrid is as outraged as Harry is that the Dursleys have lied that much. He sits down and tells Harry that a Dark wizard named Lord Voldemort killed Harry's parents and tried to kill Harry too. But the spell he used backfired, only leaving Harry his scar. Hagrid tells him that he brought Harry from the ruins of the house and brought him to the Dursleys' house on 4 Privet Drive. Uncle Vernon says it's a load of rubbish and tries to persuade Harry that whatever happened to his parents was deserved anyway, but Hagrid pulls an umbrella out of his coat and threatens Uncle Vernon. Harry asks what happened to Voldemort, and Hagrid tells him he vanished and hasn't been seen since.\n\nHarry doubts he is a wizard until Hagrid asks if he ever made anything he couldn't explain happen when he was angry or scared. When Uncle Vernon makes the mistake of mocking Dumbledore, Hagrid swishes the umbrella in Dudley's direction, and Dudley sprouts a curly pig's tail. Hagrid asks Harry not to mention it at Hogwarts because Hagrid isn't allowed to do magic since he was expelled. Hagrid takes off his coat, and Harry sleeps under it for the rest of the night, waiting for the day ahead.",
    "section": "Chapter 4: The Keeper of the Keys",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "When Harry wakes the following day, he tries to tell himself that what happened the previous night had all been a dream and that Hagrid taking him to a school for wizards called Hogwarts School of Witchcraft and Wizardry had never happened. But when he opens his eyes, Hagrid has fallen asleep on the couch, and he discovers that it has all happened. He hears a tapping noise coming from the window and lets in an owl. The owl drops a newspaper on Hagrid's lap and begins to claw Hagrid's coat. Hagrid tells Harry to pay the owl, so Harry does what he says, and the owl leaves. Hagrid tells him they have to go and buy his things, but Harry worries because he hasn't got any money. Hagrid tells him his parents didn't leave him without money and that their first stop is Gringotts, the wizard's bank. He explains that goblins run it and that \"you'd be mad to try and rob it\". Hagrid says Dumbledore also needs something from Gringotts, so Hagrid has to go get it. They step outside the hut and step into their boat. Hagrid uses a bit of magic to speed things up for them. Hagrid says there are enchantments guarding the vaults in Gringotts. Gringotts is all under London; you would die of starvation trying to get out. Hagrid begins to read the Daily Prophet and mutters that the Ministry of Magic is messing things up as usual. Harry wonders what the Ministry of Magic does, and Hagrid explains that they handle everything to do with magic. He says they wanted Dumbledore for Minister, but Cornelius Fudge got the job. As they pass through London, people often stare at Hagrid due to his size and his pointing out things that Muggles are brilliant at inventing. Harry asks if there are Dragons guarding Gringotts. Hagrid says yes and mutters that he would like a dragon. Harry takes out his list and reads it out. It says he needs a set of robes, a pointed hat, dragon hide gloves, and a winter coat. There is a list of his books and stationary equipment. Hagrid leads them both into a pub called the Leaky Cauldron Harry did not notice was there. It is dark and shabby, and everyone greets Hagrid as he enters.",
    "section": "Chapter 5: Diagon Alley",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "When people see Harry, many shake his hand, including Doris Crockford and Dedalus Diggle. A man with a turban approaches them, and Hagrid introduces Harry to Quirinus Quirrell, the Defence Against the Dark Arts professor at Hogwarts. They talk for a bit then Hagrid steers them out a back door into a small enclosed area with a few barrels. Hagrid takes out his umbrella and taps bricks with it, counting an order. Once he is done, a hole appears in the brick wall, slowly getting bigger, until the wall disappears entirely, revealing a crowded street with people wearing robes everywhere with shops left and right. Hagrid tells Harry the street is called Diagon Alley. While walking down the street, Harry is trying to look everywhere around him, taking in as much as possible. At the end of Diagon Alley is a huge snowy white building: Gringotts Bank. A warning echoes as they enter, telling them to rob at their own risk. Harry and Hagrid go up to a Goblin and explain they need to take some money out of Harry's vault. The Goblin asks for Harry's key, and Hagrid presents it after sorting through many other keys. The Goblin calls upon another Goblin named Griphook to take them down to the vault. Hagrid also states they must be taken down to remove the You-Know-What in Vault 713. Griphook takes them to Harry's vault, where there is a large amount of money piled up there that Harry owns. There are Bronze Knuts, Silver Sickles, and Gold Galleons. Harry and Hagrid take some money for Harry's list, then leave Gringotts. Hagrid has to stand for a bit as the cart rides that takes them to the vaults make him feel sick. Griphook then takes them to Vault 713, where Hagrid removes a grubby little package but can't tell Harry what it is. Hagrid goes for a drink at the Leaky Cauldron while Harry gets his uniform at Madam Malkin's Robes for All Occasions. Madam Malkin stands him on a stool next to a pale-faced boy who is also getting measured for his robes. The boy starts to talk about Quidditch, including his plan to smuggle in his broomstick and houses called Slytherin and Hufflepuff. When the boy learns that Harry is there with Hagrid, he asks him what happened to his parents.",
    "section": "Chapter 5: Diagon Alley",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "He is unsympathetic about their deaths and only expresses relief that they were both wizards because the other kind shouldn't be allowed in. When Harry leaves, he asks Hagrid about what the boy said, and Hagrid explains that there are four houses at Hogwarts, Quidditch is a game played on brooms, and blood status doesn't matter. They continue shopping until all Harry needs is his wand and (Hagrid insists) a birthday present. In Ollivanders, the wand shop, Mr Ollivander puts Harry off with his creepy demeanour while discussing the wands purchased by Hagrid, Harry's parents, and Voldemort. Ollivander touches Harry's scar and apologises for the fact that he sold the wand that caused it. Ollivander gives Harry a wand and tells him to give it a wave. Harry does so, but it isn't suitable for him, so Ollivander takes it back. Harry tries many wands, but none work well enough for him. Eventually, he picks up a wand (holly, eleven inches, phoenix feather core, 'nice and supple') and feels warmth in his fingers. Ollivander states that it is very curious that Harry should be destined for that wand when its brother gave Harry his scar. Hagrid takes Harry to get something to eat in the Muggle world, but Harry is worried that he isn't going to fit in at Hogwarts as everyone expects great things from him. For Harry's birthday, Hagrid buys Harry a snowy owl named Hedwig. Hagrid provides Harry with a train ticket, giving him the date, time, and location to catch the Hogwarts Express and tells Harry that if he ever needs anything, he is to write a letter, and Hedwig will know where to find him. Harry catches a train back to the Dursleys.",
    "section": "Chapter 5: Diagon Alley",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry's last month with the Dursleys is both relieving and depressing. His aunt and uncle pretend that Harry isn't there, and Dudley has become so scared of his cousin that he refuses to be anywhere near him. Harry keeps to himself in the smallest bedroom with Hedwig for company as he reads through his new books.\n\nThe day before he is due to leave, Harry asks Uncle Vernon to take him to King's Cross Station. Uncle Vernon agrees to take him but ridicules him for saying he is to depart from Platform Nine and Three-Quarters, as is marked on the ticket Hagrid gave him. \n\nThe next day, the Dursleys abandon Harry at the station. He stands between Platforms Nine and Ten, wondering how to find Platform Nine and Three-Quarters. He is stumped for a while until he overhears Molly Weasley using the word \"muggles\" and asks her for help. She tells him to run through the barrier between Platforms Nine and Ten, which he does, and he is astonished to find the train to Hogwarts on the other side of the station. \n\nMrs Weasley's twin sons, third-years Fred and George Weasley, help him lift his trunk onto the train before recognising him as Harry Potter, and their younger brother Ron, a first-year, asks to sit with him. \n\nHarry and Ron bond over their anxiety about Hogwarts (particularly Ron's successful older brothers and his sad rat Scabbers), and Harry buys a lot of sweets for them to share. Ron introduces Harry to elements of the wizarding world like Quidditch, Bertie Bott's Every Flavour Beans, and Famous Witches and Wizards cards. One of Harry's cards bears the picture of Albus Dumbledore.\n\nHarry also meets a slightly annoying, overachieving girl named Hermione Granger, a boy named Neville Longbottom who has lost his toad, Trevor, and the unpleasant boy from Madam Malkin's, whose name is Draco Malfoy, and his friends Crabbe and Goyle.\n\nHarry is offended by Draco's bigotry and rudeness, especially when directed at Ron, and he rejects his offer of friendship and advice. The five boys almost fight, but Scabbers bites Goyle and drives them off.\n\nThe Hogwarts Express arrives at Hogsmeade Station, and Hagrid escorts the first years across the Lake in boats, where they catch their first glimpse of Hogwarts.",
    "section": "Chapter 6: The Journey from Platform Nine and Three-Quarters",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "The new students are greeted at the castle door by Professor Minerva McGonagall, who tells them they will soon be sorted into their houses. All Hogwarts students live in one of four residences: Gryffindor, Hufflepuff, Ravenclaw, or Slytherin, with each house having its own team for Quidditch. The houses are in a yearlong competition with one another to acquire the most points, which are earned by success in Quidditch games and given by teachers for academic achievement and lost for student infractions, in order to win the House Cup awarded at the end of the year.\n\nThe first-years wait in an antechamber while McGonagall checks to see whether it is time yet. The Hogwarts ghosts glide into the room by mistake while debating whether to offer Peeves another chance.\n\nThe students are led to the Great Hall, where the entire school and a battered old hat on a stool are waiting for them. When the students try on the Sorting Hat, it announces the house in which they are placed. Harry becomes very nervous. He has learned that he does not care for Slytherin house, as the students in it are unpleasant and Voldemort once belonged to Slytherin. Hermione is Sorted into Gryffindor, much to Ron's displeasure. Finally, it is Harry's turn to wear the hat. He quietly says to himself \"not Slytherin, not Slytherin!\" The Hat is intrigued by this. \n\nAfter a brief mental discussion with the hat in which it tries to suggest Slytherin to him, the hat places Harry in Gryffindor. Harry is pleased to find that Ron joins in Gryffindor with him. Draco Malfoy is placed in Slytherin.\n\nEveryone sits down to a grand feast to begin the year. Harry is overwhelmed by the variety of luscious food served. Sir Nicholas de Mimsy-Porpington, the resident ghost of Gryffindor (popularly known as Nearly Headless Nick because of a botched decapitation), introduces himself to the first-year students and tells them he hopes they will win the house championship this year. Over dessert, the discussion turns to the students' upbringings. A student named Neville Longbottom tells how his family thought he was a Squib until he survived a fall from a window. Another student, Seamus Finnigan, talks about how his father, a Muggle, was shocked when he found out his wife (Seamus' mother) was a witch. Harry glances around the room and notices a few of the teachers talking to one another. One of them, while speaking to Quirrell, stares malevolently at Harry, who immediately feels a sharp pain in his forehead scar. Harry asks Percy the prefect who he is, and finds out that this man is Professor Severus Snape, who teaches Potions. After dessert, Dumbledore gets up to make his welcome speech. He adds a few warnings about staying away from the Forbidden Forest and avoiding the 3rd-floor corridor on the right side of the school before sending everyone off to bed in their Common rooms. On the way, the Gryffindors run into Peeves, a Poltergeist, and upon arriving, meet the Fat Lady who lets them into Gryffindor Tower after Percy gives her the password. Harry has trouble sleeping due to the dream he has. In it, he is wearing Professor Quirrell's turban, which is demanding him to transfer to Slytherin. He refuses, and the headwear becomes heavier on his head. Malfoy and Snape appear laughing at him, then the dream ends with a flash of green light that causes Harry to wake up at midnight and fall asleep again, forgetting about it immediately afterwards.",
    "section": "Chapter 7: The Sorting Hat",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry finds life at Hogwarts unfamiliar and strange. Everyone talks about him, and an adult always seems to be around when he is doing something wrong. It is hard to find his way to classes due to the hundred and forty-two changing staircases and tricky doorways. The people in the Hogwarts portraits have been no help to him, for they ignore some students and visit each other, nor have the ghosts, who always scare Harry when they glide through a door he is trying to open. Only Nearly-Headless Nick points new Gryffindors in the right direction, but Peeves is worth two locked doors and a tricky staircase whenever Harry runs into him when late for class. Even worse than Peeves if anyhow possible is the school caretaker Argus Filch, who both Harry and Ron get on the bad side of on their very first morning, when he finds them trying to force their way through a door which turns out to be the entrance to the out-of-bounds Third-floor corridor. He threatens to lock them in the dungeons, but the two boys are luckily rescued by Quirrell, who is passing by.\n\nAll the classes become very interesting to Harry, with the only exception being History of Magic, taught by Professor Binns, and he learns that there is a lot more to magic other than waving his wand and saying a few funny words. In his first Transfiguration class on Thursday, Professor McGonagall transfigures her desk into a pig and then back again while explaining how Transfiguration itself is some of the most complex and dangerous magic to be learned, and anyone who will get caught messing around with it will have to be banned from the class. The entire class is very impressed, but soon realise that they are not going to be changing furniture into animals. Only Hermione is able to make any progress at turning a match into a needle, for which McGonagall gives her a rare smile, but Harry is relieved to see that most of his peers are just as lost as he is. When the time comes to transition to Defence Against the Dark Arts class (the class everyone is looking forward to) every morning, the lesson turns into more of a joke, as Quirrell keeps going on with stories about his travels in the year prior, such as when he had ward off a vampire in Romania (who he is afraid will come back and get him), and when he had earned his turban from an African prince for saving him from a troublesome zombie. \n\nDuring breakfast on the first Friday, Hedwig arrives with a tea invitation from Hagrid. Later, in his Potions class, Harry discovers that Professor Snape hates him, mocking Harry as \"our new celebrity\" and then humiliating Harry for his ignorance of potion-making materials. Harry brings Ron with him to Hagrid's shack for tea. Harry and Ron are disconcerted by Hagrid's huge and fierce-looking dog, Fang, but discover that he is gentle. Hagrid tells Harry that he is overreacting to Snape's treatment, asserting that Snape would have no reason to hate him. Harry happens to notice an article from the wizard newspaper, the Daily Prophet, detailing a break-in that occurred at Gringotts bank in a vault that had been emptied earlier in the day. He realises that it happened on his birthday, the day he and Hagrid went to Gringotts. Furthermore, he remembers that Hagrid emptied vault seven hundred and thirteen, taking a small package with him as he left. Harry leaves Hagrid's, his mind filled with questions.",
    "section": "Chapter 8: The Potions Master",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry has been at Hogwarts for around two weeks when he finds out that the Gryffindors will have flying lessons with the Slytherins, much to his disliking. Harry does not want to spend more time with Malfoy than he has to. However, Harry finds that he is quite a natural at flying. Madam Hooch leads the class, gently sending the new fliers off the ground. Neville has an accident when his broom runs amok and breaks his wrist. Madam Hooch takes him to the Hospital Wing telling everyone to stay on the ground while she is away. Malfoy notices a Remembrall belonging to Neville, picks it up, and begins to fly around with it. Harry goes after Malfoy, who throws the ball in the air. Harry catches it spectacularly and lands safely back on the ground. Just then, Professor McGonagall arrives, reprimanding Harry and ordering him to follow her. But instead of punishing him, McGonagall introduces him to Oliver Wood, captain of the Gryffindor Quidditch team, and makes him the Gryffindor team's new Seeker.\n\nAt dinner, Harry excitedly tells Ron about joining the Quidditch team but tells him that Wood wants it to be a secret. Malfoy comes over with his cronies Vincent Crabbe and Gregory Goyle and teases Harry about getting in trouble earlier. The tension grows and Malfoy challenges Harry to a wizard's duel. Harry accepts, in spite of Hermione's attempt to dissuade them from breaking the school rules. As Harry and Ron sneak out later that night, Hermione tries to stop them but gets locked out of the dorm (the Fat Lady has gone for an evening stroll) and must tag along. Neville also joins them, as he has forgotten the password to the common room and ended up sleeping on the floor outside. They arrive at the Trophy Room, the site of the duel, but Malfoy is nowhere to be found. Suddenly, they hear Argus Filch and his cat, Mrs Norris, enter the room. With it obvious that Malfoy tricked them, they begin to hide and then run away. Not sure where they are going, they accidentally end up in the forbidden area on the third floor, staring at a large and scary three-headed dog. The children manage to get back to their dorm safely, though they are terrified. Hermione reprimands Harry, but stirs his curiosity by pointing out that the dog was standing on a trapdoor.",
    "section": "Chapter 9: The Midnight Duel",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "The next morning, Harry and Ron are discussing what the dog could be guarding. They also try to find a way to get Malfoy back for tricking them. About a week later, Harry receives a Nimbus 2000, a racing broomstick, along with a note from Professor McGonagall summoning him to Quidditch practice. Malfoy tells Harry that first-year students are not allowed broomsticks. Malfoy then tries to report Harry to Professor Flitwick who just expresses admiration for Harry's talent having heard from McGonagall. Harry later meets Oliver Wood to learn the basics of Quidditch, including the various positions on a standard Quidditch team and the implements used in the game. Oliver explains Harry's role as a Seeker: his job is to avoid other players and catch the Golden Snitch. A Quidditch game cannot end until the Snitch is caught, making the Seeker the most important player on a team. On Hallowe'en, Flitwick begins teaching his students how to make things fly, using the Wingardium Leviosa spell. Hermione is the first to succeed; Ron, offended by her air of superiority, utters a nasty comment that Hermione overhears. Harry notices her running off in tears.\n\nHarry and Ron arrive at the Hallowe'en feast to hear Professor Quirrell, the teacher of Defence Against the Dark Arts, burst in and give a terrifying announcement about a twelve-foot troll in the building. As the prefects lead the students back to their dorms, Harry realises that Hermione does not know about the troll. They head off to warn her and come upon the troll. Unwittingly, they lock it in the girls' bathroom only to realise that Hermione is trapped in there with the troll. Using teamwork, magic, and some luck, the two of them manage to knock out the troll. Professor McGonagall finds them and begins to scold the boys. Hermione interjects that Harry and Ron were looking for her. She then lies, saying that she went to face the troll herself and that Ron and Harry had been trying to save her from it. At this point, Hermione befriends them.",
    "section": "Chapter 10: Hallowe'en",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "As November begins, so does the Quidditch season, and Harry is about to play in his first match against Slytherin. To prepare, Harry borrows a book entitled from Hermione. Professor Snape discovers Ron, Harry, and Hermione out with the book one evening and confiscates it from Harry on the pretext that library books may not be taken outside of the school, which Harry believed to be a feeble excuse. Harry's suspicions of Snape continue to grow. Harry starts to notice that Snape is limping. Going off to retrieve the book from Snape, Harry overhears Snape talking to Argus Filch about the fact that the three-headed dog has attacked him, leaving a cut on his leg, which makes Harry even more suspicious.\n\nThe next morning, the Quidditch match begins. Harry spots the Golden Snitch early in the game and is flying toward it when the Slytherin Captain pushes him out of the way and is penalised. Later in the game, Harry's broom begins jerking uncontrollably. Hagrid comments that only Dark magic could make a broomstick so hard to manage. Hermione notices that Snape is staring at Harry and muttering to himself, signs of casting a curse. As two of Harry's teammates, the Weasley twins, try to rescue Harry in the air, Hermione rushes over to Snape in such a hurry that she knocks Quirrell over, sneaks behind Snape, and sets his robe on fire. Suddenly, the spell on Harry's broom is broken and Harry is once again in control. He starts speeding toward the ground and lands, catching the Snitch in his mouth and nearly swallowing it.\n\nHagrid takes Harry back to his hut with Hermione and Ron, who tells Harry that Snape was putting a curse on his broomstick. Hagrid does not believe this, asking why Snape would try to kill Harry. Harry tells Hagrid about Snape getting injured by the dog in the third-floor corridor. Hagrid involuntarily reveals that the three-headed dog, Fluffy, is his, and that what the dog is guarding is a secret known only to Albus Dumbledore and a man named Nicolas Flamel.",
    "section": "Chapter 11: Quidditch",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Christmas is approaching. Malfoy teases Harry about having to stay at Hogwarts for the holiday, as he does not have parents. Harry, however, is looking forward to spending Christmas away from the Dursleys, especially because Ron is also staying at Hogwarts, as Mr and Mrs Weasley are going to visit Ron's older brother Charlie in Romania. The day before the holidays, Hermione tears Ron and Harry away from a conversation with Hagrid to look in the library for more information about Nicolas Flamel. The librarian, Madam Pince, catches Harry prowling around the restricted-books section of the library and kicks him out.\n\nOn Christmas Day, Harry and Ron awaken to presents, though Harry's are fewer. Harry receives a flute from Hagrid, a 50 pence coin from the Dursleys, some fudge and Chocolate Frogs from Hermione, and a knitted jumper from Ron's mother. He also receives an Invisibility cloak accompanied only by an anonymous note telling him that the cloak once belonged to Harry's father and to \"use it well.\" That night, after a satisfying Christmas dinner and after Ron has fallen asleep, Harry tries on his Invisibility Cloak. Unseen, he is able to go to the library's restricted-books section. But one of the books starts screaming when he opens it, so he quickly leaves. He passes Filch and hides in an old classroom as Filch is getting Snape to help him search the corridors. Inside stands an old mirror in a gold frame with the inscription \"Erised stra ehru oyt ube cafru oyt on wohsi\" (\"I show not your face, but your heart's desire\"). Harry looks in the mirror and sees many people standing behind him, but when he turns around in the room, he sees no one. Suddenly, he recognises that two of the people in the mirror are his dead mother and father. He tries to speak to them, but they can only communicate by waving. Harry lingers there a while but eventually returns to his room.\n\nThe next night, Harry brings Ron with him to the mirror room. Ron does not see Harry's parents in the mirror but instead sees himself holding the Quidditch Cup. Mrs Norris, Filch's prowling cat, notices them. On the third night, Ron is afraid of being caught and does not want to go back, as he does not trust the mirror, so Harry returns alone. There he finds Albus Dumbledore. Dumbledore explains to Harry that the mirror, which is known as the Mirror of Erised, displays the deepest desires of whoever looks into it. Harry is relieved to find that Dumbledore is not angry. However, he warns Harry that men have wasted away and been driven mad before the mirror and informs Harry that the mirror will be moved to a new location and tells him not to go looking for it. When Harry asks what Dumbledore sees in the mirror, his answer is \"himself holding a pair of socks.\"",
    "section": "Chapter 12: The Mirror of Erised",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry finds it hard to forget the image of his parents. Quidditch practice continues on even harder and it is revealed that Snape will referee the next match. Malfoy performs a leg-locker curse on Neville, and to cheer him up, Harry tells Neville he is \"Worth twelve of Malfoy.\" Harry suddenly remembers that he read the name Nicolas Flamel on a chocolate frog card, which reminds Hermione that she had seen the name in a book she picked up from the library, and the team discover that he was a famous alchemist who is the only known maker of the Philosopher's Stone, whose powers include turning any metal to gold and producing the Elixir of Life, a potion that can make the drinker immortal.The Gryffindor versus Hufflepuff Quidditch match arrives and Snape, who referees the match, is predictably biased, while on the stands Ron and Neville get into a scuffle with Malfoy, Crabbe, and Goyle after Malfoy made some rude comments towards the players of their house's team as well as both of them. Harry catches the snitch and wins the match under five minutes, though Ron did not see this due to fighting Draco Malfoy, and Neville is sent to the hospital wing due to the injuries he sustained from fighting both Crabbe and Goyle. Later, Harry notices and follows Snape into the Forbidden Forest by broomstick where he meets Quirrell and they speak of the Philosopher's Stone. Harry thinks that Snape is trying to force Quirrell to help him get the stone so he can get rich, to the alarm of both Ron and Hermione who fear Quirrell will talk.",
    "section": "Chapter 13: Nicolas Flamel",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry, Ron and Hermione meet with Hagrid, who confirms the Stone is being kept at Hogwarts. Hermione charms him into talking about the enchantments used to guard it: Fluffy, the three-headed dog, is Hagrid's, along with enchantments from Professors Sprout, Flitwick, McGonagall, Quirrell, and Snape. After this, Harry complains about the high temperature in Hagrid's hut, only to discover he has a Norwegian Ridgeback dragon egg, which he names Norbert once it has hatched. Malfoy, who has been spying then, discovers the dragon. To solve the problem, they convince Hagrid to send the dragon off to Ron's brother Charlie. Ron's hand is bitten by the dragon, and he is sent off to Madam Pomfrey. Harry and Hermione smuggle Norbert in a crate up to the tallest tower under Harry's Invisibility cloak and on the way they see Professor McGonagall hauling Malfoy away to detention for being out of bed at night and speaking \"lies\" about Harry and a dragon. They pass the crate off to Charlie's friends, and head back down the stairs, where they meet up with Filch, realising too late they have left the Invisibility Cloak behind.",
    "section": "Chapter 14: Norbert the Norwegian Ridgeback",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Filch takes Harry and Hermione to McGonagall's office, where they meet Neville. McGonagall, very disappointed, takes 50 points each from the three of them and gives them all detention, which they will serve with Malfoy. Their popularity with the other students suffers because of this. A week or so before exams, Harry hears Professor Quirrell, sounding as if he is being threatened. So, Harry heads to the library to tell Ron and Hermione. They are convinced Snape was threatening Quirrell and means to steal the Stone soon, and Hermione suggests they go to Dumbledore. Harry refuses, saying that they have no proof.\n\nHarry, Hermione, and Neville receive notes from Professor McGonagall telling them their detention will begin at eleven that night. Filch takes them out to the Forbidden Forest, where Hagrid awaits to take them in to do a bit of investigating. Hagrid shows them some silver unicorn blood and says they need to find the unicorn that is hurt. They split up, with Hagrid taking Harry and Hermione, and Neville and Malfoy going with Fang. Hagrid encounters a few centaurs, named Ronan and Bane, but gets no useful information from them. Suddenly, Hagrid sees red sparks in the air, signalling the other party is in trouble. He runs for them and returns, scolding Malfoy for startling Neville into sending up the sparks. Hagrid switches Harry and Neville, sending Harry off with Malfoy instead. They eventually find the dead unicorn and see something drinking its blood. Malfoy screams and runs with Fang, leaving Harry, who is saved from the figure by a centaur, named Firenze, who tells Harry that unicorn blood can keep you alive, even if you are an inch from death, but curses you with a half-life in the process. He then reveals that the person who was drinking it was doing so to remain alive until they were able to drink the Elixir of Life and wants the Stone. He also asks Harry if he would not know anyone who has been waiting for years to regain power and Harry realises that the mysterious figure was a weakened but still alive Voldemort.\n\nBack in the common room, Harry tells Hermione and Ron Voldemort's in the forest and that Snape wants the Stone to help Voldemort restore his powers. Afterwards, going into his bed, Harry finds that his Invisibility Cloak has been returned to him.",
    "section": "Chapter 15: The Forbidden Forest",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "After finishing their exams, Harry realises the suspicious coincidence in Hagrid wanting a dragon more than anything else, only to meet a stranger who had one to give him. He, Ron, and Hermione run to ask him about the man who gave Norbert to him, and he says he never saw his face because he kept his hood up. Hagrid also mentions that they talked about Hogwarts and Fluffy the three-headed dog. He also mentions that the stranger gave him drinks while getting information out of him. Hagrid lets it slip how to get past Fluffy, which sends Harry, Ron and Hermione off. They head for Dumbledore's office, only to see McGonagall, who tells them he has left for London. After Harry reveals that they know about the Stone, McGonagall insists no one could steal the Stone. The trio realise that Dumbledore has been lured away and that Snape's going after the Stone that night so they decide to head out that night to try to get it themselves. After Hermione curses Neville in a Full Body-Bind Curse for refusing to allow them to leave, they head up to the third-floor room and start their intense trip into the seven Philosopher's Stone Chambers. They find the door ajar, and a harp in the room. Harry plays the flute Hagrid got him for Christmas, and Fluffy goes back to sleep. They head down through the trapdoor. They land in Professor Sprout's room, full of Devil's Snare, which almost smothers them before Hermione lights a fire and drives it off.\n\nThe next room, Professor Flitwick's, holds a bunch of flying keys and some broomsticks. Harry finds a silver one with a broken wing that is different from the others and catches it, unlocking the next door with it. The next room is Professor McGonagall's, and has a large chessboard, for a game of Wizard's Chess that Ron helps them win, at the cost of having to sacrifice himself and getting knocked out. Harry and Hermione continue to the next room, Professor Quirrell's, where they find an unconscious troll laying on the floor. Lastly, they enter Professor Snape's room and find seven potions in bottles along with a roll of paper giving clues on which one to drink to continue, noting that three bottles have poison, two have nettle wine, one will send the drinker back, and the other will let the drinker move forward into the next room. Hermione tells Harry that it is a test of logic and not magic wherein most wizards fail. She solves the puzzle, and at Harry's instruction, drinks the one that will allow her to head back through the purple flame, while Harry drinks the one to head into the black flame and into the final room, where he is surprised at whom he sees.",
    "section": "Chapter 16: Through the Trapdoor",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "It is Quirrell whom Harry sees in the room, not Snape. Harry, astonished, hears Quirrell tell him that, next to Snape, no one would expect him to try to steal the Stone and that Snape was actually protecting Harry. Harry notices the Mirror of Erised, and Quirrell stops to examine it, saying it is the key to getting the Stone. To distract him from the Mirror, Harry questions Quirrell, who says he is serving Lord Voldemort, and although Snape hated Harry because of his father, he never wanted Harry dead. He explains how Snape and Harry's father went to school together when they were younger, and how it was there where their hatred against each other started. Quirrell asks for help from his master to get the Stone, and a snake-like voice tells him to use the boy. Harry is told to look into the Mirror. He sees his reflection pull the Stone out of his pocket and put it back in, and Harry feels it drop into his own pocket. He tells Quirrell that he sees himself shaking hands with Dumbledore, after winning the House Cup for Gryffindor. The snake-like voice tells Quirrell Harry is lying and Quirrell takes his turban off to show Harry what lies on the back of his head. As Quirrell turns around, Harry is shocked to see another face where the back of Quirrell's head should be. The face has red eyes and a snake-like slit where the nose should be. Harry realises this is the face of Voldemort and Voldemort demands Harry give him the Stone. Harry refuses and runs, but Quirrell seizes him. However, the contact with Harry's skin burns Quirrell and causes him to have boils all over the area in which Harry touched him. Harry grabs Quirrell's face, then his arm, and holds on, with the blinding pain in his head building, until he feels the arm wrenched away before he blacks out. He awakes in the hospital wing with Dumbledore there, telling him Quirrell did not succeed at getting the Stone, and indeed the Stone has been destroyed. In spite of this, there are other ways in which Voldemort can return. He cannot be killed, and he left Quirrell to die. Dumbledore explains the reason why Quirrell could not touch Harry was because Harry's mother had died to save him, protecting him with her love.",
    "section": "Chapter 17: The Man with Two Faces",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry also told Dumbledore about what Quirrell mentioned to him earlier regarding Snape hating Harry due to hatred for his father. Dumbledore responds that Snape was only grudgingly protecting Harry this year to pay off a debt he owed due to James Potter saving his life during their Hogwarts years. Harry then receives a visit from Ron and Hermione, who reveal that Slytherin came in first for the House Cup and, with Harry unable to play in the championship Quidditch match, Ravenclaw easily won the match, before Madam Pomfrey forces them out. Hagrid shows up later and gives Harry a book of photos of his parents and family. The following day, at the end of term feast, Dumbledore awards some last-minute points for the recent events. He gives Ron and Hermione fifty points each, and Harry sixty, which places them in a tie with Slytherin for first place. Dumbledore then recognises that while it is hard to stand up to enemies, it is even harder to stand up to friends as Neville did, and he awards Neville 10 more points, which was the most house points Neville had ever gotten. This puts Gryffindor in the lead and the winners of the House Cup, to much rejoicing from everyone but the Slytherins. Not only were Gryffindor students happy, but Hufflepuff and Ravenclaw were happy to see Slytherins downfall. Soon, their trunks are all packed, and they take the Hogwarts Express back towards the muggle world. Harry, Ron and Hermione all say their goodbyes before heading home.",
    "section": "Chapter 17: The Man with Two Faces",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"2\" border=\"2\"\n!Spell\n!Usage\n|-\n|Levitation Charm\n|The Wingardium Leviosa spell was taught to first-years in Professor Flitwick's Charms class.\n|-\n|Unlocking Charm\n|Hermione used Alohomora to unlock a door on third-floor corridor when trying to avoid being caught out of bed.\n|-\n|Leg-Locker Curse\n|Malfoy used this spell on Neville, which Hermione later identified and noted the incantation as Locomotor Mortis''.\n|-\n|Full Body-Bind Curse\n|Hermione used this spell on Neville when he tried to stop Harry, Ron and Hermione from leaving the common room at night.\n|-\n|Bluebell flames\n|Believing Snape was cursing Harry's broom during his first Quidditch match, Hermione used this spell to set Snape's robes aflame.\n|-\n|Curse of the Bogies\n|At least mentioned to his first-year class by Quirinus Quirrell.\n|-\n|Anti-Cheating Spell\n|These charms were used on exam papers.\n|-\n|Vanishing Spell (possibly)\n|This may have been the spell inadvertently cast by Harry when he freed the boa constrictor.\n|}",
    "section": "List of spells first introduced",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"2\" border=\"2\"\n! width=\"15%\" |Character\n! width=\"15%\" |Killed by\n! width=\"15%\" |Cause of death\n! width=\"15%\" |Circumstances\n|-\n|Lily Potter\n| rowspan=\"2\" |Lord Voldemort\n| rowspan=\"2\" |Killing Curse\n| rowspan=\"2\" |(Mentioned only) Voldemort's attempt to kill the young boy in the prophecy.\n|-\n|James Potter\n|-\n|Quirinus Quirrell\n|Lord Voldemort/Harry Potter\n|Voldemort's departure from his body and critical injuries from Harry Potter.\n|His body was left by Voldemort to die after being possessed.\n|}",
    "section": "List of deaths",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "*J. K. Rowling came up with the idea for the book after the train she was on (which was returning to London) was delayed for four hours.\n*Scholastic published in November 2000 a Collector's Edition that includes a pen-and-ink drawing by J.K. Rowling of Harry Potter at no.4 Privet Drive (which was then published on Pottermore) with a unique note. A 10th Anniversary Edition featuring a drawing and a note about Severus Snape by J.K. Rowling was also published by Scholastic in 2008.\n*To mark the 20th anniversary of first publication, Bloomsbury Publishing published four House Editions of the book in 2017. The 20th Anniversary Editions each feature the individual house crest on the jacket and sprayed edges in the house colours. New extra content includes fact files, profiles of favourite characters and line illustrations exclusive to each house.\n*A first edition of the book containing hand drawings and annotations (with a total of 43 personal additions: 20 original illustrations as well as comments scrawled in the margins) by J.K. Rowling was sold at an auction for £150,000 in 2013. It has been on exhibit at the Edinburgh's Writers' Museum since Thursday, 8 December 2016.\n*This was the only book to be written during the time the events in the books were taking place.\n*This is the only book in the series to be released before the defeat of Lord Voldemort on 2 May, 1998.\n*This book and are the only two books in the series to not have a chapter title named after the title of the book. \n*For Chapter 5, sitting under a tree in a local park in Edinburgh, J. K. Rowling came up with the passage which was the introduction of Ollivanders.",
    "section": "Behind the scenes",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry01english.jpg|British Children's Edition, published by Bloomsbury\n9780747558194.gif|British Celebratory Edition (paperback)\nStone Special Edition.jpg|British Special Edition (hardback)\nHarry Potter and the Philosopher's Stone - Bloomsbury Original Adult Edition.jpg|British original Adult Edition\nHarry Potter and the Philosopher's Stone – Bloomsbury Adult Edition.jpg|British Adult Edition\nNormal PS Signature.jpg|British Signature Edition (paperback and hardback)\nHarry Potter and the Philosopher's Stone new adult edition.jpeg|British 2013 Adult Edition (paperback)\nHarry Potter and the Philosopher's Stone – Bloomsbury 2014 Children's Edition (Paperback and Hardcover).jpg|British 2014 Children's Edition (paperback and hardback)\nHarry Potter and the Philosopher's Stone – Bloomsbury 2014 Children's Edition (Large Print).jpg|British 2014 Children's Edition (large print)\nHarry Potter and the Sorcerer's Stone cover.jpg|American, ''Harry Potter and the Sorcerer's Stone'' (paperback and hardback), published by Scholastic\nHarry Potter and the Philosopher's Stone – Alternative US paperback, published by Arthur A. Levine.jpg|American alternative paperback\nHarry Potter and the Philosopher's Stone – Scholastic School Market Edition.jpg|American School Market Edition\nHarry Potter and the Philosopher's Stone – Scholastic Leather Bound Deluxe Edition.jpg|American Leather Bound Deluxe Edition\nHarry Potter and the Philosopher's Stone – Scholastic Tenth Anniversary Edition.jpg|American 10th anniversary edition\nHarry Potter and the Philosopher's Stone – Scholastic Fifteenth Anniversary Edition (Paperback).jpg|American 15th anniversary edition (paperback)\nUS 2018 paperback 01 PS.jpg|American 20th anniversary edition (paperback)",
    "section": "English-language",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry Potter and the Philosopher's Stone – Arabic.jpg|Arabic, هاري بوتر وحجر الفيلسوف\nHarry Potter and the Philosopher's Stone – Bengali.jpg|Bengali, হ্যারি পটার অ্যান্ড দ্য ফিলোসফার্স স্টোন\nHarry Potter and the Philosopher's Stone – Bulgarian.jpg|Bulgarian, Хари Потър и Философският камък, published by Egmont Bulgaria\nHarry Potter and the Philosopher's Stone – Croatian.jpg|Croatian, Harry Potter i Kamen mudraca\nHarry Potter and the Philosopher's Stone – Faroese.jpg|Faroese, Harry Potter og vitramannasteinurin, published by Bókadeild Føroya Lærarafelags\n800px-הארי פוטר 1.JPG|Hebrew edition\nLithuanian original 01 PS.jpg|Lithuanian, Haris Poteris ir Išminties Akmuo\nHarry-Potter-e-a-Pedra-Filosofal-livro. Jpg|Brazilian Portuguese, Harry Potter e a Pedra Filosofal, published by Rocco\nГп.jpg|Russian, Гарри Поттер и Философский Камень, published by Росмэн\nHarry Potter Cover 1 Serbian.jpg|Serbian, Hari Poter i Kamen Mudrosti, published by Evro Giunti\nHarry potter in kamen modrosti 1.jpg|Slovenian, Harry Potter in Kamen Modrosti\nIndir.jpg|Turkish, Harry Potter ve Felsefe Taşı",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Harry Potter and the Philosopher's Stone – Albanian.jpg|Albanian edition\nHarry Potter and the Philosopher's Stone – Armenian.jpg|Armenian, 2004 edition Հարրի Փոթթերը Եվ Փիլիսոփայական քարը.\nHarry-Potter-Armenian.jpg|Armenian, 2016 edition published by Zangak Հարրի Փոթթերը Եվ Փիլիսոփայական քարը.\nAzerbaijani 01 PS.jpg|Azerbaijani, Harri Potter və Fəlsəfə Daşı, published by Qanun nəşriyyatı\nHarry Potter and the Philosopher's Stone – Belarussian.jpg|Belarusian, Гары Потэр і філасофскі камень\nBosnian 01 PS.png|Bosnian, Harry Potter i kamen mudrosti, published by Buybook\nHarry Potter and the Philosopher's Stone – Breton.jpg|Breton, Harry Potter ha Maen ar Furien\nBulgarian 2019 hardback 01 PS.png|Bulgarian 20th anniversary edition\nHarry Potter and the Philosopher's Stone - Catalan.jpg|Catalan, Harry Potter i la pedra filosofal\nSimplified Chinese 2008 Collector's Edition 01 PS.png|Simplified Chinese (China) 2008 Collector's Edition, 哈利波特与魔法石, published by People's Literature\nHarry Potter and the Philosopher's Stone - Chinese.jpg|Simplified Chinese (China) 20th anniversary edition\nHarry Potter and the Philosopher's Stone - Taiwan.jpg|Traditional Chinese (Taiwan) 20th anniversary edition\nHarry Potter and the Philosopher's Stone – Czech.jpg|Czech, Harry Potter a Kámen mudrců, published by Albatros\nDanish cover vol1.jpg|Danish, Harry Potter og De Vises Sten, published by Gyldendal\nHarry Potter and the Philosopher's Stone – Danish 2.jpg|Danish edition\nDanish adult cover 1.jpg|Danish adult edition\nDanish 2012 paperback 01 PS.jpg|Danish 2012 paperback\nDutch original 01 PS.jpg|Dutch, Harry Potter en de Steen der Wijzen, published by De Harmonie and Standaard\nDutch Philosopher's Stone book cover.jpeg|Dutch (the Netherlands) 2010 pocket edition, published by Uitgeverij De Harmonie\nFinnish Book 1 cover.jpg|Finnish, Harry Potter ja viisasten kivi, published by Tammi\nFrench Book Cover11.jpg|French original paperback, ''Harry Potter à l'école des sorciers'', published by Éditions Gallimard\nHarry Potter and the Philosopher's Stone - French.jpg|French reprinted paperback\nFrench Book 1 cover.jpg|French hardback\nFrench T1 (2011 new edition).png|French 2011 paperback\nFrench T1 (2016 new edition).jpg|French 2016 paperback\nGerman 01 PS.jpg|German, Harry Potter und der Stein der Weisen, published by Carlsen Verlag\nGerman Adult Edition 01 PS.png|German adult edition (hardback)\nGerman 2013 Pocket 01 PS.png|German 2013 Anniversary Pocket Edition (paperback)\nGerman 2018 hardback 01 PS.png|German 20th anniversary edition\nHarry Potter and the Philosopher's Stone – Hungarian.jpg|Hungarian, Harry Potter és a Bölcsek Köve\nIndonesian 01 PS 9786020337647.jpg|Indonesian, Harry Potter dan Batu Bertuah\nItalian 01 PS.jpg|Italian, Harry Potter e la pietra filosofale, published by Adriano Salani Editore\nItalian 2021 redesign 01 PS.png|Italian 2021 redesign\nJapanese original hardback 01 PS.png|Japanese original hardback, published by Say-zan-sha\nJapanese shinsouban hardback 01 PS.jpg|Japanese 20th anniversary edition\nLithuanian 2020 hardback 01 PS.png|Lithuanian 20th anniversary edition\nHP1BOX.png|Brazilian Portuguese collector's edition\nRussian 2008 Black Deluxe Edition 01 PS.png|Russian 2008 Black Deluxe Edition\nSlovak 2020 exclusive box set 01 PS.png|Slovak 20th anniversary edition, Harry Potter a Kameň mudrcov, published by IKAR\nSpanish 01 PS.jpg|Spanish, Harry Potter y la piedra filosofal, published by Ediciones Salamandra\nSpanish 15th anniversary 01 PS.jpg|Spanish 15th anniversary edition\nSwedish 01 PS 9789188877666.jpg|Swedish, Harry Potter och De Vises Sten, published by Tiden\nThai 2020 hardback 01 PS.jpg|Thai 20th anniversary edition, แฮร์รี่ พอตเตอร์ กับ ศิลาอาถรรพ์, published by Nanmeebooks\nHarry-Potter 1-Felsefe-tasi-8266.jpg|Turkish edition\nPS Ukrainian edition.jpg|Ukrainian, Гаррі Поттер і філософський камінь, published by А-БА-БА-ГА-ЛА-МА-ГА\nHarry Potter and the Philosopher's Stone – Welsh.jpg|Welsh, Harri Potter a Maen yr Athronydd\n\n}}",
    "section": "Translations (alternative cover)",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "Jim Kay was commissioned to do the full coloured illustrated edition, with all editions in over twenty languages using the same cover art. The book covers are only of slight variations due to title, text placements, and publisher's logos. The illustrated edition features over 100 full-colour illustrations. MinaLima Design was also hired to design an illustrated version.\n\nBloomsbury 01 PSIE cover - Jim Kay.png|UK Illustrated Edition (Bloomsbury)\nScholastic 01 PSIE cover - Jim Kay.jpg|US Illustrated Edition (Arthur A. Levine Books)\n26cc0ad1-94ae-4d9b-98a5-28a687de2fc0.jpg|Turkish Illustrated Edition, Harry Potter ve Felsefe Taşı''\nhari_poter_01_-_kamen_mudrosti_ilustrovan.jpg|Serbian Illustrated Edition (Evro Book)\nHungarian Edition.jpg|Hungarian Edition\nHP1IllustratedITA.jpg|Italian Illustrated Edition (Salani Editore)\nHarry Potter and the Philosopher's Stone - French book cover.jpg|French Edition\nHarry Potter and the Philosphers Stone - Mina Lima cover.jpg|MinaLima Design illustrated design\nPhilsopher's_stone_Jim_Kay_Train.png\nPhilospher's_Stone_Jim_Kay_Unicorn.png\nPhilospher's_Stone_Jim_Kay_Boat.png\nPhilospher's_Stone_Hagrid_on_Bike.png\nPhilospher's_Stone_Hogwarts_Jim_Kay.png",
    "section": "Illustrated Editions",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "In February 2017, Pottermore announced that to celebrate of 20 years of Harry Potter, Bloomsbury had made four new special covers each for both paperback and hardback. Created by Levi Pinfold, he made unique covers for each of the Hogwarts houses. These editions will include fact files and profiles of favourite characters and will be available for a limited period only.\n\nPinfold1.PNG\nPinfold2.PNG\nPinfold3.PNG\nPinfold4.PNG\nPinfold5.PNG\nPinfold6.PNG\nPinfold7.PNG\nPinfold8.PNG",
    "section": "20th Anniversary Editions",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "The book was adapted into a film, starting the Harry Potter film series. The film ''Harry Potter and the Philosopher's Stone'' had its premiere on November 4th, 2001 in United Kingdom and on November 14th in the United States. It then had its wide release in both countries on November 16th. Chris Columbus is the director and Daniel Radcliffe, Rupert Grint, and Emma Watson starred in the film.",
    "section": "Film adaptation",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  },
  {
    "text": "*\n*\n*\n*Harry Potter and the Philosopher's Stone (character index)\n*First year\n*Harry Potter At Home\nca:Harry Potter i la pedra filosofal\ncs:Harry Potter a Kámen mudrců\nda:Harry Potter og De Vises Sten\nde:Harry Potter und der Stein der Weisen\nde2:Harry Potter und der Stein der Weisen\nel:Ο Χάρι Πότερ και η Φιλοσοφική Λίθος\nen:Harry Potter and the Philosopher's Stone\nes:Harry Potter y la piedra filosofal\net:Harry Potter ja tarkade kivi\nfi:Harry Potter ja viisasten kivi\nfr:Harry Potter à l'école des sorciers\ngl:Harry Potter e a pedra filosofal\nhe:הארי פוטר ואבן החכמים\nid:Harry Potter dan Batu Bertuah\nit:Harry Potter e la pietra filosofale\nja:ハリー・ポッターと賢者の石\nlt:Haris Poteris ir išminties akmuo\nnl:Harry Potter en de Steen der Wijzen\nno:Harry Potter og De vises stein\npl:Harry Potter i Kamień Filozoficzny (książka)\npt-br:Harry Potter e a Pedra Filosofal\nru:Гарри Поттер и философский камень\nsv:Harry Potter och de vises sten\nsl:Kamen modrosti (knjiga)\ntr:Harry Potter ve Felsefe Taşı\nuk:Гаррі Поттер і філософський камінь\nvi:Harry Potter và Hòn đá Phù thủy\nzh:哈利·波特与魔法石\n1\nCategory:Canon",
    "section": "See also",
    "name": "Philosopher's Stone",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 1,
    "source_book": "Philosopher's Stone"
  }
]