[
  {
    "text": "}}\n\n*Mary GrandPré (US)\n*Kazu Kibuishi (US) \n*Jim Kay (Illustrated Edition)\n*Olly Moss (Pottermore eBook)\n|interior=*Mary GrandPré (US)\n*Jim Kay (Illustrated Edition)\n|narrator=*Stephen Fry (UK)\n*Jim Dale (US)\n|publisher=*Bloomsbury (UK, Canada)\n*Scholastic (US)\n*Raincoast Books (Canada (formerly))\n*Yapı Kredi Yayınları (Turkey)\n|release date=8 July 1999\n|pages=*462 (UK)\n*435 (US)\n*512 (Turkey)\n|preceded by=\n|followed by=\n}}\n\nHarry Potter and the Prisoner of Azkaban'' is the third instalment novel in the Harry Potter series written by J. K. Rowling. It was first published in 1999.",
    "section": "General",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "To Jill Prewett and Aine Kiely, the Godmothers of Swing\n\nJill Prewett and Aine Kiely were JK Rowling's flatmates when she lived in Portugal. They used to visit a club/restaurant called \"Swing\" regularly. Because they spent so much time there, Jo called themselves its godmothers.",
    "section": "Dedication",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "\"Harry Potter is lucky to reach the age of thirteen, since he has already survived the murderous attacks of the feared Dark Lord on more than one occasion. But his hopes for a quiet term concentrating on Quidditch are dashed when a maniacal mass-murderer escapes from Azkaban, pursued by the soul-sucking Dementors who guard the prison. It's assumed that Hogwarts is the safest place for Harry to be. But is it a coincidence that he can feel eyes watching him in the dark, and should he be taking Professor Trelawney's ghoulish predictions seriously?\"",
    "section": "Book description",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry Potter spends another summer holiday with the Dursleys in mid-1993, and things haven't been that easy for him. Over the summer, the Dursleys have forbidden him to talk to any of the neighbours out of fear of him exposing his magical abilities. The separation from his magical supplies (e.g. his wand, his broomstick, spellbooks, etc.) have become a real problem for Harry, too, because his teachers at Hogwarts School of Witchcraft and Wizardry have given him a lot of summer homework. He has seized the opportunity to start it a week after his arrival home by sneaking some of his books upstairs and hiding them in his room while Aunt Petunia and Dudley go out to admire Uncle Vernon's new company car. None of the Dursleys have noticed him studying magic every night since then, and Harry has been very careful to avoid trouble with them, for his aunt and uncle have already been in a bad mood with him due to a telephone call they got from their nephew's best friend at Hogwarts, Ron Weasley, about which Vernon has furiously confronted him, even though Harry doesn't know how Ron got their home number. The incident must have simply made Ron warn their other friend Hermione Granger not to call, as Harry received no word from them afterwards. The only improvement in his relationship to the Dursleys that gets changed is that they have given him permission to let his pet snowy owl Hedwig out at night with a promise not to use her to send letter to Ron or Hermione, since Uncle Vernon couldn't take the screeching racket she makes while bored if she gets locked in her cage all the time.\n\nOn 31 July (Harry's thirteenth birthday), after midnight, Harry receives gifts and letters from Ron, Hermione, and Rubeus Hagrid, each wishing him a happy birthday and sending him a gift. According to Ron, his dad, Arthur Weasley, won a Daily Prophet Prize Draw for seven hundred galleons and has used it to take the family to Egypt to visit his eldest son, Bill, with the remainder being used to provide Ron with a new wand to replace the one that was broken last year. Harry also learns that Percy Weasley is entering his seventh year at Hogwarts and has been named Head Boy. According to Hermione, she and her parents are currently spending the holiday in France. Also, both Ron and Hermione mention in their letters they will be in London on the last week before term to pick up their school supplies and want Harry to join them. Hagrid hints in his letter the book he sent Harry will come in handy next term but he wants the reason for it to be a surprise until the term starts. Another letter from Professor Minerva McGonagall arrives, saying that third years are allowed to visit the village of Hogsmeade and that their guardian needs to sign the permission form in order for them to do so.",
    "section": "Chapter 1: Owl Post",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "When Harry awakes the next morning, he goes downstairs hoping to watch TV. Unfortunately for him, he finds his Uncle Vernon and Dudley already watching the news and sits down with them unnoticed as the channel's anchorman is halfway through the report on word from the Muggle Prime Minister out on the London streets of an escaped convict, Sirius Black, who Uncle Vernon comments looks like he came from an asylum rather than a prison. This is obviously because the mental state of Black's gaunt face and elbow-length hair is almost like comparing him to Harry, who luckily feels well groomed. The reporter then transitions to his report on the Ministry of Agriculture and Fisheries' announcement without implying beforehand which prison or asylum Black has escaped from, much to Uncle Vernon's confusion.\n\nNonetheless, Vernon announces to the family that his sister, Marjorie \"Marge\" Dursley, is coming to visit for a week. Harry agrees to behave normally during her visit, if his uncle will sign his permission form and has to send Hedwig to the Weasleys for the week due to Marge not knowing that Harry is a wizard. On the final night, when she calls his father, James Potter, a lazy good for nothing drunk, Harry loses his temper and accidentally inflates her. She explodes and Harry decides to take his school things and run away, fearing he will almost certainly be expelled from Hogwarts, after using magic outside school.",
    "section": "Chapter 2: Aunt Marge's Big Mistake",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "He reaches Magnolia Crescent and sees a black dog staring at him. In his shock, Harry falls and the Knight Bus, a triple-decker bus designed for wizard transportation, arrives. The dog vanishes and is nowhere in sight. Harry meets the Knight Bus's conductor, Stan Shunpike and the driver, Ernie Prang. Harry departs on the Knight Bus to the Leaky Cauldron in London. He learns from the Daily Prophet, Sirius Black, the same convict and a follower of Lord Voldemort, broke out of Azkaban, the first person to ever do so. Sirius was imprisoned for murdering thirteen people with a single curse in 1981, right after the Potters' murder. At the Leaky Cauldron, he meets the Minister for Magic, Cornelius Fudge, in person, though Harry has to pretend that he doesn't know him since Harry and Ron were technically breaking school rules during their previous school year when they saw him in Hagrid's Hut. After explaining that Marge has been restored to normal and her memory modified, to Harry's surprise, Fudge doesn't take any action against him stating that accidental uses of magic don't count as violations of the Decree for the Reasonable Restriction of Underage Sorcery. Fudge books a room for Harry, where he will stay for the rest of the summer, but refuses to sign Harry's Hogsmeade permission slip.",
    "section": "Chapter 3: The Knight Bus",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry spends the rest of the holidays in Diagon Alley, purchasing his school things and making sure not to make any unnecessary purchases. On the last day of the holidays, Harry meets up with Ron, Hermione and the rest of the Weasleys who are also staying at the Leaky Cauldron. When Hermione decides to spend her birthday money on a magical pet, to Ron's displeasure, Hermione purchases a cat named Crookshanks, who harasses Ron's pet rat Scabbers. At some point during the night, Harry overhears a conversation between Ron's parents, Arthur and Molly Weasley. From what he hears, he learns that when Voldemort met his downfall, Black lost everything, and is now trying to kill Harry. Harry realises that Fudge let him off because he was relieved to find Harry alive. He is unconcerned about Black, doubting that the escapee could harm him at Hogwarts, with headmaster Albus Dumbledore around.",
    "section": "Chapter 4: The Leaky Cauldron",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "The next day, shortly before Harry boards the Hogwarts Express, Arthur tries to warn him about Black and makes him promise not to go looking for Black no matter what he hears. Harry tells him that he already knows because he heard Mr and Mrs Weasley talking about it earlier. Harry is also confused and asks why he would go looking for somebody who wanted to kill him. On the train, Harry, Ron, and Hermione share a compartment with Professor Remus Lupin, the new Defence Against the Dark Arts teacher. After several hours, the train stops and a sinister, cloaked figure enters. It sucks the happiness out of Harry, who faints. The creature then approaches Harry, possibly to kiss him, until Lupin drives it off with a spell.\n\nAfter Harry recovers, Lupin hands him and the others some chocolate and explains that the creature was a Dementor, one of the Azkaban Guards, and that they were searching the train for Sirius Black. At Hogwarts, Draco Malfoy taunts Harry over his reaction to the Dementor. After getting inside, Professor McGonagall calls Harry and Hermione to her and takes them to her office. Once there, McGonagall reveals that Lupin had informed her by Owl Post of Harry's adverse reaction to the Dementor and wants him looked at by Madam Pomfrey to see if he's ill. The matron confirms that he's fine. After McGonagall's business with Hermione is concluded, they return to the Great Hall to find that they missed the sorting ceremony. Dumbledore announces the two changes in staffing during the year: Lupin, and Hagrid, who has been made the Care of Magical Creatures teacher due to the retirement of Professor Kettleburn. Dumbledore also announces that Dementors are to be stationed around the school as a precaution against Black.",
    "section": "Chapter 5: The Dementor",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Lessons start the next day. Harry, Ron and Hermione head to the North Tower for their first Divination lesson. They meet Sybill Trelawney and predict future events using tea leaves. Harry sees a black dog in his tea cup, which Trelawney identifies as the Grim, the omen of death. This worries Harry, as he remembers the black dog he saw when he ran away. In their next lesson, Transfiguration, Professor Minerva McGonagall assures Harry that Trelawney has predicted the deaths of a number of students, none of whom have died. In their Care of Magical Creatures lesson, Hagrid teaches them about hippogriffs (horse/eagle creatures).\n\nAlthough initially nervous, Harry successfully approaches and rides a grey hippogriff named Buckbeak. Later in the lesson, Malfoy, who had not been listening to Hagrid's lecture, insults Buckbeak, causing it to slash his arm with its talons. He is taken to the hospital wing, and Hagrid fears that he will take the blame for letting Buckbeak attack Malfoy, even though Malfoy provoked it in the first place. Harry and his friends offer to help him clear Buckbeak. This makes Hagrid sober up and finally notice that Harry's there. He angrily tells Harry off for leaving the castle after dark and escorts the trio back to Gryffindor Tower personally.",
    "section": "Chapter 6: Talons and Tea Leaves",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Later in the week, in Potions, Malfoy returns with a heavily bandaged arm. Although it is implied that he is exaggerating the seriousness of the injury, there is no way to prove it. Harry learns that Black has been sighted near Hogwarts. During the lesson, Malfoy hints that Black may be connected to Harry's past. In Defence against the Dark Arts, Lupin teaches the third years about Boggarts, shape-shifters that take the shape of a person's worst fear. The class then take on the Boggart, forcing it to assume a shape they find amusing. When it comes to Harry's turn he is sure the Boggart will turn into a Dementor but Lupin jumps in and repels the Boggart for him. Faced by Lupin, the Boggart takes the shape of a bright glowing orb. Harry is disappointed that Lupin does not let him fight the Boggart, thinking that Lupin feels he is not up to the task.",
    "section": "Chapter 7: The Boggart in the Wardrobe",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "In October, the Gryffindor Quidditch team practises hard for the upcoming Quidditch season, especially since this is their team captain Oliver Wood's final year at Hogwarts. Oliver believes that despite the misfortune which occurred during the previous two years their team should be able to win the Quidditch Cup before he graduates. Third years are also visiting Hogsmeade on Hallowe'en, and only Harry is not allowed, because his uncle did not sign his permission form. Harry spends the day in Lupin's office, drinking tea with him. Lupin tells him that he did not let Harry face the Boggart because he did not want the Boggart to become Lord Voldemort. Shortly afterwards, Snape appears with a mysterious potion for Lupin. Lupin claims to simply have an illness, and that he is aided by the potion.\n\nA few hours later, Ron and Hermione return. They reach the portrait of the Fat Lady and see it slashed and that the Fat Lady is gone. Peeves reveals that he saw her fleeing through another portrait after Sirius Black attacked her for not letting him into Gryffindor Tower. Dumbledore, Argus Filch, and Percy seek her out.",
    "section": "Chapter 8: Flight of the Fat Lady",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Every student is moved in the Great Hall to sleep while teachers search the castle. They fail to find any sign of Black, and Snape suggests that someone inside the castle helped Black gain entry. Dumbledore refutes this argument.\n\nNobody talks about anything but Sirius Black for the next few days. The Fat Lady refuses to return to work until Black is caught. Because of this, Dumbledore is forced to replace her with Sir Cadogan the Mad Knight. Nobody in Gryffindor House is happy about this both because he changes the password (which are ridiculously complicated) twice a day and because he's for the most part extremely annoying but there's nothing they can do because none of the other pictures wanted the job because of what happened to the Fat Lady. \n\nMeanwhile, because of the attack, an annoyed Harry gets placed under surveillance: Teachers find excuses to go down the halls with him, Percy Weasley, acting on his mother's orders, follows him everywhere like a guard dog. Professor McGonagall decides to reveal the truth to Harry but Harry reveals he already knows Black's after him. McGonagall explains that's why she doesn't want him practising Quidditch in the evenings but Harry states he's got to train. Professor McGonagall agrees and decides to ask Madam Hooch to be present.\n\nGryffindor's first Quidditch match is coming up, but due to Malfoy's injury, Slytherin cannot play. Gryffindor plays Hufflepuff instead. On the day before the match, Lupin becomes ill and Snape teaches his classes for him. Oddly, he ignores Lupin's syllabus and instead gives a lesson on werewolves and assigns the class to write an essay on werewolves.\n\nDuring the match, it is raining badly and Harry sees a large black dog resembling the Grim in the topmost empty row of seats in the Quidditch stadium. Dementors enter the match causing Harry to faint and fall from his broomstick. Harry realises that the screaming he had been hearing during his Dementor-induced fainting spells is his mother in her last moments.\n\nDumbledore saves Harry, but his Nimbus 2000 broomstick flies into the Whomping Willow and is destroyed. Hufflepuff wins the match shortly afterward. After the match, Harry wakes up in the Hospital Wing and learns what happened, including that Oliver Wood has declined Hufflepuff captain Cedric Diggory's offer for a rematch.",
    "section": "Chapter 9: Grim Defeat",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Alarmed by the adverse effects the Dementors have on him, Madam Pomfrey insists that Harry stay in the hospital wing for the rest of the weekend. The following week, Lupin is back teaching class and states that the class doesn't have to write the essay Snape assigned for them, though Hermione has finished hers. After class, Harry goes to Lupin wondering why the Dementors affect him so much. Lupin explains that Dementors are fear itself and they pull forth the horrors from a person's past, which is why just before he faints, Harry hears his mother screaming before she dies and why the Dementors affect him worse than anyone else. Harry asks Lupin if he can give him private lessons on the spell to drive off Dementors in case another one arrives at a Quidditch match. Lupin says he will, but after the Christmas holidays, citing his frequent illness.\n\nHufflepuff is defeated by Ravenclaw in their next Quidditch match, which gives the Gryffindor team a chance in the running for the Quidditch Cup. Harry, who uses an old school broom in training sessions, is busy looking to obtain a new broomstick for himself so Gryffindor can stand a chance in their remaining matches.\n\nDuring the last weekend before the holidays, while the eligible students visit Hogsmeade, Harry is yet again not able to go. To bring some Christmas cheer to Harry, Fred and George reveal they know secret passages in and out of Hogwarts. They give Harry the Marauder's Map as a Christmas present and instruct him on how to use it. It shows Hogwarts' secret passages, corridors, classrooms, offices, common rooms, etc., as well as every person's location within the castle and the grounds.\n\nHarry uses the Marauder's Map to sneak into Hogsmeade. He then meets Ron and Hermione in Honeydukes, where they were discussing what kind of sweets to get Harry. They visit the Three Broomsticks, a pub run by Madam Rosmerta. When Cornelius Fudge, Minerva McGonagall, Filius Flitwick, and Rubeus Hagrid arrive, Harry hides underneath their table to avoid being seen. The trio overhears a conversation between the group and Madam Rosmerta, in which they discuss how Sirius Black is a close childhood friend of Harry's father, James, and that he is Harry's godfather. The group goes on to talk about how the Potters learned how Voldemort had marked them for death by Dumbledore, who had been tipped off by a spy. Dumbledore had advised them to go into hiding using the Fidelius Charm, a concealment charm so powerful it can only be broken if the Secret Keeper, the person the spell is bound to, reveals it to the person the witch or wizard doesn't want to be found by. James Potter insisted on using Sirius Black despite Dumbledore offering to be his family's Secret-Keeper due to a fear that a friend of the Potters' had turned traitor and joined Voldemort as a spy because he trusted Black beyond all his other friends. One week later, Black sold out the Potters to Lord Voldemort, who met his downfall in Harry. This forced Black to run for it. Peter Pettigrew, another of James's friends, confronted Black for the betrayal and he and twelve Muggles were killed by Black with a single curse. Black was taken to Azkaban afterwards. It's also revealed that Black isn't affected by the Dementors at all. After they leave, Ron and Hermione stare at a devastated Harry.",
    "section": "Chapter 10: The Marauder's Map",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry is depressed both about the truth about Sirius Black and that no one bothered to tell him before. Harry is also continuing to have nightmares about Dementors and his mother screaming. During the start of the holidays, Ron and Hermione try to console Harry but Harry chooses to go to Hagrid's house to ask him about Sirius Black despite Ron and Hermione's protests. When the trio arrives at his house, they find him distraught about Buckbeak's upcoming hearing before the Committee for the Disposal of Dangerous Creatures, and Harry decides it is better not to bring Sirius Black up.\n\nHagrid reveals that he had a horrible experience with the Dementors during his brief time in Azkaban. He can't set Buckbeak free without the risk of being sent back there. The trio then decides to help Hagrid prepare his defence for Buckbeak's case.\n\nFor Christmas, among his other presents, Harry receives the best model broomstick ever released: the Firebolt. Hermione is not happy when she learns that it came without a note, and is driven out of Harry and Ron's dormitory after Crookshanks attacks Scabbers again. During Christmas dinner, Hermione reports the mystery gift to McGonagall, who sends it away to have it tested for tampering. Both Hermione and McGonagall suspect Black might have sent the broomstick and that it could be jinxed.",
    "section": "Chapter 11: The Firebolt",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry ceases speaking with Hermione, even though he knew she had good intentions with reporting the Firebolt. Ron is also no longer on speaking terms with Hermione because Crookshanks has been attacking Scabbers non-stop. Meanwhile, Harry starts his lessons with Lupin. Lupin tells Harry that the spell to drive off Dementors is called the Patronus Charm, instructs him in how to cast one, and lets him practise on a Boggart. Harry fails to produce a Patronus at first. This, however, is to be expected; the Patronus Charm is well beyond O.W.L. standard. During his first lesson, Harry learns that Lupin was a friend of his father James back during their days at Hogwarts, and also knew Sirius Black as well.\n\nIn January, Slytherin beats Ravenclaw in their Quidditch match. Gryffindor's chances of getting the Quidditch Cup are good, as long as they don't lose in their own match against Ravenclaw.\n\nBy February, Harry becomes quite good at producing a Patronus after a few lessons, but doesn't master it entirely. At the end of a lesson, Lupin explains the concept of a Dementor's Kiss and reveals that it will be Black's punishment, as an article in the Daily Prophet confirmed that the Ministry gave the Dementors permission to use the Kiss on Black when they find him. While thinking about the horror of the punishment, Harry runs into McGonagall on his way back to Gryffindor Tower. McGonagall gives Harry back the Firebolt, which has been proven not to be jinxed, and suggests that he practise with it before the match. Harry meets up with Ron and they decide to go make up with Hermione. Outside Gryffindor Tower, they bump into Neville who's in trouble because he lost a list. After the pair let him in, Neville tells Harry and Ron that he made a list of the passwords for Gryffindor Tower because Sir Cadogan is still changing them twice a day but somehow they got lost. Harry attempts to patch things up with Hermione but Scabbers disappears after they arrive at Gryffindor Tower, ruining any chance for Ron and Hermione's reconciliation.",
    "section": "Chapter 12: The Patronus",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "As March arrives, a new Quidditch match approaches: Gryffindor vs. Ravenclaw. Harry spends the last practice session before the match getting used to his Firebolt. During the game, just as Harry is about to catch the Snitch, Cho Chang, a fourth year Seeker for the Ravenclaw team, screams. Harry looks around and sees three Dementors in the stands. He reacts instantly, sending a full-fledged Patronus at the Dementors. Harry catches the Snitch before Cho Chang, winning the match.\n\nLupin compliments Harry on his Patronus and shows Harry that the \"Dementors\" were really Draco Malfoy, Vincent Crabbe, Gregory Goyle, and Marcus Flint, the Slytherin team captain, trying to sabotage Harry. A furious McGonagall takes fifty points away from Slytherin and sentences all four of them to detention as punishment. The Gryffindors celebrate until Professor McGonagall tells them to go to bed. But Ron still refuses to reconcile with Hermione.\n\nThat night, Ron wakes up to Sirius Black slashing his bed curtains in the boys' dormitory. Everyone thinks it might be a nightmare but the curtains are indeed ripped and Sir Cadogan proves Ron right beyond any reasonable doubt when he happily admits he let Sirius Black into Gryffindor Tower. Black apparently had the whole week's passwords on a piece of paper. A furious Professor McGonagall demands to know who wrote down the passwords and lost them, to which Neville admits responsibility.",
    "section": "Chapter 13: Gryffindor versus Ravenclaw",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Another search of the castle takes place, but Black evades capture again. Tighter security is put in place: Professor Flitwick is teaching the doors to recognise Sirius Black while Argus Filch boards up everything Black can use to sneak in except the passageway into Hogsmeade. Sir Cadogan is fired and the Fat Lady resumes her duty guarding Gryffindor Tower on the condition her portrait is to be guarded. Ron becomes an instant celebrity, which he enjoys. Neville, on the other hand, is in complete disgrace: Professor McGonagall is so furious with him that she strips him of his visitation rights to Hogsmeade for the rest of the school year, gives him a detention and forbids the other Gryffindors to tell him the password. His grandmother, Augusta Longbottom, sends him a Howler two days later.\n\nHagrid sends a letter to Harry, telling him that he and Ron are to meet him in the entrance hall so he can take them to his hut for tea. Other than learning that Buckbeak's trial is that week, Harry and Ron learn that Hagrid wants to talk to them on behalf of Hermione. Hagrid mentions their feud has been hurting Hermione more than they think, and that she is only concerned about protecting Harry from Sirius Black. Despite Hagrid's advice, Ron's anger reignites when Hermione threatens to tell McGonagall about the Marauder's Map, which Harry plans to use to sneak into Hogsmeade during the upcoming trip that Saturday.\n\nWhile on the trip that weekend, Harry uses his Invisibility Cloak to make a few stops with Ron before visiting the Shrieking Shack, a house that is supposedly filled with violent ghosts. Malfoy, Crabbe, and Goyle show up there and provoke Ron. Harry, using his cloak, attacks the trio and Malfoy catches a glimpse of Harry's head. Malfoy later reports the incident to Snape, who interrogates Harry after he returns from Hogsmeade. Snape finds the Marauder's Map, but is not able to discover what it does and is instead bombarded by insults from the map's makers. Lupin is summoned and claims ignorance about the map and Ron shows up and claims the map is a Zonko product that insults anyone who touches it. Afterwards, Lupin brings Harry and Ron to the entrance hall, where he confiscates the map and reprimands Harry for not handing in something that could aid in Black's capture. He also scolds him for risking his life to sneak into Hogsmeade, thus undervaluing his parent's sacrifice.\n\nOn their way back to Gryffindor Tower, Harry and Ron find Hermione, who informs them that the Ministry has decided to execute Buckbeak despite the help she provided for Buckbeak's defence.",
    "section": "Chapter 14: Snape's Grudge",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Buckbeak's impending execution causes the friends to reconcile. Ron promises to help Hermione work on filing an appeal for Buckbeak's case, since Harry will be too busy with Quidditch practice sessions for the final match. After Malfoy mocks Hagrid during one of his classes, Hermione smacks him in the face. She then accidentally skips Charms. In Divination, Hermione finally explodes and drops the class.\n\nIn May, the Quidditch final takes place: Gryffindor vs. Slytherin. Gryffindor needs to be more than fifty points ahead before Harry can catch the Golden Snitch in order to win the Quidditch Cup. On the morning of the match, Harry catches another glimpse of the dog, this time with Crookshanks. In the match, Gryffindor take an early lead, and Slytherin resorts to cheating. This helps the Gryffindor team to gain penalty shots and get further ahead. Harry manages to catch the snitch at the right moment, allowing Gryffindor to come in first in the overall points and win the Quidditch Cup at last.",
    "section": "Chapter 15: The Quidditch Final",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "The students take their end-of-year exams in June. Buckbeak's appeal is scheduled on the final day of the exams. After Harry's Divination final, Trelawney issues a genuine prediction that Voldemort's servant will return to him that night and Voldemort will once again rise to full power stronger than before. Meanwhile, Buckbeak's appeal fails, and it is decided that Buckbeak would be executed.\n\nThat night, after Hermione retrieves Harry's Invisibility Cloak from the one-eyed witch's hump (where he hid it after Malfoy spotted him in Hogsmeade), Harry, Ron, and Hermione use the cloak to go to Hagrid's cabin to console him before Buckbeak is executed. Hermione finds Scabbers in a milk jug and returns him to Ron. After the trio depart, Dumbledore, Fudge, a representative of the Committee for the Disposal of Dangerous Creatures, and the executioner, Walden Macnair, arrive. Buckbeak is then apparently executed.",
    "section": "Chapter 16: Professor Trelawney's Prediction",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Shortly afterwards, Scabbers escapes from Ron's grasp. Harry, Ron and Hermione run after him and spot the black dog and Crookshanks. After Ron catches Scabbers, the dog grabs Ron by the arm and pulls him in a passage under the Whomping Willow, breaking his leg in the process. Harry, Hermione, and Crookshanks follow after them. The passage leads them to the Shrieking Shack, where they find Ron, Scabbers, and Sirius Black. Black turns out to be an unregistered Animagus whose animal form is a black dog; he was the one who dragged Ron down into the Shrieking Shack.\n\nHarry manages to overpower and subdue Black, who admits that he is responsible for the death of his parents. Lupin then arrives and is accused by Hermione of being Black's accomplice and a werewolf. Hermione deduced this following Snape's lesson on werewolves, since Lupin was always absent on nights of the full moon and Lupin's Boggart turned into the moon. Lupin admits that he is a werewolf, but denies the charge of helping Black. He explains that he found out where Harry, Ron and Hermione went through the Marauder's Map, since he had helped to create it and knew that the three of them would visit Hagrid that night due to Buckbeak's execution. He also adds that he saw a supposedly dead person on the map with the trio; Peter Pettigrew, who is also an Animagus and had been living for years as Scabbers.",
    "section": "Chapter 17: Cat, Rat and Dog",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry, Ron and Hermione refuse to believe that Pettigrew is alive, pointing out that he was murdered by Black. Black denies this, and Lupin convinces him to tell Harry the truth of what happened. Lupin tells the story of how the Marauders came to be. He had been bitten as a child, and in those days there was nothing to be done about his transformation into a monster every month (he explains that the recently invented potion Snape has been making for him, the Wolfsbane Potion, suppresses the mental change and allows him to retain his human sense of self as a wolf as long as he drinks a gobletful every day the week before the full moon). Despite this, Dumbledore welcomed him to Hogwarts, and took precautions for his stay, having the Shrieking Shack and the passage leading to it built to provide Lupin with a safe place to transform. The Whomping Willow was planted on the entrance to the tunnel to prevent anyone from running into the transformed Lupin. The rumours that the Hogsmeade residents started about the Shack being haunted by violent ghosts were allowed to spread to keep people from guessing that it was actually a werewolf making those sounds.\n\nEventually, Lupin's friends, Sirius, Pettigrew and James Potter, discovered Lupin's secret, and became Animagi to support him. Sirius became a dog to keep Lupin under control with James, and Pettigrew became a rat so he could disable the Willow by scurrying under its branches and touching a certain spot on its trunk. Lupin admits that he has not told Dumbledore about Sirius being an Animagus, as it would have meant admitting that he had betrayed his trust and led three students into illegally becoming Animagi. He also reveals the reason for Snape's animosity towards him during the year: during their days at school, Sirius had played a near-fatal trick on Snape involving Lupin in his transformed form but James saved him. Snape thought both of them were involved with Sirius' trick. Just then, Snape arrives using Harry's Invisibility Cloak, which he had left at the foot of the Whomping Willow.",
    "section": "Chapter 18: Moony, Wormtail, Padfoot and Prongs",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Snape arrives and tries to arrest Lupin and Black, but Harry, Ron, and Hermione, curious to hear the rest of the story, disarm Snape (knocking him unconscious in the process). Sirius reveals he broke out of Azkaban after seeing the Weasleys in Egypt in the Daily Prophet. He saw Scabbers and immediately recognised it was Pettigrew in his Animagus form (Pettigrew was missing a finger, Scabbers was missing a toe). Black also realised that Pettigrew was in the perfect position to capture Harry and deliver him to Voldemort’s followers if they became strong again. He searched for Pettigrew to kill him, to avenge the Potters and protect Harry; Crookshanks helped, since he could tell that Scabbers was no rat and Black was no dog. Sirius explains after he gained Crookshanks' trust, Crookshanks helped him get into Gryffindor Tower by stealing Neville's list of passwords.\n\nAccording to Black, Pettigrew was the Potters' Secret-Keeper. Sirius believed he was too obvious a choice to be Secret-Keeper and at the last second convinced James and Lily to pick Pettigrew instead so he could be a decoy, not even telling Dumbledore or Lupin about the sudden change of plan. What Sirius hadn't realised was that Pettigrew was already a spy for Voldemort, with Pettigrew immediately revealing James and Lily's hiding place to his master. After the Potters' murder, Sirius confronted Pettigrew, who killed the twelve Muggles and faked his own death by cutting his finger and turning into a rat and escaping, thus framing Black for the crimes. Sirius was innocent all along and means no harm to Harry, Ron, and Hermione.\n\nBlack and Lupin force Scabbers to turn into Pettigrew. During their interrogation, Sirius explains the obvious reason why Pettigrew remained as a rat: he was afraid that Voldemort's followers would try to kill him, thinking Pettigrew betrayed Voldemort (as Voldemort met his downfall upon following Peter’s instructions). Black also knows that Pettigrew only stayed with the Weasleys to keep up on the news until he felt it was safe to find and rejoin his master.\n\nHermione asks how Sirius escaped. He reveals that the knowledge that he was innocent kept him sane: it was not a happy thought, so the Dementors could not drain it from him. He also often transformed into a dog, since Dementors cannot affect animal emotions. After learning where Pettigrew was and knowing Pettigrew would use the opportunity to capture Harry and regain favour with his allies, Black escaped while in his Animagus form. Black tells Harry that he would have died before betraying his parents, whom he loved as family, and at long last, Harry believes him. Pettigrew admits it's all true and begs for mercy, but is met with only disgust from everyone in the room. \n\nBefore Lupin and Sirius can kill Pettigrew, Harry stops them, saying that James would not want his two best friends to become killers. The group takes Pettigrew back to the grounds, where he will be handed to the Dementors.",
    "section": "Chapter 19: The Servant of Lord Voldemort",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Sirius and Harry talk about the former's friendship with the Potters, including that Sirius is Harry's godfather. Sirius tells Harry that he can choose to live with him if he wishes. Harry quickly and happily agrees, knowing this would mean he would never have to the return to the Dursleys.\n\nUnfortunately, the full moon rises, causing Lupin, who had not taken that day’s dose of Wolfsbane Potion, to turn into a werewolf. This allows Pettigrew to knock Ron out, turn into a rat, and escape. Harry and Hermione run after Lupin and Black (who has transformed into a dog). After seriously injuring Black, Lupin flees to the Forbidden Forest. By the Great Lake, a hundred Dementors arrive and suck the happiness from Harry, Hermione, and Black and attempt to perform a Kiss on them. Before they all faint, Harry sees a familiar figure across the lake conjure a powerful stag-shaped Patronus that drives all the Dementors away.",
    "section": "Chapter 20: The Dementor's Kiss",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry, Hermione, and Ron are taken to the Hospital Wing, and Black is taken to West Tower, where he is sentenced to a Dementor's Kiss. When Dumbledore arrives, Harry and Hermione try to tell him what actually happened, but Dumbledore tells them that, though he believes them, he cannot save Black, as the evidence against him is too great. Snape had lied about what happened earlier to Cornelius Fudge, and the Minister will not take the words of under-age students seriously.\n\nDumbledore gives the pair cryptic instructions and bids them good luck. Hermione then reveals she has a Time-Turner, a device that will take them back through time. McGonagall gave the device to her during the Sorting on their first day back; this explains why throughout the year, there had been occasions of Hermione taking multiple classes at the same time and apparently disappearing into thin air.\n\nHarry and Hermione travel three hours into the past, watching themselves move through previous events (starting from the trio sneaking out to Hagrid’s hut). They realise that Dumbledore wanted them to travel three hours back to not only save Buckbeak from being wrongfully executed, but also to use Buckbeak to free Black from West Tower. After narrowly rescuing Buckbeak at the right moment before Macnair can execute him (so Dumbledore and Hagrid would not be accused of setting Buckbeak free), Harry and Hermione hide near the Whomping Willow in the Forbidden Forest to wait for the \"other Harry and Hermione\" and everyone else to return from the Shrieking Shack. During this time, Harry tells Hermione about the man he saw across the lake and how he thinks it was his father who conjured the Patronus.\n\nAfter two hours, following Lupin's transformation, Harry decides they need to head back to Hagrid's empty cabin so Lupin doesn't attack them. After spending some time in hiding, Harry leaves the cabin to check out the present situation and sees himself, Hermione, and Black fainting from Dementors. He realises that the silver stag he saw earlier across the lake was not cast by his dad, but rather by himself, and conjures a powerful Patronus that drives all the Dementors away. When it returns to him, he pets it and realises that it was the same Patronus as \"Prongs,\" his father.\n\nAfter Hermione and Buckbeak catch up, they wait until they see Macnair leave the castle to retrieve the Dementors. He and Hermione then fly Buckbeak up to West Tower and rescue Black. Harry and Sirius say their goodbyes before Sirius flies away on Buckbeak.",
    "section": "Chapter 21: Hermione's Secret",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry and Hermione make it back to the hospital wing just in time for Dumbledore to magically lock the door. Shortly afterwards, Snape bursts in, followed by Fudge and Dumbledore, and accuses Harry of freeing Black. Fudge assumes Snape is simply delirious because his chances of receiving the Order of Merlin have gone up in smoke. Fudge leaves to inform the Daily Prophet of the news and agrees to remove the Dementors from Hogwarts, since the Dementors' attempt to perform the Dementor's Kiss on Harry proves them to be more harmful than helpful. Shortly after they leave, Ron wakes up from his unconscious state.\n\nThe next day, while most of the other students are at Hogsmeade, the trio learns that Lupin is resigning because Snape told the Slytherin house Lupin's secret. Harry goes to see Lupin and is unable to sway Lupin's mind, since Lupin does not want to risk endangering the students again. Lupin confirms Harry's suspicions that James' Animagus form was indeed a stag. Lupin then gives Harry his Invisibility Cloak back, along with the Marauder's Map, and leaves with Dumbledore to catch his carriage.\n\nLater, while talking with Dumbledore, Harry confesses that he feels bad for not letting Lupin and Black kill Pettigrew, realising that he was the servant that would aid with Voldemort's return from Trelawney's prophecy. Dumbledore reminds Harry that he saved Black, an innocent man, from a terrible fate. Furthermore, Pettigrew owes a life debt to Harry for saving him, which Dumbledore is sure will prove useful later on. Before he leaves, Dumbledore mentions that Harry has some of his father's qualities, which is why his Patronus took the form of Prongs. At the end-of-the-year feast, Gryffindor wins both the Quidditch Cup and the House Cup.\n\nThe students return to London aboard the Hogwarts Express. Hermione mentions to Harry and Ron that she gave up the Time-Turner because it caused her too much stress. She has decided to drop Muggle Studies so she can have a normal schedule again. Ron announces that he is planning to invite Harry to the Quidditch World Cup, since his father can get them tickets from work. Ron also has a telephone that he can use to contact Harry now.\n\nA tiny owl from Black then arrives on the train with a letter. In the letter, Black reveals that he is travelling far away from Hogwarts to avoid causing further problems and admits he bought Harry the Firebolt with Crookshanks' help. A separate section of the letter provides Harry with permission to visit Hogsmeade; Harry knows Dumbledore will accept it. Sirius also mentions that the tiny owl is a gift for Ron (later named Pigwidgeon by Ginny), since it is Black's fault that Ron no longer has a rat.\n\nAfter arriving at King's Cross, Ron says he will contact Harry about the finals of the Quidditch World Cup, and Harry heads back to Little Whinging with Uncle Vernon. Harry is happy he now has a true family member to depend on and mentions to Uncle Vernon that he has a godfather who had escaped from wizard prison and likes to check up on him.",
    "section": "Chapter 22: Owl Post Again",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"2\" border=\"2\"\n!Spell\n!Usage\n|-\n|Inflatus (possibly)\n|Inflatus is possibly the spell that was accidentally used nonverbally by Harry on his Aunt Marge in 4 Privet Drive because she insulted his parents. He then ran away to the Leaky Cauldron on the Knight Bus.\n|-\n|Patronus Charm\n|Professor Lupin used Expecto Patronum on a Dementor who entered the train carriage, which drove it away. Lupin then gave all of the Trio a piece of chocolate.\n|-\n|Boggart-Banishing Spell\n|Professor Lupin taught his class Riddikulus in his first lesson in order to teach them how to banish Boggarts. Neville Longbottom, Parvati Patil, Seamus Finnigan, and Ron Weasley succeeded in casting this.\n|-\n|Dissendium\n|Harry learns this from the Marauder's Map to go to Hogsmeade through a secret passage.\n|-\n|Mobiliarbus\n|Hermione uses this to move a tree towards her in the Three Broomsticks in order to hide Harry who had snuck into Hogsmeade.\n|-\n|Fidelius Charm\n|This was used to hide the location of James and Lily Potter's house. The secret keeper was Peter Pettigrew. This was discussed by Professor Flitwick, Professor McGonagall, Madam Rosmerta, Hagrid, and Cornelius Fudge, with Harry secretly listening in.\n|-\n|Cheering Charm\n|Cheering Charms were taught to Harry and the rest of his class by Professor Flitwick during a lesson in which the class divided into pairs.\n|-\n|Mobilicorpus\n|This was used by Sirius and Remus on Snape to take the Invisibility Cloak off him.\n|}",
    "section": "List of spells first introduced",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "{| class=\"wikitable\" cellspacing=\"1\" cellpadding=\"4\" border=\"2\"\n! width=\"22%\" |Character\n! width=\"22%\" |Killed by\n! width=\"17%\" |Cause of death\n! width=\"27%\" |Circumstances\n|-\n|12 Muggles\n|Peter Pettigrew\n|Blasting Curse\n|(Mentioned only)\nUsed as a diversion for Pettigrew to fake his own death and escape in his unregistered Animagus form (a fat grey rat) from Sirius Black's attempt to kill him for betraying James and Lily Potter to Lord Voldemort; framed Black for it plus the betrayal and landed him in Azkaban without a trial.\n|-\n|Bilius Weasley\n|Unknown\n|The Grim\n|(Mentioned only)\nSaw the Grim about 24 hours before his death; Fred and George Weasley stated that he never married.\n|-\n|Binky the rabbit\n|A fox\n|Mauling\n|Predicted by Sybill Trelawney to the rabbit's owner Lavender Brown.\n|-\n|Rubeus Hagrid's Flobberworms\n|Third year Care of Magical Creatures class\n|Overfeeding\n|Fed too much lettuce.\n|}",
    "section": "List of deaths",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "{{Scroll box\n|width=1000px \n|height=100%\n|content=",
    "section": "Editions",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Prisonercover.gif|British Children's Edition, published by Bloomsbury\nHarry-potter-and-the-prisoner-of-azkaban-celebratory-edition.jpg|British Celebratory Edition\nPrisoner Special Edition.jpg|British Special Edition\nPrisoner old.jpg|British original Adult Edition\nHP Prisoner of Azkaban adult edition.jpg|British Adult Edition\nNormal POA Signature.jpg|British Signature Edition\nHarry Potter and the Prisoner of Azkaban new adult edition.jpeg|British 2013 adult edition\nPOABloomsbury.JPG|British 2014 Children's Edition\nPrisoner of Azkaban cover.jpg|American, published by Scholastic\nNormal potter cover 3 CROP article568-large.jpg|American 15th anniversary edition\nUS 2018 paperback 03 POA.jpg|American 20th anniversary edition",
    "section": "English-language",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Harry Potter 3 Arabic cover.jpg|Arabic edition\nHP3-kniha.jpg|Czech, Harry Potter a Vězeň z Azkabanu, published by Albatros\n-Files-Images-Bokadeildin-permur-bokarodir-potter3midi.jpg|Faroese, Harry Potter og fangin úr Azkaban, published by Bókadeild Føroya Lærarafelags\n200px-הארי פוטר 3.JPG|Hebrew edition\nHarry Potter and the Prisoner of Azkaban - Hungarian.jpg|Hungarian, Harry Potter és az Azkabani Fogoly\nLithuanian original 03 POA.jpg|Lithuanian, Haris Poteris ir Azkabano kalinys, published by Alma Littera\nHarry Potter Cover 3 Serbian.jpg|Serbian, Hari Poter i Zatvorenik iz Askabana, published by Evro Giunti\nHarry potter in jetnik iz azkabana.jpg|Slovenian, Harry Potter in jetnik iz azkabana\nHarryAzkaban.jpg|Turkish, Harry Potter ve Azkaban Tutsağı",
    "section": "Translations (cover based on Scholastic's)",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Bosnian 03 POA.png|Bosnian, Harry Potter i zatvorenik Azkabana, published by Buybook\nBulgarian 2019 hardback 03 POA.png|Bulgarian 20th anniversary edition, Хари Потър и затворникът от Азкабан, published by Egmont Bulgaria\nDanish cover vol3.jpg|Danish, Harry Potter og Fangen fra Azkaban, published by Gyldendal\nDanish adult cover 3.jpg|Danish adult edition\nDanish 2012 paperback 03 POA.jpg|Danish 2012 paperback\nDutch original 03 POA.jpg|Dutch, Harry Potter en de Gevangene van Azkaban, published by De Harmonie and Standaard\nDutch Prisoner of Azkaban book cover.jpeg|Dutch (the Netherlands) 2010 Pocket edition, published by Uitgeverij De Harmonie\nFinnish Book 3 cover.jpg|Finnish, Harry Potter ja Azkabanin vanki, published by Tammi\nFrench Book 3 Cover.jpg|French original paperback, ''Harry Potter et le Prisonnier d'Azkaban, published by Éditions Gallimard\nFrench T3 (2011 new edition).png|French 2011 paperback\nFrench T3 (2016 new edition).jpg|French 2016 edition\nHarry potter und der gefangene von askaban.jpg|German, Harry Potter und der Gefangene von Askaban, published by Carlsen Verlag\nGerman 03 POA.png|German edition\nGerman Adult Edition 03 POA.png|German adult edition\nGerman 2013 Pocket 03 POA.png|German 2013 Anniversary Pocket Edition\nGerman 2018 hardback 03 POA.png|German 20th anniversary edition\n1499934506651.jpeg|Indonesian, Harry Potter dan Tawanan Azkaban\nItalian 03 POA.jpg|Italian, Harry Potter e il prigioniero di Azkaban, published by Adriano Salani Editore\nItalian 2021 redesign 03 POA.png|Italian 2021 redesign\nJapanese original hardback 03 POA.png|Japanese original hardback, ハリー・ポッターとアズカバンの囚人'', published by Say-zan-sha\nJapanese shinsouban hardback 03 POA.png|Japanese 20th anniversary edition\nLithuanian 2020 hardback 03 POA.png|Lithuanian 20th anniversary edition\nHP3BOX.png|Brazilian Portuguese collector's edition, Harry Potter e o Prisioneiro de Azkaban, published by Rocco\nSlovak 2020 exclusive box set 03 POA.png|Slovak 20th anniversary edition, Harry Potter a väzeň z Azkabanu, published by IKAR\nSpanish 03 POA.gif|Spanish, Harry Potter y el prisionero de Azkaban, published by Salamandra\nSpanish 15th anniversary 03 POA.jpg|Spanish 15th anniversary edition\nHarry Potter Och Fangen fran Azkaban - Swedish.jpg|Swedish, Harry Potter och Fången från Azkaban, published by Tiden\nThai 2020 hardback 03 POA.jpg|Thai 20th anniversary edition, published by Nanmeebooks\nAzkaban-Tutsagi-kap-8268.jpg|Turkish edition\nPOA Ukrainian edition.jpg|Ukrainian, ''Гаррі Поттер і в'язень Азкабану'', published by А-БА-БА-ГА-ЛА-МА-ГА\n\n}}",
    "section": "Translations (alternative covers)",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "Bloomsbury 03 POAIE cover - Jim Kay.jpg|UK Illustrated Edition (Bloomsbury)\nScholastic 03 POAIE cover - Jim Kay.jpg|US Illustrated Edition (Arthur A. Levine Books)\nHP3IllustratedITA.jpg|Italian Illustrated Edition (Salani Editore)\n91vadvDarHL.jpg|French Edition",
    "section": "Illustrated Editions",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "UK House Edition hardback Gryffindor 03 POA.png\nUK House Edition hardback Hufflepuff 03 POA.png\nUK House Edition hardback Ravenclaw 03 POA.png\nUK House Edition hardback Slytherin 03 POA.png",
    "section": "Hogwarts House Edition",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "*Along with Half-Blood Prince, this is one of the books in the series in which the US and UK cover artwork depict the same scene and the same characters. In addition, most cover artwork for any edition in any country depicts this scene, with the exceptions being the Adult version, the Signature Bloomsbury version, the fully illustrated version and the German version. Incidentally, these two books both feature a character in the title other than Harry Potter. *Rowling's original plan was for Aunt Petunia to be inflated, as seen at the end of the second book. *Prisoner of Azkaban and ''Philosopher's Stone are the only books that do not have a chapter with the same title as the book. *Although somewhat darker than the first book, this one holds the distinction of being the only Harry Potter book where no one actually dies during the events of the book (with the possible exception of , where the Basilisk, a magical creature of indeterminate sentience, was the only being to die). Although it appears that Buckbeak dies, he was in fact saved by the time-travelling Harry and Hermione. What the trio thought was the execution was in fact Macnair swinging his axe into a stump out of frustration. *This is one of only two books, along with the Half-Blood Prince, where Voldemort does not appear in person. **This is the only book where Voldemort is not seen at all, even in memories, although he is mentioned numerous times. In fact, he is not only not the main antagonist, but he has almost nothing to do directly'' with the events of the book. *This is the first of two books in which the title refers to a character, the other being the sixth book, . *This is the only book in the series whose name has a word completely original to the series, this word being \"Azkaban\". *This is also the only book in the series in which the title is not referred to at all in the text (the phrase 'prisoner of Azkaban' never appears in the book.)\n*One of the biggest morals from the series is that it is not one's abilities that make them who they are; it is their choices. However, the climax of this book possibly creates a , which, essentially, negates the doctrine of .",
    "section": "Behind the scenes",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "*This is the only book where the main antagonist is not directly or indirectly (in the case of book 5) influenced by Voldemort or is Voldemort himself. *When Harry restrained Lupin and Sirius from killing Pettigrew, he (arguably) made the first mistake that led to the second rise of Lord Voldemort. *Harry Potter and the Prisoner of Azkaban introduces four different magical elements that take on a unique property based on the specific wizard—the Dementor (which causes a wizard to experience their worst memories), the Boggart (which takes the form of a wizard's greatest fear), the Patronus Charm (which creates an animal guardian specific to each wizard), and the Animagus transformation (in which a wizard may transform into an animal form that is unknown to them until they undergo the transformation for the first time.)\n*Professor Lupin prevented Harry from confronting the Boggart in the cabinet because he feared that the Boggart would turn into Lord Voldemort. However, Harry didn't know what Voldemort really looked like, since his only encounter at this point with Voldemort was during the Philosopher's Stone two years ago, when he was possessing Professor Quirrell, not to mention Harry had never seen any kind of drawing or photograph of Voldemort. So, the Boggart might have taken Quirrell's form if Harry's fear was Lord Voldemort, potentially that of the face of Lord Voldemort which emerged from the back of Quirrell's head. *The first book in which Harry does not prevent the return of Lord Voldemort. Instead, he arguably helps Voldemort return by stopping Sirius Black and Remus Lupin from killing Peter Pettigrew, who in turn would help Voldemort return to his body in the next book. *This book breaks a lot of the plot details from the previous two books. Them being; This is the first book in the series where the climax doesn't take place in an underground chamber of Hogwarts, the first book where Dumbledore is present at Hogwarts during the climax (as he was absent from the school in the first two books' climax), the first of only two books in the series where Voldemort doesn't appear, and the only book in the series where Voldemort isn't the main villain.",
    "section": "Behind the scenes",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "In October 1993 (the year this story takes place) the 16th was actually a Saturday, but in their first Divination lesson, Lavender Brown is told to be weary of Friday 16th of October.",
    "section": "Mistakes",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "*Another bit of foreshadowing takes place in the chapter ''Aunt Marge's Big Mistake''. When Uncle Vernon watches the news report about Sirius Black, he gets mad that the reporter didn't say where he escaped from and comments, \"Lunatic could be coming up the street right now!\" He does not know that in a week, this will be true.",
    "section": "Style",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "The book was also adapted into a film, the third Harry Potter film of the series. The film Harry Potter and the Prisoner of Azkaban was released on 31 May, 2004 (UK) and on 4 June, 2004 (US). It was directed by Alfonso Cuarón and the trio was starred by Daniel Radcliffe, Rupert Grint and Emma Watson.",
    "section": "Film adaptation",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  },
  {
    "text": "*\n*\n*\n*Harry Potter and the Prisoner of Azkaban (character index)\n*Third year\n\nde:Harry Potter und der Gefangene von Askaban\nes:Harry Potter y el prisionero de Azkaban\net:Harry Potter ja Azkabani vang\nfi:Harry Potter ja Azkabanin vanki\nfr:Harry Potter et le prisonnier d'Azkaban\nit:Harry Potter e il Prigioniero di Azkaban\nja:ハリー・ポッターとアズカバンの囚人\nnl:Harry Potter en de Gevangene van Azkaban\nno:Harry Potter og fangen fra Azkaban\npl:Harry Potter i Więzień Azkabanu\npt:Harry Potter e o Prisioneiro de Azkaban\nru:Гарри Поттер и узник Азкабана\ntr:Harry Potter ve Azkaban Tutsağı (kitap)\nuk:Гаррі Поттер і в'язень Азкабану\nvi:Harry Potter và Tên tù nhân Ngục Azkaban\nzh:哈利·波特与阿兹卡班囚徒\n3\nCategory:Canon",
    "section": "See also",
    "name": "Prisoner of Azkaban",
    "type": "books",
    "series": "HarryPotter",
    "book_number": 3,
    "source_book": "Prisoner of Azkaban"
  }
]